{
    "  the devil is beating his wife  also known as  sunshower  or  sun shower  ": {
        "  raining whereas the sun is shining.  when the sun is shining yet it’s raining.  when it’s raining but the sun is shining at the same time.  ": "  The sunshower is said to occur when   the devil is beating his wife   in various German-speaking countries.  Today,  the devil is beating his wife  in our city—it’s  raining cats and dogs  and the sun is also shining.  Yesterday, I witnessed a very rare occurrence known as “ the devil is beating his wife .”  People in the Southern United States usually  come across  a weird natural phenomenon called “ the devil is beating his wife .”  Everybody laughed when a kid asked her mom, “Mamma, I want to see how  the devil is beating his wife .”  "
    },
    "  a bed of roses  ": {
        "  easy option  a comfortable or luxurious position  an effortless, happy situation  a luxurious circumstances  a trouble-free living  ": "  Weight loss is a challenging task, not  a bed of roses .  Making money is not  a bed of roses ; you have to wake up early and go to work.  The life of the royal family is  a bed of roses .  Before cutting ties with my family, my life was  a bed of roses  because my Mom did everything for me.  My friend told me that he wants to live in  a bed of roses  without hard work. Winning the Jackpot made his dream come true.  The corrupt leaders have made their life  a bed of roses  with the help of black money.  How can you make your life  a bed of roses  without working very hard?  I never believed miracles, but after meeting Brian Greene, a dull and old but diamond ring that he found in his garden made his life  a bed of roses .  "
    },
    " Meaning | Definition ": {
        " Whether English is the reader’s native language or not, this page helps to understand the meaning of both the opposite words and helps the reader enhance their vocabulary and knowledge of spellings. Similar (synonyms) and opposite (antonyms) words are helpful to know as they improve reading and writing skills. They allow students to understand the text at a deeper, richer level. Students learn to differentiate between shades of meaning by learning opposite words that enable them to be more precise and enhancing their overall command of English. Next on this page, you will find a list of more than 100 most common, basic, and top opposite English words. ": "  Share your thoughts or suggest more opposites.  "
    },
    "  break a leg  ": {
        "  good luck  best wishes  stroke of luck  to wish someone luck especially before a performance  ": "  “ Break a leg !” shouted the stage director to his actors before the beginning of the play.  You have an exam tomorrow?  Break a leg !  “My first stage performance is scheduled for tonight.” “Well,  break a leg !”  “ Break a leg !” I shouted out to him before he rushed in for his auditions.  When the team went out for the final race, the coach shouted out to them “ break a leg !”  I wish you good luck on the completion of your book writing for publishing.  Break a leg !  "
    },
    "  look forward to  ": {
        "  to eagerly await something  to be excited about something that is going to happen  the term can also be used in its literal form  ": "  I am  looking forward to  seeing my best friend next weekend. I have not seen him for six months.  Jane always  looks forward to  taking official tours.  We are all  looking forward to  our holiday in Mauritius. We can’t wait to swim with the dolphins.  They are  looking forward to  meeting up with their family over the weekend.  I am  looking forward to  the new Avengers movie that will be released soon.  He is  looking forward to  his wedding day.  I  look forward  to seeing the letter you have sent to me.  "
    },
    "  buy the farm  ": {
        "  to die  to pass away  depart from the world  lose life all of a sudden  meet the death  to get perish  ending up in the grave   kick the bucket   ": "  Mister Jack was really ill from the past two months and yesterday he  bought the farm .  Sara is just eighteen years old, too young to  buy the farm .  Don’t worry! John will survive this heart attack, he won’t  buy the farm .  Michal lived for a few days after her collapse and then she  bought the farm .  I really want to visit New Zealand once, before I  buy the farm .  "
    },
    " a  bone to pick  with also,  pick a bone  with ": {
        "  having a complaint that needs to be discussed.  something to argue about, a matter to discuss.  an unpleasant issue that needs discussion.  a person has an issue with another individual, that must be addressed or resolved.  two people are literally fighting over an object, an idea, a grievance, or another person.  ": "  Jake walked up to Robert and told him that he had  a bone to pick with  him.  Frank was the first one to   pick a bone  with  Johnny, explaining that he was always wrong.  Catrina decided to send Jill a DM telling her that she was about to  pick some bones with  her.  Ruth was hesitant. She didn’t want to  pick a bone with  a random guy she’d never met.  Alderman Masterson had  a  bone to pick  with  his constituents. They were making unrealistic demands for him to resolve all of the issues within their community.  When it comes to many Americans’ eating habits, the etiquette experts in the United States  have a bone to pick .  The two reputed universities in the state  have a bone to pick with  each other over the reservation policy for admissions.  "
    },
    "  have designs on  ": {
        "  to have a plan or  secret  desire to get something.  contrive a secret plot or scheme, especially with  selfish  motives.  to want a sexual  relationship  or want to date someone.  make a secret plot or scheme, usually with selfish intentions.  to pursue something or someone for selfish reasons.  take someone or something for yourself.  ": "  I knew he   had designs on   my job the first time I saw him.  I can see you  have designs on  Anna.  The thieves  had designs on  the marchioness’ jewellery.  Agatha  has designs on  Jimmy, and she plans to marry him soon.  France  has had designs on  Belgium’s territory from the beginning.  I think she  has designs on  my science project for the purpose of showing me down.  "
    },
    "  on the line  ": {
        "  to be at serious  risk .  denoting the fact that something is being risked.  line up in formation (military, sports, etc.).  a gambling term that can be applied to a variety of  games  of chance.  ": "  Put your toes   on the line   and form up!  I’m going to risk it and put it all  on the line .  By making this investment, he’s putting everything  on the line .  Open-pen  fish  farms are  on the line  along the west coasts of both Canada and the United States.  Michigan’s future is  on the line  as a result of the rising violence.  "
    },
    "  keep one’s own counsel  ": {
        "  say little or nothing about one’s opinions or intentions.  to remain  silent  about one’s thoughts or plans  to say little or nothing about one’s opinion.  to keep quiet about one’s views or intentions.  to conceal one’s thoughts and intentions.  ": "  I doubted what he said, but I   kept my own counsel  .  Naomi is naturally a private person, so she  keeps her own counsel .  Our boss is notorious for  keeping his own counsel ; you never know what he has in his  mind .  I would love to know what Talia thinks, but she  keeps her own counsel .  My boss is the person who says less but acts more, so he  keeps his own counsel .  He is notorious for  keeping his own counsel ; you never know what he is  thinking .  Her mother advised her to  keep her own counsel .  We were curious to understand why Jane  kept her own counsel  during the meeting and just listened to the rest of us.  "
    },
    "  a quick buck  also,  a fast buck  ": {
        "  to make  money  quickly.  to make money in a dishonest manner.  to earn money quickly and fast, usually in an unethical way.  to earn an amount of money by completing a favour for another individual.  an offer to  help  someone make money quickly for taking on a job.  ": "  He decided to make   a quick buck   by selling his CD collection.  It was  a fast buck  scheme that ended up costing people a lot of money.  Making  a quick buck  can help people to pay their bills when they need to.  People will look to make  a fast buck  when they need something.  Jack is trying to make   a fast buck   by selling burgers on a busy street.  I like her because she never likes to make  a quick buck  through dishonesty.  You can’t make  a fast buck  for so long using scams.  "
    },
    "  sacred cow  ": {
        "  something that people believe or accept as true without questioning it.  being unreasonably immune from criticism or opposition.  an institution, idea, or custom that is held to be above criticism.  something that people do not like to question.  a taboo subject.  something that many people think is too important to change, question, or criticize.  something that cannot be interfered with or harmed in any way.  ": "  The journalist esteemed too many   sacred cows  .  The old  governmgent  program has become a  sacred cow .  Christianity is a  sacred cow  among many people.  The priest was considered a  sacred cow  among his congregants.  They couldn’t dare oppose the  sacred cow  of legislative democracy.  Prince Harry advised the people not to make a  sacred cow  of the monarchy.  The new head teacher said the school would have numerous changes as nothing is a  sacred cow .  The judiciary remains a  sacred cow , despite growing evidence that fatal mistakes have been made.  "
    },
    "  raining cats and dogs  ": {
        "  too much heavy rain  torrential rain  very heavily raining  raining tremendously  ": "  It’s  raining cats and dogs  I am worried about how my kids will reach home.  It  rains cats and dogs  when the Monsoon comes in India.  How will you go to play Cricket today? It’s  raining cats and dogs .  When we were returning from the picnic, it was  raining cats and dogs .  I think it’s not safe to drive the car now – it’s  raining cats and dogs .  "
    },
    "  can’t (or don’t) judge a book by its cover  ": {
        "  outward appearance cannot be an indicator of someone or something’s value or worth  you cannot know what someone or something is like just by looking the person or thing’s appearance  the quality or character of  someone or something cannot be judged just by looking at them  an opinion of someone or something cannot be formed solely by seeing what’s on the surface  ": "  The candidate did not look very intelligent, but you  can’t judge a book by its cover .  The hotel looked attractive from outside, but the rooms were damp and not well maintained. You  can’t judge a book by its cover !  Do not form opinions of a persons character by looking at his appearance. You  can’t judge a book by its cover .  At first we did not want to go into the restaurant as it looked small and cramped; but the food was delicious – we realized that you  can’t judge a book by its cover .  The car was small and looked unsuited for a long trip, but packed a lot of power and was very solid. You  can’t judge a book by its cover .  That man may look very small and insignificant, but  don’t judge a book by its cover  – he’s a very powerful man in his circle.  "
    },
    "  make a clean breast  ": {
        "  to tell the  truth  about something.  speak openly and honestly about something (especially if it was kept a  secret  or has been lied about in the past).  admitting and confessing.  to make a confession or to tell the truth about something you  feel  guilty about.  ": "  Sharon  made a clean breast  of it and threw Ashley under the bus.  He finally decided to   make a clean breast   of it and admitted to robbing the priest.  After a thorough interrogation, she  made a clean breast  of it and exposed the real culprit.  The footballer  made a clean breast  to his coach on the drug use claims.  John eventually  made a clean breast  of it and admitted to copying the assignment.  Jay had to  make a clean breast  of his dealings after he was caught with marijuana.  Harry is yet to  make a clean breast  and admit that he is involved in fraudulent activities.  The child wanted to  make a clean breast  about what he had taken from his mother’s purse.  I have never been so happy as when I  made a clean breast  of my wrongdoings and  got rid of  that dark cloud that was following me for years.  Many of our clients are professionals and want to  make a clean breast  before joining our company.  The therapist asked me to  make a clean breast  of my problems and get over them once and for all.  I  made a clean breast  of my past relationship with that girl and told my parents about it.  While wedged stealing in a supermarket, Robert decided to  make a clean breast  of it to the owner of the store.  "
    },
    "  it’s a small world  ": {
        "  meeting someone not expected to be at a certain place  encountering the same people, events, or situations in an unexpected place  someone knows a person you know  used to express surprise that events or people at different places are somehow connected  a water-based boat ride located in the Fantasyland area at the various Walt Disney Parks and Resorts worldwide  ": "  I had no contact with him since school, and I bumped into him at a friend’s party!  It’s a small world .  My old English teacher is your aunt? Well, it’s a small world indeed!  Fancy running into you here. I thought I would never see you again!  It’s a small world .  Do you know my friend from school? Wow,  it’s a small world , isn’t it?  Imagine meeting her at the theater last night.  It’s a small world .  I never thought I’d run into her at a sports ground –  it’s a small world .  It was great catching up with you after all this time. I never imagined you would be here –  it’s a small world .    It’s a small world , it was good to see her in Australia.   "
    },
    "  sell like hot cakes  ": {
        "  be a great commercial success  to dispose of something very quickly and with little effort  to sell or get rid of large quantities of something very easily  ": "  These books are  selling like hotcakes .  John says that the new cars are  selling like hotcakes .  It is very hot outside. These ice lollies will  sell like hotcakes .  I am making cupcakes for the school fete. They always  sell like hotcakes .  The 2K model cars by BMW  sold like hot cakes , and it was hard to produce them by company to fulfill the demands.  "
    },
    "  easier said than done  ": {
        "  to explain that a  task  is easier to talk about than perform.  to state that it is easier to talk about perfection than achieve it.  to state that changing a person’s  mind  is not simple.  something that appears  easy  but is difficult to do.  ": "  It’s   easier said than done   when it comes to convincing people that something is true.  It was  easier said than done  to lug those buckets up three flights of stairs.  Getting a  cat  to obey commands is  easier said than done .  You can bet that getting people to listen to an opposing viewpoint is  easier said than done .  The doctor said that because of your addiction, it would be  easier said than done , but you must stop smoking and drinking.  "
    },
    "  come to grief  ": {
        "  to have an accident or suffer disaster.  the failure of something.  to experience misfortune or  failure .  to end in disaster.  to be destroyed and ruined.  to foretell tragedy.  ": "  Their relationship   came to grief   following their disastrous vacation.  His attempts at creating a business  came to grief  following a bad investment.  The ship and its crew  came to grief  after running aground several miles offshore.  Her entire family felt that she would   come to grief   if she pushed the idea of marriage too quickly.  It would be a great pity to see all that sincere work  come to grief .  "
    },
    " (has/have/had)  been around  ": {
        "  (existed) been present and active.  to have gained worldly experience.  to have seen or experienced several things in one’s life.  to describe  life  experiences.  to denote that one is not easily  fooled .  ": "  This is not a new viral video; it’s   been around   for a couple of years.  They  have been around  long enough to see a few things.  If John  had been around , he would not have allowed the loading of the ship due to bad  weather .  You can’t fool someone that  has been around  since the 60s.  I  have been around  long enough to learn a few valuable lessons.  There is nothing new about laptops; they’ve  been around  for years.  I  have been around  the block a few times.  "
    },
    "  no pain, no gain  ": {
        "  it is necessary to work hard or strive to reap rewards  suffer to achieve results  in order to improve, progress, or succeed you must subject yourself to difficult or even painful training  if not hardworking, then no achievement  intense hard work returns more results  ": "  If you want to win the title next month, you have to train for an extra hour every day next week.  No pain, no gain .  Get those legs moving faster, faster, come on,  no pain, no gain .  You have to put in a 12-hour day.  No pain, no gain  if you want to succeed in this world.  He ran 20 miles yesterday as part of his training for the marathon. His legs are aching today, but  no pain, no gain .  Top athletes and committed fitness enthusiasts may continue to adhere to the “ no pain, no gain ” method of exercise.  Jack humorously called his trainer a “pain” but followed it by saying  there is no gain if there is no pain .  New Western study shows  no pain, no gain  for knee osteoarthritis (degenerative joint disease).  The saying “ no pain, no gain ” is the key to my success and always inspires me to work harder.  The beautiful actress says, “ no pain, no gain , shut up and train,” as she hits the gym after months.  Noah wakes up early in the morning every day.  No pain, no gain .  "
    }
}