{
    "  the devil is beating his wife  also known as  sunshower  or  sun shower  ": {
        "  raining whereas the sun is shining.  when the sun is shining yet it’s raining.  when it’s raining but the sun is shining at the same time.  ": "  The sunshower is said to occur when   the devil is beating his wife   in various German-speaking countries.  Today,  the devil is beating his wife  in our city—it’s  raining cats and dogs  and the sun is also shining.  Yesterday, I witnessed a very rare occurrence known as “ the devil is beating his wife .”  People in the Southern United States usually  come across  a weird natural phenomenon called “ the devil is beating his wife .”  Everybody laughed when a kid asked her mom, “Mamma, I want to see how  the devil is beating his wife .”  "
    },
    "  break a leg  ": {
        "  good luck  best wishes  stroke of luck  to wish someone luck especially before a performance  ": "  “ Break a leg !” shouted the stage director to his actors before the beginning of the play.  You have an exam tomorrow?  Break a leg !  “My first stage performance is scheduled for tonight.” “Well,  break a leg !”  “ Break a leg !” I shouted out to him before he rushed in for his auditions.  When the team went out for the final race, the coach shouted out to them “ break a leg !”  I wish you good luck on the completion of your book writing for publishing.  Break a leg !  "
    },
    "  sacred cow  ": {
        "  something that people believe or accept as true without questioning it.  being unreasonably immune from criticism or opposition.  an institution, idea, or custom that is held to be above criticism.  something that people do not like to question.  a taboo subject.  something that many people think is too important to change, question, or criticize.  something that cannot be interfered with or harmed in any way.  ": "  The journalist esteemed too many   sacred cows  .  The old  governmgent  program has become a  sacred cow .  Christianity is a  sacred cow  among many people.  The priest was considered a  sacred cow  among his congregants.  They couldn’t dare oppose the  sacred cow  of legislative democracy.  Prince Harry advised the people not to make a  sacred cow  of the monarchy.  The new head teacher said the school would have numerous changes as nothing is a  sacred cow .  The judiciary remains a  sacred cow , despite growing evidence that fatal mistakes have been made.  "
    },
    "  buy the farm  ": {
        "  to die  to pass away  depart from the world  lose life all of a sudden  meet the death  to get perish  ending up in the grave   kick the bucket   ": "  Mister Jack was really ill from the past two months and yesterday he  bought the farm .  Sara is just eighteen years old, too young to  buy the farm .  Don’t worry! John will survive this heart attack, he won’t  buy the farm .  Michal lived for a few days after her collapse and then she  bought the farm .  I really want to visit New Zealand once, before I  buy the farm .  "
    },
    "  keep one’s own counsel  ": {
        "  say little or nothing about one’s opinions or intentions.  to remain  silent  about one’s thoughts or plans  to say little or nothing about one’s opinion.  to keep quiet about one’s views or intentions.  to conceal one’s thoughts and intentions.  ": "  I doubted what he said, but I   kept my own counsel  .  Naomi is naturally a private person, so she  keeps her own counsel .  Our boss is notorious for  keeping his own counsel ; you never know what he has in his  mind .  I would love to know what Talia thinks, but she  keeps her own counsel .  My boss is the person who says less but acts more, so he  keeps his own counsel .  He is notorious for  keeping his own counsel ; you never know what he is  thinking .  Her mother advised her to  keep her own counsel .  We were curious to understand why Jane  kept her own counsel  during the meeting and just listened to the rest of us.  "
    },
    "  a bed of roses  ": {
        "  easy option  a comfortable or luxurious position  an effortless, happy situation  a luxurious circumstances  a trouble-free living  ": "  Weight loss is a challenging task, not  a bed of roses .  Making money is not  a bed of roses ; you have to wake up early and go to work.  The life of the royal family is  a bed of roses .  Before cutting ties with my family, my life was  a bed of roses  because my Mom did everything for me.  My friend told me that he wants to live in  a bed of roses  without hard work. Winning the Jackpot made his dream come true.  The corrupt leaders have made their life  a bed of roses  with the help of black money.  How can you make your life  a bed of roses  without working very hard?  I never believed miracles, but after meeting Brian Greene, a dull and old but diamond ring that he found in his garden made his life  a bed of roses .  "
    },
    " (has/have/had)  been around  ": {
        "  (existed) been present and active.  to have gained worldly experience.  to have seen or experienced several things in one’s life.  to describe  life  experiences.  to denote that one is not easily  fooled .  ": "  This is not a new viral video; it’s   been around   for a couple of years.  They  have been around  long enough to see a few things.  If John  had been around , he would not have allowed the loading of the ship due to bad  weather .  You can’t fool someone that  has been around  since the 60s.  I  have been around  long enough to learn a few valuable lessons.  There is nothing new about laptops; they’ve  been around  for years.  I  have been around  the block a few times.  "
    },
    "  make a clean breast  ": {
        "  to tell the  truth  about something.  speak openly and honestly about something (especially if it was kept a  secret  or has been lied about in the past).  admitting and confessing.  to make a confession or to tell the truth about something you  feel  guilty about.  ": "  Sharon  made a clean breast  of it and threw Ashley under the bus.  He finally decided to   make a clean breast   of it and admitted to robbing the priest.  After a thorough interrogation, she  made a clean breast  of it and exposed the real culprit.  The footballer  made a clean breast  to his coach on the drug use claims.  John eventually  made a clean breast  of it and admitted to copying the assignment.  Jay had to  make a clean breast  of his dealings after he was caught with marijuana.  Harry is yet to  make a clean breast  and admit that he is involved in fraudulent activities.  The child wanted to  make a clean breast  about what he had taken from his mother’s purse.  I have never been so happy as when I  made a clean breast  of my wrongdoings and  got rid of  that dark cloud that was following me for years.  Many of our clients are professionals and want to  make a clean breast  before joining our company.  The therapist asked me to  make a clean breast  of my problems and get over them once and for all.  I  made a clean breast  of my past relationship with that girl and told my parents about it.  While wedged stealing in a supermarket, Robert decided to  make a clean breast  of it to the owner of the store.  "
    },
    "  on the line  ": {
        "  to be at serious  risk .  denoting the fact that something is being risked.  line up in formation (military, sports, etc.).  a gambling term that can be applied to a variety of  games  of chance.  ": "  Put your toes   on the line   and form up!  I’m going to risk it and put it all  on the line .  By making this investment, he’s putting everything  on the line .  Open-pen  fish  farms are  on the line  along the west coasts of both Canada and the United States.  Michigan’s future is  on the line  as a result of the rising violence.  "
    },
    "  have designs on  ": {
        "  to have a plan or  secret  desire to get something.  contrive a secret plot or scheme, especially with  selfish  motives.  to want a sexual  relationship  or want to date someone.  make a secret plot or scheme, usually with selfish intentions.  to pursue something or someone for selfish reasons.  take someone or something for yourself.  ": "  I knew he   had designs on   my job the first time I saw him.  I can see you  have designs on  Anna.  The thieves  had designs on  the marchioness’ jewellery.  Agatha  has designs on  Jimmy, and she plans to marry him soon.  France  has had designs on  Belgium’s territory from the beginning.  I think she  has designs on  my science project for the purpose of showing me down.  "
    },
    " a  bone to pick  with also,  pick a bone  with ": {
        "  having a complaint that needs to be discussed.  something to argue about, a matter to discuss.  an unpleasant issue that needs discussion.  a person has an issue with another individual, that must be addressed or resolved.  two people are literally fighting over an object, an idea, a grievance, or another person.  ": "  Jake walked up to Robert and told him that he had  a bone to pick with  him.  Frank was the first one to   pick a bone  with  Johnny, explaining that he was always wrong.  Catrina decided to send Jill a DM telling her that she was about to  pick some bones with  her.  Ruth was hesitant. She didn’t want to  pick a bone with  a random guy she’d never met.  Alderman Masterson had  a  bone to pick  with  his constituents. They were making unrealistic demands for him to resolve all of the issues within their community.  When it comes to many Americans’ eating habits, the etiquette experts in the United States  have a bone to pick .  The two reputed universities in the state  have a bone to pick with  each other over the reservation policy for admissions.  "
    },
    "  sell like hot cakes  ": {
        "  be a great commercial success  to dispose of something very quickly and with little effort  to sell or get rid of large quantities of something very easily  ": "  These books are  selling like hotcakes .  John says that the new cars are  selling like hotcakes .  It is very hot outside. These ice lollies will  sell like hotcakes .  I am making cupcakes for the school fete. They always  sell like hotcakes .  The 2K model cars by BMW  sold like hot cakes , and it was hard to produce them by company to fulfill the demands.  "
    },
    "  a quick buck  also,  a fast buck  ": {
        "  to make  money  quickly.  to make money in a dishonest manner.  to earn money quickly and fast, usually in an unethical way.  to earn an amount of money by completing a favour for another individual.  an offer to  help  someone make money quickly for taking on a job.  ": "  He decided to make   a quick buck   by selling his CD collection.  It was  a fast buck  scheme that ended up costing people a lot of money.  Making  a quick buck  can help people to pay their bills when they need to.  People will look to make  a fast buck  when they need something.  Jack is trying to make   a fast buck   by selling burgers on a busy street.  I like her because she never likes to make  a quick buck  through dishonesty.  You can’t make  a fast buck  for so long using scams.  "
    },
    "  look forward to  ": {
        "  to eagerly await something  to be excited about something that is going to happen  the term can also be used in its literal form  ": "  I am  looking forward to  seeing my best friend next weekend. I have not seen him for six months.  Jane always  looks forward to  taking official tours.  We are all  looking forward to  our holiday in Mauritius. We can’t wait to swim with the dolphins.  They are  looking forward to  meeting up with their family over the weekend.  I am  looking forward to  the new Avengers movie that will be released soon.  He is  looking forward to  his wedding day.  I  look forward  to seeing the letter you have sent to me.  "
    },
    "  can’t (or don’t) judge a book by its cover  ": {
        "  outward appearance cannot be an indicator of someone or something’s value or worth  you cannot know what someone or something is like just by looking the person or thing’s appearance  the quality or character of  someone or something cannot be judged just by looking at them  an opinion of someone or something cannot be formed solely by seeing what’s on the surface  ": "  The candidate did not look very intelligent, but you  can’t judge a book by its cover .  The hotel looked attractive from outside, but the rooms were damp and not well maintained. You  can’t judge a book by its cover !  Do not form opinions of a persons character by looking at his appearance. You  can’t judge a book by its cover .  At first we did not want to go into the restaurant as it looked small and cramped; but the food was delicious – we realized that you  can’t judge a book by its cover .  The car was small and looked unsuited for a long trip, but packed a lot of power and was very solid. You  can’t judge a book by its cover .  That man may look very small and insignificant, but  don’t judge a book by its cover  – he’s a very powerful man in his circle.  "
    },
    "  no pain, no gain  ": {
        "  it is necessary to work hard or strive to reap rewards  suffer to achieve results  in order to improve, progress, or succeed you must subject yourself to difficult or even painful training  if not hardworking, then no achievement  intense hard work returns more results  ": "  If you want to win the title next month, you have to train for an extra hour every day next week.  No pain, no gain .  Get those legs moving faster, faster, come on,  no pain, no gain .  You have to put in a 12-hour day.  No pain, no gain  if you want to succeed in this world.  He ran 20 miles yesterday as part of his training for the marathon. His legs are aching today, but  no pain, no gain .  Top athletes and committed fitness enthusiasts may continue to adhere to the “ no pain, no gain ” method of exercise.  Jack humorously called his trainer a “pain” but followed it by saying  there is no gain if there is no pain .  New Western study shows  no pain, no gain  for knee osteoarthritis (degenerative joint disease).  The saying “ no pain, no gain ” is the key to my success and always inspires me to work harder.  The beautiful actress says, “ no pain, no gain , shut up and train,” as she hits the gym after months.  Noah wakes up early in the morning every day.  No pain, no gain .  "
    },
    "  it’s a small world  ": {
        "  meeting someone not expected to be at a certain place  encountering the same people, events, or situations in an unexpected place  someone knows a person you know  used to express surprise that events or people at different places are somehow connected  a water-based boat ride located in the Fantasyland area at the various Walt Disney Parks and Resorts worldwide  ": "  I had no contact with him since school, and I bumped into him at a friend’s party!  It’s a small world .  My old English teacher is your aunt? Well, it’s a small world indeed!  Fancy running into you here. I thought I would never see you again!  It’s a small world .  Do you know my friend from school? Wow,  it’s a small world , isn’t it?  Imagine meeting her at the theater last night.  It’s a small world .  I never thought I’d run into her at a sports ground –  it’s a small world .  It was great catching up with you after all this time. I never imagined you would be here –  it’s a small world .    It’s a small world , it was good to see her in Australia.   "
    },
    "  easier said than done  ": {
        "  to explain that a  task  is easier to talk about than perform.  to state that it is easier to talk about perfection than achieve it.  to state that changing a person’s  mind  is not simple.  something that appears  easy  but is difficult to do.  ": "  It’s   easier said than done   when it comes to convincing people that something is true.  It was  easier said than done  to lug those buckets up three flights of stairs.  Getting a  cat  to obey commands is  easier said than done .  You can bet that getting people to listen to an opposing viewpoint is  easier said than done .  The doctor said that because of your addiction, it would be  easier said than done , but you must stop smoking and drinking.  "
    },
    "  come to grief  ": {
        "  to have an accident or suffer disaster.  the failure of something.  to experience misfortune or  failure .  to end in disaster.  to be destroyed and ruined.  to foretell tragedy.  ": "  Their relationship   came to grief   following their disastrous vacation.  His attempts at creating a business  came to grief  following a bad investment.  The ship and its crew  came to grief  after running aground several miles offshore.  Her entire family felt that she would   come to grief   if she pushed the idea of marriage too quickly.  It would be a great pity to see all that sincere work  come to grief .  "
    },
    "  raining cats and dogs  ": {
        "  too much heavy rain  torrential rain  very heavily raining  raining tremendously  ": "  It’s  raining cats and dogs  I am worried about how my kids will reach home.  It  rains cats and dogs  when the Monsoon comes in India.  How will you go to play Cricket today? It’s  raining cats and dogs .  When we were returning from the picnic, it was  raining cats and dogs .  I think it’s not safe to drive the car now – it’s  raining cats and dogs .  "
    }
}{
    "  off-grid , also,  off-the-grid  ": {
        "  disconnected from municipal utility systems.  solidarity.  to live entirely self-sufficiently; never needing outside  help .  hidden from the general population.  ": "  Tony built an  off-grid  bunker, complete with non-perishable food, a water purification system, and solar panels.  After graduating college, some people choose to go   off the grid   to take a break from human interaction.  It’s not illegal to live  off-grid , however, the federal government doesn’t make it easy to accomplish.  "
    },
    "  buck up  ": {
        "  to summon the courage to do something  to become encouraged or cheerful after a tragic incident  to get over something unpleasant  ": "  After losing the first place position to Martha, everyone heard Mary’s mother tell her to  buck up .  People should learn to  buck up  after encountering any major issues as this is the only way they can succeed.  Matthew was told to  buck up  and resit the exams next year.  Sometimes it can be difficult to  buck up  and continue after suffering a huge loss.  Naomi found it easy to  buck up  even after she failed out of medical school.  After the devastating fire that claimed the lives of her entire family, Alicia has managed to  buck up  and put her life back together.  "
    },
    "  faint of heart , also  faint-hearted  ": {
        "  to not be strong enough to handle a situation.  to be weak.  shortage the bravery to face something complicated or unsafe.  lack the courage to tackle a tough or dangerous situation.  ": "  This movie is not for those who are  faint of heart . You better go to bed right now.  I am not among the  faint of heart . I can bear this news just as much as anyone else.  Nobody knew that such a strong man would be  faint-hearted . It broke me to see him cry at his wife’s funeral.  Nobody can remain  faint of heart  throughout their lives. You will have to toughen up too.  Can you believe that he is so  faint of heart  that he would jump if he saw even a domestic animal at his home?  Are you  faint-hearted ? If not, then proceed, else I would caution you to not take this ride at the funfair.  You cannot still think that I am  faint of heart  after I went through the horror maze all by myself!  I saw a horror movie at night last week and fell  faint of heart .  "
    },
    "  the devil is beating his wife  also known as  sunshower  or  sun shower  ": {
        "  raining whereas the sun is shining.  when the sun is shining yet it’s raining.  when it’s raining but the sun is shining at the same time.  ": "  The sunshower is said to occur when   the devil is beating his wife   in various German-speaking countries.  Today,  the devil is beating his wife  in our city—it’s  raining cats and dogs  and the sun is also shining.  Yesterday, I witnessed a very rare occurrence known as “ the devil is beating his wife .”  People in the Southern United States usually  come across  a weird natural phenomenon called “ the devil is beating his wife .”  Everybody laughed when a kid asked her mom, “Mamma, I want to see how  the devil is beating his wife .”  "
    },
    "  riddle me  this/that ": {
        "  a  catchphrase  used to introduce a joke, observation, question, or riddle.  making a demand of a listener to note a situation about to be mentioned or a question, mostly ones that are hard to explain or solve.  posing a challenge to a person to answer a question with no apparent answer.  used to sarcastically or humorously pay emphasis to a question, undercutting the self-assuredness of another person.  a rhetorical way of questioning conventional wisdom.  pointing to hypocrisy or a contradiction or creating wry observations.  ": "  Despite acting so confidently,   riddle me this  : how will we get all that money within a day?  How will you pay for all your plans if you quit your job?  Riddle me that .   Riddle me this : why was such a talented collective so horrible in their  work ?  "
    },
    " (not)  bat an eye , also,  bat an eyelid , or  bat an eyelash  ": {
        " Meaning ": " Example in Sentences "
    },
    "  fall on deaf ears  ": {
        "  to disregard or ignore.  said in regard to an assertion, claim, or argument that a person has made.   This indicates that what was said was (or will be) disregarded or not  taken into account .   often takes the form of ‘words fell on deaf ears’, or ‘words would fall on deaf ears.’  A similar idiom, “ turn a deaf ear ,” is used to describe the  listener’s  act of disregarding or dismissing a claim.   ": "  His protestations that the project would put the firm over budget   fell on deaf ears  .  I knew that my words would  fall on deaf ears  since no one wanted to acknowledge the problem.   Although she gave an impassioned argument, her words  fell on deaf ears .  Warnings that over-speeding always causes accidents and serious injuries have largely  fallen on deaf ears .  "
    },
    " with  bated breath  ": {
        "  to wait in a nervous and excited manner  ": "  The announcer announced the last number with  bated breath  which made the audience very anxious of the result.  I waited with  bated breath  to find out if my wife and child were safe outside the operation theatre for two hours.  The couple waited with  bated breath  for the ceremonies to finally get over.  At the time of my annual results I would always be at home, waiting with  bated breath  for my parents to come back and announce it to me.  She waited with  bated breath  to unwrap her birthday presents after the guests would leave.  After my daughter’s interview I waited with  bated breath  for the results to be announced.  The audience watched the circus artists’s antics with  bated breath .  "
    },
    "  cross paths  also,  cross someone’s path  ": {
        "  encounter or meet someone by chance.  unexpectedly  come across  somebody.  The idiom is used to express a general encounter or meeting with someone, especially when it was not expected.  It is used to describe being in the same physical place with someone else by pure chance, maybe in the street, a show, a restaurant, or any other random location, especially when the meeting occurred because of two separate journeys.  ": "  I believe we will  cross paths  soon.  Today I   crossed paths with   Peter.  For your sake, I hope we do not  cross paths  again.  I am sure I will scream if a chameleon  crosses my path .  I did not know his name, so I hoped we might  cross paths  again soon.  It was lovely meeting you. I hope we  cross paths  again.  My obsession with aliens has led me to  cross paths  with some horrible truths.  They would go on to  cross paths  in the future, but they took different turns.  The sea is dangerous, which raises the chances of  crossing paths with  pirate ships.  Since that incident five years ago, he has never  crossed my path  again.  Frank  crossed paths with  Emily on a few occasions.  "
    },
    "  break a leg  ": {
        "  good luck  best wishes  stroke of luck  to wish someone luck especially before a performance  ": "  “ Break a leg !” shouted the stage director to his actors before the beginning of the play.  You have an exam tomorrow?  Break a leg !  “My first stage performance is scheduled for tonight.” “Well,  break a leg !”  “ Break a leg !” I shouted out to him before he rushed in for his auditions.  When the team went out for the final race, the coach shouted out to them “ break a leg !”  I wish you good luck on the completion of your book writing for publishing.  Break a leg !  "
    },
    "  smack dab  ": {
        "  exactly  precisely  right in place or time  squarely  ": "  We got our water balloons fully filled and threw  smack dab  at their heads. It was fun, I tell you!  I accidentally lost my balance while stepping back and my elbow landed  smack dab  on her ribs.  He was trying to hold me down, that molester. That’s when I got him off balance and punched him  smack dab  at his nose.  I want to own a farmhouse  smack dab in the middle of  woods near the city.  John accidentally elbowed me  smack dab  on my nose. The bleeding doesn’t stop, no matter what all I tried.  The parachute landed  smack dab into the middle of  the lake.   Conversation example:   "
    },
    "  cover one’s tracks  ": {
        "  to keep one’s location, activities, and intentions hidden.  to conceal previous movement indicators.  to conceal one’s involvement, usually in a dubious way.  to destroy evidence of presence.  ": "  The burglars were very meticulous in  covering their tracks , making it difficult for law enforcement to catch them.  Corrupt officials go to great lengths to  cover their tracks  so as not to tarnish their reputations.  When primitive camping, it’s a bad idea to  cover one’s tracks . If you get lost, you’ll want there to be signs of your presence.  The purpose of using a proxy or virtual private network (VPN) is to  cover one’s tracks  online in real-time.  The murderer   covered his tracks   by throwing the shotgun in the lake and burying his landlord’s body.  "
    },
    "  a bed of roses  ": {
        "  easy option  a comfortable or luxurious position  an effortless, happy situation  a luxurious circumstances  a trouble-free living  ": "  Weight loss is a challenging task, not  a bed of roses .  Making money is not  a bed of roses ; you have to wake up early and go to work.  The life of the royal family is  a bed of roses .  Before cutting ties with my family, my life was  a bed of roses  because my Mom did everything for me.  My friend told me that he wants to live in  a bed of roses  without hard work. Winning the Jackpot made his dream come true.  The corrupt leaders have made their life  a bed of roses  with the help of black money.  How can you make your life  a bed of roses  without working very hard?  I never believed miracles, but after meeting Brian Greene, a dull and old but diamond ring that he found in his garden made his life  a bed of roses .  "
    },
    "  from cradle to grave  ": {
        "  from the cradle to the grave ,   cradle-to-grave ,   from womb to tomb . ": "  The phrase is used to refer to something that spans a human lifetime.  throughout one’s  life .  the duration or length of one’s life.  It can be used more generally to mean “from start to finish.”  The adjectival form, ‘ cradle-to-grave ,’ is most frequently used in conjunction with government or corporate benefits such as Social Security or health care.  "
    },
    "  clarion call  also,  clarion’s call  ": {
        "  A clarion is a high-pitch bugle.  A strong and clear request for people to do something.  In a literal sense, the call to battle is issued by such an instrument.   Used in the figurative sense, a call to take up a task or pursue a project.  The idiom metaphorically ascribes the characteristics of a bugle to a spoken command or statement, indicating that it was issued loudly and clearly.   A statement, command, or other assertion that is unambiguous in its meaning and application.   ": "  All of the citizens heard the  clarion call  and prepared themselves to defend their city.   None of the board members could ignore the  clarion-call  of the chairman’s directive.   When I heard that my mother had decided not to go to the party, I issued a  clarion call  to my brothers and sisters; subsequently, they convinced her to attend.  The  clarion call  for additional donations from social leaders has elicited a swift reaction.  "
    },
    "  call someone’s bluff  ": {
        "  to challenge to prove one’s claim, when they are likely attempting to deceive  to challenge someone to follow through on a threat, on the assumption that the threat was idle  to demand proof for a statement, with the intention of showing that the statement in question was false  to expose somebody’s deception, invite a showdown or argument  ": " Example Sentences "
    },
    "  all the way up  ": {
        "  Literally refers to ascending a mountain or cliff, or navigating a river to a specific terminal point.  Figuratively, it refers to working through or completing the various stages of an endeavor, usually to some identified point.   It can be used to include everyone within a chain of command or hierarchy.  More recently, it has become a slang term for a drug-induced mania, state of wakefulness, or sense of invulnerability.  ": "  I made it  all the way up  the steep incline, but I didn’t have the energy to go on.   He played piano   all the way up   through his junior year of college.   Responsibility for the failure goes  all the way up  to the senior executives.   After taking cocaine, he was  all the way up  and running around like a  fool .   "
    },
    "  feather in your cap  ": {
        "  It means to have an achievement in your name.  It symbolizes honor and integrity of an achievement.  ": "  Ruth scored the last goal for her team, adding a feather in her cap.  He will have one more feather in his cap after he has finished this incredibly difficult assignment.  They can claim this feather in their cap since it was this group of soldiers who withstood the enemy in such harsh conditions.  One does not get chances to add a feather in their cap too often. So the opportunity to do so should be utilized well.  "
    },
    "  can’t (or don’t) judge a book by its cover  ": {
        "  outward appearance cannot be an indicator of someone or something’s value or worth  you cannot know what someone or something is like just by looking the person or thing’s appearance  the quality or character of  someone or something cannot be judged just by looking at them  an opinion of someone or something cannot be formed solely by seeing what’s on the surface  ": "  The candidate did not look very intelligent, but you  can’t judge a book by its cover .  The hotel looked attractive from outside, but the rooms were damp and not well maintained. You  can’t judge a book by its cover !  Do not form opinions of a persons character by looking at his appearance. You  can’t judge a book by its cover .  At first we did not want to go into the restaurant as it looked small and cramped; but the food was delicious – we realized that you  can’t judge a book by its cover .  The car was small and looked unsuited for a long trip, but packed a lot of power and was very solid. You  can’t judge a book by its cover .  That man may look very small and insignificant, but  don’t judge a book by its cover  – he’s a very powerful man in his circle.  "
    },
    "  raining cats and dogs  ": {
        "  too much heavy rain  torrential rain  very heavily raining  raining tremendously  ": "  It’s  raining cats and dogs  I am worried about how my kids will reach home.  It  rains cats and dogs  when the Monsoon comes in India.  How will you go to play Cricket today? It’s  raining cats and dogs .  When we were returning from the picnic, it was  raining cats and dogs .  I think it’s not safe to drive the car now – it’s  raining cats and dogs .  "
    }
}{
    "  child’s play  ": {
        "  an informal expression meaning something that is easy to do  a trivial matter  very easy task/work   as easy as pie    a piece of cake    a cinch   ": "  If you practise enough, driving will eventually become  child’s play .  The hike that we did this weekend was  child’s play . I am looking forward to something a bit more challenging.  Figuring out the password to his account was  child’s play .  I do not know why you are all complaining about the exam. I thought it was  child’s play .  An intricate equation like this is  child’s play  for someone with my superior intellect. I will show you how to solve it.  "
    },
    "  the devil is beating his wife  also known as  sunshower  or  sun shower  ": {
        "  raining whereas the sun is shining.  when the sun is shining yet it’s raining.  when it’s raining but the sun is shining at the same time.  ": "  The sunshower is said to occur when   the devil is beating his wife   in various German-speaking countries.  Today,  the devil is beating his wife  in our city—it’s  raining cats and dogs  and the sun is also shining.  Yesterday, I witnessed a very rare occurrence known as “ the devil is beating his wife .”  People in the Southern United States usually  come across  a weird natural phenomenon called “ the devil is beating his wife .”  Everybody laughed when a kid asked her mom, “Mamma, I want to see how  the devil is beating his wife .”  "
    },
    "  a wet blanket  ": {
        "  a person who spoils other people’s fun.  a person who always seems to sap the joy from another person or group.  someone who seems to be no fun at all is often referred to as a “ wet blanket .”   a wet blanket  often sucks the fun right out of a room or situation.  ": "  If you are going to come to my party, you can’t be such   a wet blanket  .  James has been  a wet blanket  for the last several weeks, ever since his girlfriend broke up with him.  Nobody invites Sally to parties because she is such  a wet blanket  all the time.  She was indisposed, so she decided to skip the party, not wanting to be  a wet blanket  on such a happy occasion.  "
    },
    "  between the devil and the deep blue sea  ": {
        "  between two equally difficult or unacceptable choices.  a person is stuck between two bad choices.  a person must do wrong or accept a loss no matter what they do.  ": "  I am in a pickle. Anything I do is going to cause this situation to turn out bad. I’m really stuck  between the devil and the deep blue sea .  No matter what I do, I’m going to end up losing my job. If I tell my boss, they will fire me. If I don’t say anything, they will eventually find out and I could face jail time. I’m literally stuck   between the devil and the deep blue sea  .  Look, we have to get out of these woods because the wildfire will eventually kill us all. However, we can only get to safety by going through the Devil’s Gate. We are truly stuck  between the devil and the deep blue sea .  Trying to please both his boss and his wife puts him  between the devil and the deep blue sea .  "
    },
    "  hit the hay , also,   hit the sack   ": {
        "  to go to  sleep  or head to bed.  ": "  I have to get up early, so I better  hit the hay  soon.   Before you   hit the hay  , make sure you take the garbage out to the curb.  I’m exhausted. I’m going to  hit the hay .  Although I  hit the hay  around midnight, I didn’t actually fall asleep until well after one o’clock.   "
    },
    "  break a leg  ": {
        "  good luck  best wishes  stroke of luck  to wish someone luck especially before a performance  ": "  “ Break a leg !” shouted the stage director to his actors before the beginning of the play.  You have an exam tomorrow?  Break a leg !  “My first stage performance is scheduled for tonight.” “Well,  break a leg !”  “ Break a leg !” I shouted out to him before he rushed in for his auditions.  When the team went out for the final race, the coach shouted out to them “ break a leg !”  I wish you good luck on the completion of your book writing for publishing.  Break a leg !  "
    },
    "  cross swords  ": {
        "  to  fight  with another person physically or verbally.  to get engaged in combat.  to duel  to argue violently or quarrel with another person.  to get in a dispute with another person.  to be someone’s adversary.  Mostly for the males; to urinate at the same time in a way that the urine streams have an intersection.  ": "  The vice-presidents  crossed swords  at all policy meetings.  He  crossed swords  with his boss over overspending.  They  crossed swords  on many occasions over nothing in particular.  He always looked forward to   crossing swords   with his brother.  My friend and I  crossed swords  over homework.  We had a bad time when we last  crossed swords .  I do not want to  cross swords  with Jerry over the  topic .  You are too young to  cross swords  with the teacher.  The teacher and the parent  crossed swords  over who was more powerful.  They have  crossed swords  in the past about political beliefs.  The manager has  crossed swords  with employers who don’t like her administration.  "
    },
    "  until the cows come home  ": {
        "  Meaning:  ": "  Example:  "
    },
    "  a bed of roses  ": {
        "  easy option  a comfortable or luxurious position  an effortless, happy situation  a luxurious circumstances  a trouble-free living  ": "  Weight loss is a challenging task, not  a bed of roses .  Making money is not  a bed of roses ; you have to wake up early and go to work.  The life of the royal family is  a bed of roses .  Before cutting ties with my family, my life was  a bed of roses  because my Mom did everything for me.  My friend told me that he wants to live in  a bed of roses  without hard work. Winning the Jackpot made his dream come true.  The corrupt leaders have made their life  a bed of roses  with the help of black money.  How can you make your life  a bed of roses  without working very hard?  I never believed miracles, but after meeting Brian Greene, a dull and old but diamond ring that he found in his garden made his life  a bed of roses .  "
    },
    "  easy money  ": {
        "  Rewards, progress or other good results with little or no effort.  When used in a negative sense, it refers to income that is either gained or offered in an unscrupulous or suspect manner.  It can also be used in a morally neutral sense to refer to  money  that is gained without much effort.  When it’s not about money, it’s about not having to try very hard, but getting results or rewards that are worth your time.  ": " In capitalist cultures with high  risk , high reward and freedom of employment, choosing between a high-effort or low-effort task with the same reward is important. "
    },
    "  hit the sack , also,   hit the hay   ": {
        "  to go to bed  to go to  sleep   ": "  I am really tired after all that exercise. I am going to  hit the sack .  After the long road trip, we were all dead tired and ready to   hit the hay   as soon as we reached home.  This job is really sucking the life out of me. I haven’t   hit the sack   in nearly twenty-four hours!  Before I  hit the sack , I make it a point to check whether all the doors are locked and all the lights are turned off.  He wanted to  hit the sack  and did not feel like going out to party with his friends.  They’ve already  hit the sack  as they have to catch an early morning flight tomorrow.  Even though he had  hit the hay  long back, he continued to toss and turn in his bed and couldn’t get any sleep.  After I  hit the sack , I read for some time before turning off the lights and going to  sleep .  "
    },
    "  draw a blank  ": {
        "  to get no response from someone  to not be able to say anything  to not be able to find anything  to be unresponsive  to stop or to halt entirely  be unable to get information  ": "  The bank manager will question you on why you need such a big amount as loan. You have to be confident in your answers and for heaven’s sake do not  draw a blank  at that time.  I had prepared quite a bit for the interview but  drew a blank  as soon as I sat down in from of the interviewing manager. It will be silly to expect them to call me back now.  My husband  drew a blank  when we were getting interviewed at my daughter’s school. I really hope that she gets in now.  He has massive stage fright and always  draws a blank  when he is up there.  The prime minister can give a speech totally unprepared. He never  draws a blank  on stage.  The investigation  drew a blank  after the key witness was killed in an accident.  We’ve requested hundreds of private schools to join the ‘low-cost education’ campaign, but so far we’ve  drawn a blank .  "
    },
    "  the other side of the coin  ": {
        "  the opposite aspect, contrasting arguments.  to look differently at a situation.  a person should look at a person,  circumstance , or thing from an opposing view.  there is usually more than one side to a story, situation, or matter.  can also be taken figuratively and literally.  ": "  You should consider   the other side of the coin   when a wife leaves her husband and not just blame her for walking out on him.  We know that our football team has not been performing well. On  the other side of the coin , we are improving with every game we play.  Look, I know that there are always two points of view on a legal matter. On  the other side of the coin , we should believe a person when they make an accusation against another individual in a court of  law .   The other side of the coin  is that fewer working hours will get you a lower income.  "
    },
    "  class act  ": {
        "  high-quality performance or display; additionally, the performer  one who possesses a high degree of skill, ability, or style.  high-quality performance or action.  an exemplary method of doing any given  task .  (Sarcasm) Insisting that a person is overzealously performing an action.  ": "  LeBron James has truly been a  class act  in basketball long before he entered the NBA.  Teresa received a well-deserved promotion after exhibiting   class act   knowledge of the industry.  The film drama show hailed as  a class act  failed to become a great hit.  (Sarcasm) “The new guy is a real  class act . We’ll see how long he can keep it up.”  "
    },
    "  lose touch  ": {
        "  fail to keep in contact  to be unable to communicate  lose the ability to do something as well as before  no longer able to handle something  lose the talent or skill in something  ": "  Michelle was my best friend at the university. But over the years we’ve  lost touch .  Don’t ever  lose touch  you always be my best friends.  The plane was flying above the Atlantic ocean when it  lost touch .  He was once a great player, but with age, he has  lost his touch .  She seems to have  lost her touch  managing children; they don’t listen to her anymore.  I can no longer sing like that. I’ve  lost my touch  since I had an infection years back.  Its good to see that even after all these years, the performer has not  lost his touch .  You may have the talent, but if you do not practice enough, you will  lose your touch  someday.  He used to be an outstanding orator, but he has  lost his touch  following his illness.  That was a great performance. You have not  lost your touch  at all.  The star player said he wanted to retire at the top of his game, before he  lost his touch .  "
    },
    "  get act together  ": {
        "  get organized and on schedule  organize yourself so that you do things in an effective way  become more organized and efficient  work in a better way, with clear goals and plans  be more serious, efficient, worthwhile  start organizing oneself so that one does thing in an effective way  ": "  The official was asked to  get his act together  if he wanted to keep his post.  With just two months left for his exams, he said he should be  getting his act together  if he wanted to do well.  He had been playing poorly all season, so the coach warned him that he should  get his act together  if wanted to keep his place in the team.  His work is getting poorer and is full of mistakes. If he does not  get his act together  soon, he will risk losing his job.  His new boss has given him one month to  get his act together , or he loses his job.  After months of putting it off, he finally  got his act together  and started working on the project.  You’d better  get your act together  if you want a raise this year.  "
    },
    "  can’t (or don’t) judge a book by its cover  ": {
        "  outward appearance cannot be an indicator of someone or something’s value or worth  you cannot know what someone or something is like just by looking the person or thing’s appearance  the quality or character of  someone or something cannot be judged just by looking at them  an opinion of someone or something cannot be formed solely by seeing what’s on the surface  ": "  The candidate did not look very intelligent, but you  can’t judge a book by its cover .  The hotel looked attractive from outside, but the rooms were damp and not well maintained. You  can’t judge a book by its cover !  Do not form opinions of a persons character by looking at his appearance. You  can’t judge a book by its cover .  At first we did not want to go into the restaurant as it looked small and cramped; but the food was delicious – we realized that you  can’t judge a book by its cover .  The car was small and looked unsuited for a long trip, but packed a lot of power and was very solid. You  can’t judge a book by its cover .  That man may look very small and insignificant, but  don’t judge a book by its cover  – he’s a very powerful man in his circle.  "
    },
    "  raining cats and dogs  ": {
        "  too much heavy rain  torrential rain  very heavily raining  raining tremendously  ": "  It’s  raining cats and dogs  I am worried about how my kids will reach home.  It  rains cats and dogs  when the Monsoon comes in India.  How will you go to play Cricket today? It’s  raining cats and dogs .  When we were returning from the picnic, it was  raining cats and dogs .  I think it’s not safe to drive the car now – it’s  raining cats and dogs .  "
    },
    "  lights are on and nobody is home  ": {
        "  used to describe a  stupid  person.  refers to a person who is not very bright.  a daydreamer.  a person whose mind is elsewhere  an otherwise intelligent person who is not using their brain.  someone who is not at all alert.  something that you say when you think someone is stupid.  when someone does not react because they are thinking about something else.  have a brain, but not using it.  used to tell that someone lacks cleverness or alertness.  ": "  No matter how hard I try to understand what Jim is talking about, it is apparent that his  lights are on but nobody is home .  Because her   lights are on but nobody is home  , she has no idea what the group has decided.  The team is trying to get Mark to provide his input, but he is unable to do so because his  lights are on but nobody’s home .  I tried to understand him, but the  lights are on but nobody is home .  John has no idea about this – the  lights are on but nobody’s home .  Lilly studied interior design, but the  lights are on and nobody is home .  "
    }
}{
    "  light of one’s life  ": {
        "  someone who makes one very  happy .  a soulmate to another person.  someone who brightens another’s  life .  the person one loves more than anyone else.  someone that makes one’s life worth living.  ": "  Because he was there with him through everything, he saw him as the  light of his life .  You should see the person you marry as the   light of your life  .  It was unfortunate that she was the  light of his life , but she didn’t see him the same way.  When she was the only one to stay with her that night, she realized she was the  light of her life .  It might seem strange, but I see my cat as the  light of my life .  We knew he was being dramatic when he called the girl he just met the  light of his life .  I met the  light of my life  when we were just  kids , and we’ve been at each other’s side ever since.  I spent so long searching, only to realize the   light of my life   was my best friend all along.   "
    },
    "  upside down  ": {
        "  literally refers to an object that has been reoriented so that the portion which would otherwise be considered the top is now at the bottom, i.e., it is in an inverted position.  when figuratively applied to a person or situation, it means that they are in a state of disorder or confusion.  when used in reference to a financial situation, it implies that one owes more than a property is worth.  ": "  Out of embarrassment, I turned the book  upside down  so that he would not see the title of what I was reading.  After rinsing the glasses, you should turn them   upside down   in the drying rack; this will ensure that they dry completely.  I am so overworked that everything feels completely  upside down .  Ever since the housing market crashed, I’ve been  upside down  with respect to my mortgage.  My car insurance deductible is too high for me to afford fixing the fender-bender I was in, but now the car is worth less than my loan on it. I’m entirely  upside down .  “They said the apostles turned the world  upside down . They meant by that, that they were disturbers of the peace.” ( Charles Haddon Spurgeon, Sermons: 1st Series, 1859, p. 404 ).  "
    },
    "  make common cause , also,  have common cause  ": {
        "  to enter into an agreement or shared effort, especially for expedient purposes and with a party (or parties) otherwise deemed to be enemies.  to work together in order to achieve a goal that both parties want.  team up to achieve something that is beneficial for each other.  ": "  We have set aside our disagreements and  made  common cause  .  While they individually had different agendas and conflicting aims, ultimately, all parties agreed to  make common cause  in defense of their homeland.  Environment protesters have “ made common cause ” with local people to prevent the setting up of factories and chemical plants on fertile land.  While the locally owned grocers stand in a competitive relationship with one another, they have nevertheless  made common cause  and rallied opposition to the city’s proposal to offer tax incentives to the big-box store.  I believe I  have common cause  with him and we can work together to reach an agreement.  "
    },
    "  red zone  ": {
        "  any geographical area that is thought to be dangerous or threatening, usually as a consequence of political or military activity.  a level on a gauge or other measuring device that indicates danger. For example, air tanks contain a gauge that indicates when the pressure has reached a dangerous level.  in  American  football, when a team gets the ball within twenty yards of the goal line, they are said to be in “the  red zone ,” since they have a higher likelihood of scoring.   ": "  The alley behind the schoolyard is effectively a “ red zone ,” since that is where all of the bullies hang out.  Something is wrong with my pressure washer; the gauge indicates that it is operating within the   red zone  .  Although they were able to get into the  red zone , the team failed to score a touchdown.  "
    },
    "  the devil is beating his wife  also known as  sunshower  or  sun shower  ": {
        "  raining whereas the sun is shining.  when the sun is shining yet it’s raining.  when it’s raining but the sun is shining at the same time.  ": "  The sunshower is said to occur when   the devil is beating his wife   in various German-speaking countries.  Today,  the devil is beating his wife  in our city—it’s  raining cats and dogs  and the sun is also shining.  Yesterday, I witnessed a very rare occurrence known as “ the devil is beating his wife .”  People in the Southern United States usually  come across  a weird natural phenomenon called “ the devil is beating his wife .”  Everybody laughed when a kid asked her mom, “Mamma, I want to see how  the devil is beating his wife .”  "
    },
    "  break a leg  ": {
        "  good luck  best wishes  stroke of luck  to wish someone luck especially before a performance  ": "  “ Break a leg !” shouted the stage director to his actors before the beginning of the play.  You have an exam tomorrow?  Break a leg !  “My first stage performance is scheduled for tonight.” “Well,  break a leg !”  “ Break a leg !” I shouted out to him before he rushed in for his auditions.  When the team went out for the final race, the coach shouted out to them “ break a leg !”  I wish you good luck on the completion of your book writing for publishing.  Break a leg !  "
    },
    "  chip off the old block  ": {
        "  the term is used to describe people who look like their parents.  someone who is similar to one’s parents in behavior, character, or personality.  someone who has a personality that is strikingly similar to their father or mother’s.  ": "  Like his brother, he is a   chip off the old block  , very rude in behavior and stout in physique.  Jane’s daddy is a great cook, and she is a  chip off the old block .  Stephen is a  chip off the old block . He’s a good football player, just like his father.  "
    },
    "  armed to the teeth  ": {
        "  heavily and formidably armed, usually with deadly weapons  fully prepared or equipped (with weapons, arguments and so on).  carrying many weapons  to be armed with ammunition strongly for some kind of war or battle  When you are well organized for entering into a new project, being financially strong to invest in some business  When someone is physically and mentally prepared to compete with others in any field of life  ": "  The alleged tax-defaulter was ready for all their questions, and  armed to the teeth  with proof of his innocence.  It was dangerous to chase the robbers. They were  armed to the teeth  and looked merciless.  The minister came  armed to the teeth  for his first press meet after being elected and answered all the question easily.  It’s not advisable to go there now. There is a turf war going on between two gangs and they are  armed to the teeth .  Since he had decided to argue his own case, he was  armed to the teeth  to prove his innocence in front of the court.  They are a very formidable team, having excellent players in all positions. You can say they are  armed to the teeth .  The army was  armed to the teeth  and ready to defend their positions against any form of attack.  Having once been embarrassed in front of his clients, he came  armed to the teeth  for his next presentation.  Both the rival forces were  armed to the teeth  for a do or die purpose.  For the annual debate competition, I am  armed to the teeth  and quite confident that I will win.  To invest in the luxurious housing scheme of the city, one should be  armed to the teeth .  To become a commercial pilot one should be  armed to the teeth  as it requires a lot of investment.  Both the wrestlers were  armed to the teeth  to win the royal rumble against each other.  "
    },
    "  a bed of roses  ": {
        "  easy option  a comfortable or luxurious position  an effortless, happy situation  a luxurious circumstances  a trouble-free living  ": "  Weight loss is a challenging task, not  a bed of roses .  Making money is not  a bed of roses ; you have to wake up early and go to work.  The life of the royal family is  a bed of roses .  Before cutting ties with my family, my life was  a bed of roses  because my Mom did everything for me.  My friend told me that he wants to live in  a bed of roses  without hard work. Winning the Jackpot made his dream come true.  The corrupt leaders have made their life  a bed of roses  with the help of black money.  How can you make your life  a bed of roses  without working very hard?  I never believed miracles, but after meeting Brian Greene, a dull and old but diamond ring that he found in his garden made his life  a bed of roses .  "
    },
    "  on the blink , also,  on the fritz  ": {
        "  to be malfunctioning or not operating correctly.  typically, applied to a machine with complex parts.    when applied to a person, it implies they are in a state of agitation or confusion.  ": "  The computer is  on the blink  again; I really need to check whether there’s a virus causing problems.  My car was   on the blink  , so I wasn’t able to get to work on time.  If your dishwasher is  on the blink , you will need to contact a service technician.  "
    },
    " to have a  bun in the oven  ": {
        "  to be pregnant  to be expecting a baby  ": "  After trying for a baby for several years, Mark was happy when his wife told him she had a  bun in the oven .  Throwing a baby shower is one of the best ways to announce that you have a  bun in the oven .  She was happy to announce to her parents that they would soon be grandparents as she had a  bun in the oven .  After running numerous tests, the doctor was happy to tell Mary that she wasn’t sick but that she had a  bun in the oven .  After experiencing some bouts of morning sickness, Kate began to suspect that she might have a  bun in the oven .  "
    },
    "  cross the line  or,  cross a line  ": {
        "  behave in a way that is not acceptable  overstep a boundary, standard, limit, or rule  go over the threshold of what is appropriate  be offensive or anti-social  ": "  This newspaper has  crossed the line . This article is so offensive to so many people.  Connie’s boyfriend has upset her badly. He really  crossed the line  this time.  There’s no need to talk about my mother like that. You’re  crossing the line  now.  The film was so rude, and we left about halfway through. It  crossed the line  several times over.  Those guys know how to  cross the line . I never want to go to one of their concerts again.  The comedian really  crossed the line . His idea of humour is appalling.  The protesters who are  crossing the line  must be stopped.  The politician’s language and rhetoric  crossed the line,  and it was reckless.  "
    },
    "  fan the flames  ": {
        "  make a bad situation even worse  say or do something to make someone angrier or more incensed than they already are  stir up, create or inflame strong feelings (anger, hate, love)  exacerbate or aggravate an explosive reaction  cause or incite strong emotions (usually negative but not always)  ": "  The president’s racist comments are really going to  fan the flames  of hatred among the crowd.  She had fancied Karl for ages, and when he smiled at her, he  fanned the flames  even more.  The fat cats at the bank get a massive yearly bonus, and it  fans the flames  of anger amongst the customers who lost money in the crash.  He said this  fanned the flames  of separatism into a raging fire.  The pandemic has  fanned the flames  of hate among communities.  Coronavirus outbreak  fans the flames  of the US-China decoupling debate in Washington.  I believe the political leader is  fanning the flames  of racial unrest.  All these moves are  fanning the flames  of popular anger, and it will burst out in a disaster.  Certain politicians are  fanning the flames  of the mobs to change the government.  He will continue to  fan the flames  of divisiveness with fear and anxiety.  It is irresponsible to  fan the flames  of the institutional crisis at a time when the country needs stability.  "
    },
    "  hand in hand  ": {
        "  close ties or connections  in a literal sense, refers to two people holding hands, especially as a sign of  love .  roughly equivalent in meaning to “walk along with.”  in a figurative sense, it is used to indicate that two things accompany, complement, or are concurrent with one another.  ": "  I saw a couple walking  hand in hand  along the beach.   Developing critical thinking skills goes   hand in hand   with becoming a good writer.   I can’t imagine going to see a movie without eating popcorn; they  go hand in hand .  The burger and bun  go hand in hand .  Good sleep and happiness always  go hand in hand .  Kelly walked  hand in hand  with her father on the beach.  "
    },
    "  busy as a beaver  also,  work like a beaver  ": {
        "  work very hard and actively.  to be intensely engaged in methodical and diligent work.  a simile derived from the fact that beavers spend a significant amount of time felling trees and building their dams.  the phrase can be contrasted with the related idiom, “ busy as a bee ,” which implies quick or rapid work. However, in practice, both have come to simply mean actively working.  ": "  I often find my husband in the garage,  busy as a beaver , working on some new project.  I have been   busy as a beaver  , working to complete my thesis prior to graduation.  Although they are clearly enjoying themselves, the children are  as busy as beavers , constructing their pretend fort.  Ahead of Christmas, she  worked like a beaver  to clean out all the closets.  My dad has to  work like a beaver  to buy a new house.  "
    },
    "  roots run deep  also,  roots that run deep  ": {
        "  similar in meaning to “ deep-rooted .”  used to indicate that an attribute (of a person, institution, or other entity) has a rich and complex origin, which makes it stable and unlikely to change.  can be used to indicate the profound historical,  social , or cultural influence on a person.  relatedly, it can be used to indicate that a quality or feature that seems to have been eliminated will likely reappear. (Analogous to how a weed will grow back unless it is removed by the root.)  in genealogical and familial contexts, it is often used to indicate that an interest, concern, or  quality  has been shared or developed over many generations.  ": "  His  family  has long been supported the monarchy; their royalist  roots run deep .  I thought I had successfully overcome my social anxiety, but its   roots run deep  , and I’ve found that it is, once again, becoming disruptive.  The  roots  of racial prejudice  run deep  and often spring up in new and different ways.  Many of the well-known rock musicians in the late twentieth century had gospel   roots which ran deep  .  “The Church can never be overthrown. Its  roots run deep  into the nature of man, its rocky summits rise in indestructible strength, supported by the everlasting needs of the human soul.” ( The Christian Examiner , July 1844, Article VI: Fourierism.)  "
    },
    "  can’t (or don’t) judge a book by its cover  ": {
        "  outward appearance cannot be an indicator of someone or something’s value or worth  you cannot know what someone or something is like just by looking the person or thing’s appearance  the quality or character of  someone or something cannot be judged just by looking at them  an opinion of someone or something cannot be formed solely by seeing what’s on the surface  ": "  The candidate did not look very intelligent, but you  can’t judge a book by its cover .  The hotel looked attractive from outside, but the rooms were damp and not well maintained. You  can’t judge a book by its cover !  Do not form opinions of a persons character by looking at his appearance. You  can’t judge a book by its cover .  At first we did not want to go into the restaurant as it looked small and cramped; but the food was delicious – we realized that you  can’t judge a book by its cover .  The car was small and looked unsuited for a long trip, but packed a lot of power and was very solid. You  can’t judge a book by its cover .  That man may look very small and insignificant, but  don’t judge a book by its cover  – he’s a very powerful man in his circle.  "
    },
    "  twenty-three skidoo  ": {
        "  to depart in a haste  to leave quickly or being forced to leave quickly  to get out while things are still good  ": "  The police threatened to imprison everyone in the crowd that did not  23 skidoo  from the park.  After hitting the motorcycle, the car driver stopped and he  twenty-three skidoo  toward the woods.  Hey, Sally, it’s too hot today, let’s  twenty-three skidoo  for the beach.  Man, I came here to watch these beautiful mountains, don’t  twenty three skidoo  so soon.  The kids were plucking flowers from my garden when I shout at them, they just  23 skidoo .  "
    },
    "  red book  ": {
        "  any document or publication, which is bound in red and serves as an official collection of rules, regulations, laws, or legal principles.  analogically, an authoritative or canonical volume, regardless of its binding.  alternatively, a  book  considered to be devilish or demonic in nature.  ": "  I will need to consult the   red book   to determine whether there is an exception to the rule.  The  Red Book , which presented the Government’s taxation plan, was presented to Parliament.  “The  Red Book  of the Irish Exchequer is said to afford some curious matters for selection” (Charles Purton Cooper, An Account of the Most Important Public Records of Great Britain, Volume 2, 1832).  “Reportedly, everyone carried a copy of the little  red book  at all times as a sign of loyalty to Mao” (Donald P. Whitaker and Rinn-Sup Shinn, et al.,  Area Handbook for the People’s Republic of China , Volume 550, Issue 60-62, p. 362).  "
    },
    "  raining cats and dogs  ": {
        "  too much heavy rain  torrential rain  very heavily raining  raining tremendously  ": "  It’s  raining cats and dogs  I am worried about how my kids will reach home.  It  rains cats and dogs  when the Monsoon comes in India.  How will you go to play Cricket today? It’s  raining cats and dogs .  When we were returning from the picnic, it was  raining cats and dogs .  I think it’s not safe to drive the car now – it’s  raining cats and dogs .  "
    }
}{
    "  bad blood , or,  ill blood  ": {
        "  to have ill  feelings  towards someone  to feel bitterness towards someone  the feeling of hostility or ill will  a serious feud or long-standing grudge  the hatred between two or more people  a feeling of resentment towards people  feeling of hate between people because of any arguments in the past.  ": "  The villagers say the arson attack may have been the result of   bad blood between   the two families.  They have so much  bad blood  towards each other that it worries me a lot.  Ever since their divorce, there has been a lot of  bad blood between  the two families.  Please, don’t stir up any   ill blood  .  There was  bad blood between  the two families in Romeo and Juliet.  There was  bad blood between  the two ethnic groups.  The  bad blood within  their family makes it hard for their kids to communicate with themselves.  Oh! So they don’t talk to each other because they have  ill blood ?  "
    },
    "  break a leg  ": {
        "  good luck  best wishes  stroke of luck  to wish someone luck especially before a performance  ": "  “ Break a leg !” shouted the stage director to his actors before the beginning of the play.  You have an exam tomorrow?  Break a leg !  “My first stage performance is scheduled for tonight.” “Well,  break a leg !”  “ Break a leg !” I shouted out to him before he rushed in for his auditions.  When the team went out for the final race, the coach shouted out to them “ break a leg !”  I wish you good luck on the completion of your book writing for publishing.  Break a leg !  "
    },
    "  bury one’s head in the sand  ": {
        "  hide from the truth  intentional naivety   to play dumb  to avoid  circumstances   avert shame  to act  stupid   refuse to think about an unpleasant situation, hoping that it will improve so that you will not have to deal with it.  ": "  Finals begin in a week and if I continue to  bury my head in the sand , I’ll be taking this class again next semester.  The couple knew that their relationship was deteriorating, but with their   heads buried in the sand  , they kept dragging it along.  A popular cheerleader at school let out a huge burp today during an assembly. She’ll probably  bury her head in the sand  for the rest of the year.  When our supervisor gathered us all and asked who the last person was to scan the incoming shipment, Brad had his  head buried in the sand  because he knew that meant he had done something wrong.  Parents and the principal claimed that ragging was being ignored and accused the warden of  burying her head in the sand .  During a financial crisis, it can be tempting to  bury your head in the sand  and avoid dealing with the problem entirely.  Brad resolved to get to the bottom of the matter rather than  bury his head in the sand .  He’s a problem solver in most situations, but in your case, he wanted to  bury his head in the sand .  "
    },
    "  break new ground , also,  break fresh ground  ": {
        "  to do something innovative  pioneer  discover  invent  make progress   ": "  Advancements in computer technology   break new ground   almost every day.   George Washington Carver would ironically  break new ground  by pioneering the practice of crop rotation.   Just by waking up today and being present, you are actively  breaking new ground .   Albert Einstein’s Relativity, paired with Sir Isaac Newton’s Principia,  broke new ground , paving the way for physics as we know it today.  It is an interesting discovery in the energy conservation field in the United States that definitely  breaks new ground  in the country’s energy program.  The key to a successful business is to let go of the old ways and  break fresh ground .  "
    },
    "  can’t (or don’t) judge a book by its cover  ": {
        "  outward appearance cannot be an indicator of someone or something’s value or worth  you cannot know what someone or something is like just by looking the person or thing’s appearance  the quality or character of  someone or something cannot be judged just by looking at them  an opinion of someone or something cannot be formed solely by seeing what’s on the surface  ": "  The candidate did not look very intelligent, but you  can’t judge a book by its cover .  The hotel looked attractive from outside, but the rooms were damp and not well maintained. You  can’t judge a book by its cover !  Do not form opinions of a persons character by looking at his appearance. You  can’t judge a book by its cover .  At first we did not want to go into the restaurant as it looked small and cramped; but the food was delicious – we realized that you  can’t judge a book by its cover .  The car was small and looked unsuited for a long trip, but packed a lot of power and was very solid. You  can’t judge a book by its cover .  That man may look very small and insignificant, but  don’t judge a book by its cover  – he’s a very powerful man in his circle.  "
    },
    "  get to the bottom  ": {
        "  to find out the truth relating to a situation  to uncover what exactly happened  to reveal facts through investigation  ": "  The murderer will not get away with it, the news anchor said. She assured the audiences that the police will  get to the bottom  of it all.  To  get to the bottom  of this, I will need to stay awake and guard the kitchen. That is perhaps the best way to find out myself of where all the cupcakes are going.  It is wonderful that you are travelling so far to  get to the bottom  of your family history. Very few people have such zeal to know about their roots.  I need to  get to the bottom  of this mystery or I will not be able to close the book and sleep.  It is doubtful if political interference will allow the investigators to  get to the bottom  of the case.  "
    },
    " a  wide berth  ": {
        "  avoid (a person, place, or  circumstance )  stay away from  keep away from somebody  sizeable allotment  mitigate collision  ": "  When walking through the yard, make sure you leave a  wide berth  for the dog, or he may bite you.  Go ahead and back your truck into this spot; there’s a  wide berth  available.  After throwing the toy at his little sister, Joey gave her a   wide berth   for the remainder of the evening to avoid retaliation.  Keep a  wide berth  between any liquids and electronics; you never want them to come into contact.  As introverted of a person as Jude is, he always makes sure to give a  wide berth  to those he walks past.  He has fallen out with her adviser and has been giving her a  wide berth  for a couple of months.  "
    },
    "  take a leaf out of someone’s book  ": {
        "  implement actionable advice  follow an example set by another person  imitate another person  emulate  copy  ": "  I couldn’t decide what to do after high school, but my dad makes great money welding, so I   took a leaf out of his book   and went to trade school instead of college.  Some polymers were made by studying and  taking a leaf from the books  of many species of ants.  If you listen closely, it’s easy to realize that modern vocalists  took leaves from the books  of classic singers such as Frank Sinatra.  You need to  take a leaf out of your boss’s book  and be punctual about coming to the office on time.  "
    },
    "  living on borrowed time  ": {
        "  not expected to live much longer.  to  live  after a point where it can be reasonably expected that you may have died.  to remain in a situation that no one really expected you to.   ": "  He was told he only had three months left to live, so he is   living on borrowed time   now that it is four months later.  His boss has not been happy with his performance for months. He is really  living on borrowed time  after this latest incident.  The big Hollywood star is suffering from a serious illness and is now  living on borrowed time .  "
    },
    "  hit the panic button  ": {
        "  press  the panic button,  push  the panic button,  smash  the panic button, ": "  prepare for disaster  react poorly to a  circumstance   the result of being caught off-guard  to implement a haphazard plan  chaotically react  do something quickly without thinking about it in order to deal with a bad, difficult, or worrying situation.  "
    },
    "  blind date  ": {
        "  to go on a date with someone you have never met before.  a kind of date between people with no previous encounters, often arranged by a mutual  friend .  to meet in a public place with someone that you have not been aquatinted with.  a social meeting with someone you’re not familiar with.  an arranged meeting for two people who have never met each other before, in order to try to start a romantic  relationship .  ": "  I’m going on a  blind date  with a guy that Jack knows from college.  Can you believe that Lily and I were set up on a   blind date   by her mom?  I could set you on a  blind date  with a girl from work; you’d absolutely  love  her.  I went on a  blind date  with my cousin’s roommate, Rebecca.  A  blind date  might be just what you need to get back into the dating circle.  It’s not an entirely terrible idea. You know, I met your mom on a  blind date , and we’ve been together ever since.  She agreed to go on a  blind date  with her friend’s former boyfriend.  "
    },
    "  body and soul  ": {
        "  with all one’s effort and ability  completely  with all of  every effort  all aspects  commitment  ": "  A great painter must put their   body and soul   onto the canvas.  When two people become married, they are giving their  body and soul  to one another.   With her  body and soul  into her career, she quickly rose to the top.  He dedicated himself to science studies and astronomy,  body and soul .  "
    },
    "  at stake  ": {
        "  It means to be on wager or bet, when there is some sort of uncertainty.  It is usually referred to money but in the current times the important aspects can all be at stake. For example a person’s reputation, assets and even relationships.  ": "  You needn’t have all your money   at stake   in the share market, it is better to diversify.  She has to manage getting the contract this time since her job is   at stake   if she fails.  "
    },
    "  raining cats and dogs  ": {
        "  too much heavy rain  torrential rain  very heavily raining  raining tremendously  ": "  It’s  raining cats and dogs  I am worried about how my kids will reach home.  It  rains cats and dogs  when the Monsoon comes in India.  How will you go to play Cricket today? It’s  raining cats and dogs .  When we were returning from the picnic, it was  raining cats and dogs .  I think it’s not safe to drive the car now – it’s  raining cats and dogs .  "
    },
    "  the upper crust  ": {
        "  the aristocracy and upper classes, informal  the highest social class or group; especially the highest circle of the upper class.  ": "  Reservation system was developed to help the needy. Now it has become privilege for the society therefore even the upper crust are demanding reservation these days.  Many leaders brought reform in the country by giving equal rights to all citizens else it would have been a place of rule by the upper crust.  Many people who belong to the upper crust consider themselves special. Perhaps they’ve forgotten each being is equal in God’s eyes despite of their status on society.  Not everyone from the upper crust looks towards others as low. Many people have broken the stereotype by uplifting the poor &amp; working for their well-being.  Though many countries are democratic which means equal rights for all yet it has been seen that the upper crust get added privilege in one way or the other.  No matter you are from upper crust, you still have to work your way out to earn a life of your own, else you’ll just be recognised by the name of your family.  "
    },
    "  zonk out  ": {
        "  to fall asleep very promptly  to fall asleep, mostly because of physical tiredness or the influences of drugs or alcohol  to lose consciousness from exhaustion, or intoxication, etc.  ": "    knock out    "
    },
    "  hang up  ": {
        "  to disconnect a phone call. It is often used when someone does not want to continue a conversation  something that prohibits someone from making progress in a situation. It is hyphenated and used as a noun  to give up on someone or something  to be obsessed with someone or something, this is used very informally  to stop doing something  hang from a hook  ": "  If you do not stop complaining then I will  hang up  on you.  Don’t you dare  hang up  until I have had a chance to ask my question!  Jane has a lot of  hang-ups  about being an overweight child.  Peter has  hung-ups  about not being as educated as some of his peers.  We had to  hang up  on them as they were just not able to do the job that we needed.  She is still  hung up  on her ex-boyfriend.  After ten years as a professional ballerina she will finally  hang up  her dancing shoes.  "
    },
    "  the devil is beating his wife  also known as  sunshower  or  sun shower  ": {
        "  raining whereas the sun is shining.  when the sun is shining yet it’s raining.  when it’s raining but the sun is shining at the same time.  ": "  The sunshower is said to occur when   the devil is beating his wife   in various German-speaking countries.  Today,  the devil is beating his wife  in our city—it’s  raining cats and dogs  and the sun is also shining.  Yesterday, I witnessed a very rare occurrence known as “ the devil is beating his wife .”  People in the Southern United States usually  come across  a weird natural phenomenon called “ the devil is beating his wife .”  Everybody laughed when a kid asked her mom, “Mamma, I want to see how  the devil is beating his wife .”  "
    },
    "  a bed of roses  ": {
        "  easy option  a comfortable or luxurious position  an effortless, happy situation  a luxurious circumstances  a trouble-free living  ": "  Weight loss is a challenging task, not  a bed of roses .  Making money is not  a bed of roses ; you have to wake up early and go to work.  The life of the royal family is  a bed of roses .  Before cutting ties with my family, my life was  a bed of roses  because my Mom did everything for me.  My friend told me that he wants to live in  a bed of roses  without hard work. Winning the Jackpot made his dream come true.  The corrupt leaders have made their life  a bed of roses  with the help of black money.  How can you make your life  a bed of roses  without working very hard?  I never believed miracles, but after meeting Brian Greene, a dull and old but diamond ring that he found in his garden made his life  a bed of roses .  "
    },
    "  bring someone to book  ": {
        "  make somebody accountable for their conduct.  to punish someone.  legally punish or summon someone to account for their actions.  ": " Example Sentences "
    }
}{
    "  can’t (or don’t) judge a book by its cover  ": {
        "  outward appearance cannot be an indicator of someone or something’s value or worth  you cannot know what someone or something is like just by looking the person or thing’s appearance  the quality or character of  someone or something cannot be judged just by looking at them  an opinion of someone or something cannot be formed solely by seeing what’s on the surface  ": "  The candidate did not look very intelligent, but you  can’t judge a book by its cover .  The hotel looked attractive from outside, but the rooms were damp and not well maintained. You  can’t judge a book by its cover !  Do not form opinions of a persons character by looking at his appearance. You  can’t judge a book by its cover .  At first we did not want to go into the restaurant as it looked small and cramped; but the food was delicious – we realized that you  can’t judge a book by its cover .  The car was small and looked unsuited for a long trip, but packed a lot of power and was very solid. You  can’t judge a book by its cover .  That man may look very small and insignificant, but  don’t judge a book by its cover  – he’s a very powerful man in his circle.  "
    },
    "  zonk out  ": {
        "  to fall asleep very promptly  to fall asleep, mostly because of physical tiredness or the influences of drugs or alcohol  to lose consciousness from exhaustion, or intoxication, etc.  ": "    knock out    "
    },
    "  hit the panic button  ": {
        "  press  the panic button,  push  the panic button,  smash  the panic button, ": "  prepare for disaster  react poorly to a  circumstance   the result of being caught off-guard  to implement a haphazard plan  chaotically react  do something quickly without thinking about it in order to deal with a bad, difficult, or worrying situation.  "
    },
    "  bury one’s head in the sand  ": {
        "  hide from the truth  intentional naivety   to play dumb  to avoid  circumstances   avert shame  to act  stupid   refuse to think about an unpleasant situation, hoping that it will improve so that you will not have to deal with it.  ": "  Finals begin in a week and if I continue to  bury my head in the sand , I’ll be taking this class again next semester.  The couple knew that their relationship was deteriorating, but with their   heads buried in the sand  , they kept dragging it along.  A popular cheerleader at school let out a huge burp today during an assembly. She’ll probably  bury her head in the sand  for the rest of the year.  When our supervisor gathered us all and asked who the last person was to scan the incoming shipment, Brad had his  head buried in the sand  because he knew that meant he had done something wrong.  Parents and the principal claimed that ragging was being ignored and accused the warden of  burying her head in the sand .  During a financial crisis, it can be tempting to  bury your head in the sand  and avoid dealing with the problem entirely.  Brad resolved to get to the bottom of the matter rather than  bury his head in the sand .  He’s a problem solver in most situations, but in your case, he wanted to  bury his head in the sand .  "
    },
    "  hang up  ": {
        "  to disconnect a phone call. It is often used when someone does not want to continue a conversation  something that prohibits someone from making progress in a situation. It is hyphenated and used as a noun  to give up on someone or something  to be obsessed with someone or something, this is used very informally  to stop doing something  hang from a hook  ": "  If you do not stop complaining then I will  hang up  on you.  Don’t you dare  hang up  until I have had a chance to ask my question!  Jane has a lot of  hang-ups  about being an overweight child.  Peter has  hung-ups  about not being as educated as some of his peers.  We had to  hang up  on them as they were just not able to do the job that we needed.  She is still  hung up  on her ex-boyfriend.  After ten years as a professional ballerina she will finally  hang up  her dancing shoes.  "
    },
    "  a bed of roses  ": {
        "  easy option  a comfortable or luxurious position  an effortless, happy situation  a luxurious circumstances  a trouble-free living  ": "  Weight loss is a challenging task, not  a bed of roses .  Making money is not  a bed of roses ; you have to wake up early and go to work.  The life of the royal family is  a bed of roses .  Before cutting ties with my family, my life was  a bed of roses  because my Mom did everything for me.  My friend told me that he wants to live in  a bed of roses  without hard work. Winning the Jackpot made his dream come true.  The corrupt leaders have made their life  a bed of roses  with the help of black money.  How can you make your life  a bed of roses  without working very hard?  I never believed miracles, but after meeting Brian Greene, a dull and old but diamond ring that he found in his garden made his life  a bed of roses .  "
    },
    "  take a leaf out of someone’s book  ": {
        "  implement actionable advice  follow an example set by another person  imitate another person  emulate  copy  ": "  I couldn’t decide what to do after high school, but my dad makes great money welding, so I   took a leaf out of his book   and went to trade school instead of college.  Some polymers were made by studying and  taking a leaf from the books  of many species of ants.  If you listen closely, it’s easy to realize that modern vocalists  took leaves from the books  of classic singers such as Frank Sinatra.  You need to  take a leaf out of your boss’s book  and be punctual about coming to the office on time.  "
    },
    "  break a leg  ": {
        "  good luck  best wishes  stroke of luck  to wish someone luck especially before a performance  ": "  “ Break a leg !” shouted the stage director to his actors before the beginning of the play.  You have an exam tomorrow?  Break a leg !  “My first stage performance is scheduled for tonight.” “Well,  break a leg !”  “ Break a leg !” I shouted out to him before he rushed in for his auditions.  When the team went out for the final race, the coach shouted out to them “ break a leg !”  I wish you good luck on the completion of your book writing for publishing.  Break a leg !  "
    },
    "  body and soul  ": {
        "  with all one’s effort and ability  completely  with all of  every effort  all aspects  commitment  ": "  A great painter must put their   body and soul   onto the canvas.  When two people become married, they are giving their  body and soul  to one another.   With her  body and soul  into her career, she quickly rose to the top.  He dedicated himself to science studies and astronomy,  body and soul .  "
    },
    "  bring someone to book  ": {
        "  make somebody accountable for their conduct.  to punish someone.  legally punish or summon someone to account for their actions.  ": " Example Sentences "
    },
    "  break new ground , also,  break fresh ground  ": {
        "  to do something innovative  pioneer  discover  invent  make progress   ": "  Advancements in computer technology   break new ground   almost every day.   George Washington Carver would ironically  break new ground  by pioneering the practice of crop rotation.   Just by waking up today and being present, you are actively  breaking new ground .   Albert Einstein’s Relativity, paired with Sir Isaac Newton’s Principia,  broke new ground , paving the way for physics as we know it today.  It is an interesting discovery in the energy conservation field in the United States that definitely  breaks new ground  in the country’s energy program.  The key to a successful business is to let go of the old ways and  break fresh ground .  "
    },
    "  the upper crust  ": {
        "  the aristocracy and upper classes, informal  the highest social class or group; especially the highest circle of the upper class.  ": "  Reservation system was developed to help the needy. Now it has become privilege for the society therefore even the upper crust are demanding reservation these days.  Many leaders brought reform in the country by giving equal rights to all citizens else it would have been a place of rule by the upper crust.  Many people who belong to the upper crust consider themselves special. Perhaps they’ve forgotten each being is equal in God’s eyes despite of their status on society.  Not everyone from the upper crust looks towards others as low. Many people have broken the stereotype by uplifting the poor &amp; working for their well-being.  Though many countries are democratic which means equal rights for all yet it has been seen that the upper crust get added privilege in one way or the other.  No matter you are from upper crust, you still have to work your way out to earn a life of your own, else you’ll just be recognised by the name of your family.  "
    },
    "  get to the bottom  ": {
        "  to find out the truth relating to a situation  to uncover what exactly happened  to reveal facts through investigation  ": "  The murderer will not get away with it, the news anchor said. She assured the audiences that the police will  get to the bottom  of it all.  To  get to the bottom  of this, I will need to stay awake and guard the kitchen. That is perhaps the best way to find out myself of where all the cupcakes are going.  It is wonderful that you are travelling so far to  get to the bottom  of your family history. Very few people have such zeal to know about their roots.  I need to  get to the bottom  of this mystery or I will not be able to close the book and sleep.  It is doubtful if political interference will allow the investigators to  get to the bottom  of the case.  "
    },
    "  the devil is beating his wife  also known as  sunshower  or  sun shower  ": {
        "  raining whereas the sun is shining.  when the sun is shining yet it’s raining.  when it’s raining but the sun is shining at the same time.  ": "  The sunshower is said to occur when   the devil is beating his wife   in various German-speaking countries.  Today,  the devil is beating his wife  in our city—it’s  raining cats and dogs  and the sun is also shining.  Yesterday, I witnessed a very rare occurrence known as “ the devil is beating his wife .”  People in the Southern United States usually  come across  a weird natural phenomenon called “ the devil is beating his wife .”  Everybody laughed when a kid asked her mom, “Mamma, I want to see how  the devil is beating his wife .”  "
    },
    "  bad blood , or,  ill blood  ": {
        "  to have ill  feelings  towards someone  to feel bitterness towards someone  the feeling of hostility or ill will  a serious feud or long-standing grudge  the hatred between two or more people  a feeling of resentment towards people  feeling of hate between people because of any arguments in the past.  ": "  The villagers say the arson attack may have been the result of   bad blood between   the two families.  They have so much  bad blood  towards each other that it worries me a lot.  Ever since their divorce, there has been a lot of  bad blood between  the two families.  Please, don’t stir up any   ill blood  .  There was  bad blood between  the two families in Romeo and Juliet.  There was  bad blood between  the two ethnic groups.  The  bad blood within  their family makes it hard for their kids to communicate with themselves.  Oh! So they don’t talk to each other because they have  ill blood ?  "
    },
    "  at stake  ": {
        "  It means to be on wager or bet, when there is some sort of uncertainty.  It is usually referred to money but in the current times the important aspects can all be at stake. For example a person’s reputation, assets and even relationships.  ": "  You needn’t have all your money   at stake   in the share market, it is better to diversify.  She has to manage getting the contract this time since her job is   at stake   if she fails.  "
    },
    " a  wide berth  ": {
        "  avoid (a person, place, or  circumstance )  stay away from  keep away from somebody  sizeable allotment  mitigate collision  ": "  When walking through the yard, make sure you leave a  wide berth  for the dog, or he may bite you.  Go ahead and back your truck into this spot; there’s a  wide berth  available.  After throwing the toy at his little sister, Joey gave her a   wide berth   for the remainder of the evening to avoid retaliation.  Keep a  wide berth  between any liquids and electronics; you never want them to come into contact.  As introverted of a person as Jude is, he always makes sure to give a  wide berth  to those he walks past.  He has fallen out with her adviser and has been giving her a  wide berth  for a couple of months.  "
    },
    "  blind date  ": {
        "  to go on a date with someone you have never met before.  a kind of date between people with no previous encounters, often arranged by a mutual  friend .  to meet in a public place with someone that you have not been aquatinted with.  a social meeting with someone you’re not familiar with.  an arranged meeting for two people who have never met each other before, in order to try to start a romantic  relationship .  ": "  I’m going on a  blind date  with a guy that Jack knows from college.  Can you believe that Lily and I were set up on a   blind date   by her mom?  I could set you on a  blind date  with a girl from work; you’d absolutely  love  her.  I went on a  blind date  with my cousin’s roommate, Rebecca.  A  blind date  might be just what you need to get back into the dating circle.  It’s not an entirely terrible idea. You know, I met your mom on a  blind date , and we’ve been together ever since.  She agreed to go on a  blind date  with her friend’s former boyfriend.  "
    },
    "  living on borrowed time  ": {
        "  not expected to live much longer.  to  live  after a point where it can be reasonably expected that you may have died.  to remain in a situation that no one really expected you to.   ": "  He was told he only had three months left to live, so he is   living on borrowed time   now that it is four months later.  His boss has not been happy with his performance for months. He is really  living on borrowed time  after this latest incident.  The big Hollywood star is suffering from a serious illness and is now  living on borrowed time .  "
    },
    "  raining cats and dogs  ": {
        "  too much heavy rain  torrential rain  very heavily raining  raining tremendously  ": "  It’s  raining cats and dogs  I am worried about how my kids will reach home.  It  rains cats and dogs  when the Monsoon comes in India.  How will you go to play Cricket today? It’s  raining cats and dogs .  When we were returning from the picnic, it was  raining cats and dogs .  I think it’s not safe to drive the car now – it’s  raining cats and dogs .  "
    }
}