{
    "a hard nut to crack": {
        "idiom_name": "a hard nut to crack  also,  a tough nut to crack",
        "idiom_meaning": "a problem that is difficult to solve\n a person that is difficult to deal with\n someone or something that is difficult to understand\n a person hard to get to know or to get close to",
        "idiom_examples": "She’s such a tough nut to crack . Nobody seems to be able to get through to her.\n The game on Saturday is against the current champions, so it will be a hard nut to crack .\n The new boss is really hard to figure out. He’s going to be a tough nut to crack .\n Good luck trying to get the new guidelines past the head teacher. He’s a hard nut to crack .\n Alison has been dating Stan for two years and she still feels like she doesn’t know him at times. He must be a tough nut to crack .\n My father loves doing the crossword every day. Sometimes he gets a clue that is a hard nut to crack .\n Mathematics turned out to be a hard nut to crack for students in the examination.\n The mysterious murder case seems a hard nut to crack for police as the officials are still groping in the dark.\n The first four tasks were the toughest nut to crack .\n Jazz is always a tough nut to crack , whether you are playing, recording or even listening."
    },
    "tongue in cheek": {
        "idiom_name": "tongue in cheek",
        "idiom_meaning": "something said in humour, but with an act of being serious\n say something in an ironic way\n say something jokingly, but appearing to be serious\n jocular or humourous\n not to be taken seriously",
        "idiom_examples": "The latest movie I watched was a tongue in cheek look at the way the media tends to over-hype certain pieces of news.\n One of the speakers at the business conference gave a tongue in cheek speech about the current economic condition of the country.\n His comments were intended to be tongue in cheek , but his friends took it seriously and that started a huge argument.\n He offered a tongue in cheek explanation on why his favourite team was losing repeatedly, saying something about keeping the tournament interesting till the last stages."
    },
    "mark my words": {
        "idiom_name": "mark my words",
        "idiom_meaning": "used to let someone know to pay attention to what you are saying because it is very important especially when you are certain something would happen in future\n assure someone about something that you saying is certainly going to happen",
        "idiom_examples": "Mark my words , she won’t regret taking me up on my offer.\n I had no idea about the conversation concerning their agreement but mark my words ; it shall all come to light soon.\n I was just leaving her office when she told me to mark her words , that I would be relieved of my job tomorrow.\n Mark my words , one day your son James will become a great businessman.\n Remember if you do not stop abusing then, mark my words , one day everybody will leave you.\n Don’t take her with. You mark my words , she will cause only problems."
    },
    "pros and cons": {
        "idiom_name": "pros and cons",
        "idiom_meaning": "good points and bad points\n advantages and disadvantages\n the favourable and unfavourable factors or reasons\n arguments for and against something",
        "idiom_examples": "Example Sentences"
    },
    "catch a cold": {
        "idiom_name": "catch a cold    Meaning : suffer a financial loss.   Example : Like my elder brother Brian Reddik tried the offshore business of education, but he  catches a cold  just after its one month, and there is no sign of his growth till now.",
        "idiom_meaning": "C   Share your thoughts",
        "idiom_examples": "Add your thoughts Cancel reply      Δ  document.getElementById( \"ak_js_1\" ).setAttribute( \"value\", ( new Date() ).getTime() );"
    },
    "loose cannon": {
        "idiom_name": "loose cannon",
        "idiom_meaning": "somebody whose activities are uncommon and out of control\n an uncontrolled person who can cause unintentional damage\n someone who behaves in an unexpected and uncontrolled way and is liable to cause problems",
        "idiom_examples": "He was a loose cannon and could not be risked in front of the press.\n I don’t think he’s just a loose cannon , sometimes he really makes sense.\n The candidate turned out to be a loose cannon , and most of the voters could not place their trust on him.\n He was considered to be a loose cannon due to his volatile temper.\n They did not share any secrets with him since he was seen as being something of a loose cannon .\n He is a loose cannon and would not be a good choice for a leader."
    },
    "go out with": {
        "idiom_name": "go out with",
        "idiom_meaning": "have a romantic relationship with someone\n go out on a date with someone\n date someone regularly",
        "idiom_examples": "Sue and Rob had been going out with each other for five years before they finally decided to get married.\n Do you know whether Mike is still going out with Sally? Or have they finally decided to stop seeing each other?\n My friend had been going out with this girl for quite sometime, but unfortunately it did not work out and now they’ve broken up.\n Do you think he is the right person for you? How long have you been going out with each other?\n I know Katy and Greg used to go out with each other, but i don’t know what’s up with their relationship now.\n I’ve been going out with her for almost a year now, and I think I have finally found the right girl to settle down with.\n Most parents worry about the time when their children would grow up and start going out with someone.\n Why don’t you find someone nice and start going out with her? You can’t be depressed about your past relationships all the time."
    },
    "bite the hand that feed": {
        "idiom_name": "bite the hand that feed",
        "idiom_meaning": "to turn against someone who has been a benefactor in the past\n to reflect ingratitude towards a someone who has been helpful\n used for people who do not show respect for the one who has helped them",
        "idiom_examples": "The strategies of the state government are not perfect but the people should not bite the hand that feeds them since many lucrative policies have been brought about by this government for the common people.\n It is unfortunate that he has bit the hand that fed him for so long and is now oversees after taking all of their money.\n To expect that a person with such integrity will not bite the hand that feeds him is laughable. Hasn’t he given you enough instances in the past about his integrity?\n I would never bite the hand that feeds me, Sir. My morals are not so low.\n The fact that she bit the hand that fed her doesn’t upset you even a little?\n My institution decided to offer me an award, so I shouldn’t bite the hand that feeds me and criticize its policies."
    },
    "rob peter to pay paul": {
        "idiom_name": "rob Peter to pay Paul",
        "idiom_meaning": "to cause harm to one person in order to do good for another.\n the transfer of money or resources that have been set aside for one purpose to another.\n to solve a problem in a way that makes another problem worse.\n to discharge one debt only to incur another.",
        "idiom_examples": "I moved money from the college savings account to my main account so the debit would clear, robbing Peter to pay Paul .\n A “ rob Peter to pay Paul ” approach is not a sustainable way to handle your finances.\n When she borrowed money from one friend to pay her babysitter, she knew that she was robbing Peter to pay Paul .\n My mother told me to stop using my credit cards to pay my debts because I was just robbing Peter to pay Paul . \n “This last year has been nothing but taking money from one budget to cover expenses in another,” she grumbled, “and how are we going to stay afloat if we’re just robbing Peter to pay Paul ?”\n When her roommate once again begged her for a loan so he could pay his sister back, Lucy refused, telling him to stop robbing Peter to pay Paul ."
    },
    "have designs on": {
        "idiom_name": "have designs on",
        "idiom_meaning": "to have a plan or secret desire to get something.\n contrive a secret plot or scheme, especially with selfish motives.\n to want a sexual relationship or want to date someone.\n make a secret plot or scheme, usually with selfish intentions.\n to pursue something or someone for selfish reasons.\n take someone or something for yourself.",
        "idiom_examples": "I knew he had designs on my job the first time I saw him.\n I can see you have designs on Anna.\n The thieves had designs on the marchioness’ jewellery.\n Agatha has designs on Jimmy, and she plans to marry him soon.\n France has had designs on Belgium’s territory from the beginning.\n I think she has designs on my science project for the purpose of showing me down."
    },
    "bag and baggage": {
        "idiom_name": "bag and baggage    Meaning : (with) all one’s belongings.   Example : Tired of their tantrums, the landlady asked her tenants to vacate the house,  bag and baggage , in a week’s times.",
        "idiom_meaning": "take a back seat ❯  ❮ a bag or bundle of nerves",
        "idiom_examples": "(adsbygoogle = window.adsbygoogle || []).push({});"
    },
    "under the auspices": {
        "idiom_name": "under the auspices",
        "idiom_meaning": "under the protection, sponsorship, or patronage\n under the oversight, supervision, control of management\n with help, support, or approval\n with the backing, or patronage of",
        "idiom_examples": "We restored the home under the auspices of the historical society.\n We learned our acting craft under the auspices of our director.\n The symphony played under the auspices of their conductor.\n She learned French under the auspices of her tutor.\n Financial aid is being provided to the country under the auspices of the World Bank."
    },
    "bitter pill": {
        "idiom_name": "a  bitter pill , or a  hard pill , or   bitter medicine",
        "idiom_meaning": "something unpleasant to be endured\n a distressing experience\n something difficult to accept\n a vexation or annoyance that has to be accepted\n something hard to come to terms with\n something hard or tough to digest/take",
        "idiom_examples": "Finding out that she was adopted was a hard pill for Hailey to take.\n Getting demoted was such a bitter pill to swallow.\n Losing her partner for Jade was a hard pill to swallow.\n The news that the disease had returned was a bitter pill for Margot to swallow.\n The engineering company didn’t take on Karl after the training program, and it was a hard pill for him to take.\n It must have been a bitter pill to swallow when the bank foreclosed on the mortgage.\n For the second year running, Peter was passed over for promotion. It’s a hard pill to swallow, especially when the new guy got the job.\n The strict measures introduced to curb the spread of Covid-19 have been a bitter pill to swallow for our mental health.\n The news came that there will be no European Championship this year. That was a hard pill to take.\n It is a hard and bitter pill to swallow that my father is selling our ancestral home."
    },
    "get act together": {
        "idiom_name": "get act together",
        "idiom_meaning": "get organized and on schedule\n organize yourself so that you do things in an effective way\n become more organized and efficient\n work in a better way, with clear goals and plans\n be more serious, efficient, worthwhile\n start organizing oneself so that one does thing in an effective way",
        "idiom_examples": "The official was asked to get his act together if he wanted to keep his post.\n With just two months left for his exams, he said he should be getting his act together if he wanted to do well.\n He had been playing poorly all season, so the coach warned him that he should get his act together if wanted to keep his place in the team.\n His work is getting poorer and is full of mistakes. If he does not get his act together soon, he will risk losing his job.\n His new boss has given him one month to get his act together , or he loses his job.\n After months of putting it off, he finally got his act together and started working on the project.\n You’d better get your act together if you want a raise this year."
    },
    "the other side of the coin": {
        "idiom_name": "the other side of the coin",
        "idiom_meaning": "the opposite aspect, contrasting arguments.\n to look differently at a situation.\n a person should look at a person, circumstance , or thing from an opposing view.\n there is usually more than one side to a story, situation, or matter.\n can also be taken figuratively and literally.",
        "idiom_examples": "You should consider the other side of the coin when a wife leaves her husband and not just blame her for walking out on him.\n We know that our football team has not been performing well. On the other side of the coin , we are improving with every game we play.\n Look, I know that there are always two points of view on a legal matter. On the other side of the coin , we should believe a person when they make an accusation against another individual in a court of law .\n The other side of the coin is that fewer working hours will get you a lower income."
    },
    "run amok amuck": {
        "idiom_name": "run amok",
        "idiom_meaning": "Meaning",
        "idiom_examples": "Example Sentences"
    },
    "ballpark figure": {
        "idiom_name": "ballpark figure",
        "idiom_meaning": "to be near about the exact (usually in amount)\n an estimate of what the actual figure will be like",
        "idiom_examples": "The management was given a ballpark figure at the very beginning of the presentation.\n She manages to give her father a ballpark amount that she would need every week.\n I have donated this ballpark figure to the children’s aid this morning.\n Even a ballpark figure to this number is going to hurt our overall numbers very badly this quarter.\n I save a ballpark figure of 20% from my salary every month as something for the rainy day.\n Do you know that the making of this building cost a ballpark figure of 1 million US dollars?\n I need a ballpark figure that will be required for this project so that the management can make further business and finance decisions.\n The ballpark figure has been allocated among all the shareholders, when the company liquidated."
    },
    "pay as you go": {
        "idiom_name": "pay as you go",
        "idiom_meaning": "a payment system that allows you to pay right before a service you use rather than later.\n to pay for the cost of something, only for what you have used.\n a method of paying for services before they are utilised or meeting costs as they emerge.\n a pay-as-you-go system is one in which you pay for a service in advance and are not permitted to use more than the amount paid.\n to pay for the cost of something only when it occurs, instead of paying it later.",
        "idiom_examples": "When it comes to mobile phone contracts, seven out of ten customers opt for pay-as-you-go plans.\n In terms of implementation, it is a pay as you go feature.\n Pay-as-you-go services such as gas and electricity are available.\n He urges lawmakers to abandon their belief that the existing pay-as-you-go pension system is unsustainable.\n The combination of pay-as-you-go finance and an older population magnifies this worry in many nations.\n The economy remains stable during Period 1, as expected of a pay-as-you-go social welfare system."
    },
    "bosom friend": {
        "idiom_name": "bosom friend , also,  bosom buddy",
        "idiom_meaning": "best friend who is very close to you\n someone whom you share everything with\n someone you can always rely on\n close friends who share confidences\n a kindred spirit\n someone you have an intimate relationship with",
        "idiom_examples": "The two ladies who were arrested for injuring each other for one man were bosom friends for years.\n I wouldn’t call him a bosom friend , since we aren’t that close.\n She’s been my bosom friend since we were kids .\n Everyone saw them as bosom friends , so it was a surprise when they had a falling out.\n Anyone should be able to see their partner as their bosom friend .\n A bosom friend of yours doesn’t go back on their word.\n They were bosom friends who had been through thick and thin together.\n He’s my soulmate, or my bosom friend if you would. \n She was a bad bosom friend the moment she talked behind her back.\n I need my bosom friend here to support me!\n We’ve been bosom friends because we grew up together."
    },
    "twenty three skidoo": {
        "idiom_name": "twenty-three skidoo",
        "idiom_meaning": "to depart in a haste\n to leave quickly or being forced to leave quickly\n to get out while things are still good",
        "idiom_examples": "The police threatened to imprison everyone in the crowd that did not 23 skidoo from the park.\n After hitting the motorcycle, the car driver stopped and he twenty-three skidoo toward the woods.\n Hey, Sally, it’s too hot today, let’s twenty-three skidoo for the beach.\n Man, I came here to watch these beautiful mountains, don’t twenty three skidoo so soon.\n The kids were plucking flowers from my garden when I shout at them, they just 23 skidoo ."
    },
    "at odds": {
        "idiom_name": "at odds",
        "idiom_meaning": "to disagree\nabout something\n to argue\nabout a matter\n two things\nthat seem to be opposites\n in conflict\n at variance\n in\ndisagreement or dispute\n arguing",
        "idiom_examples": "They are at odds about the fundraiser that I being held on Saturday.\n We are at odds about how to punish our son for skipping school. I take the matter much more seriously than my husband does.\n They are definitely at odds about how to run the company. This is causing the stakeholders to lose faith in them.\n Her beaming smile was at odds with the rumours that I had heard about her quick temper.\n His piercing blue eyes are at odds with the rest of his features.\n His speech during the meeting is completely at odds with what we discussed last week."
    },
    "in no time": {
        "idiom_name": "in no time",
        "idiom_meaning": "a very short period of time\n very quickly\n almost instantly\n what feels like a very short period of time, even though it isn’t really\n immediately\n very soon\n quickly / rapidly",
        "idiom_examples": "I completed the project in no time at all.\n If we all work together on the essay, we will be able to complete it in no time .\n Now that they have built the high speed rail network we can get to Shanghai in no time .\n We will be out of here in no time . I just have to reset the router.\n You can easily bake a cake from scratch. It will be done in no time .\n I can’t believe how quickly our children have grown up. In no time they will be off to college.\n It feels like we have just arrived on the island, I can’t believe that our holiday is almost over. In no time we will be back at work."
    },
    "black hole": {
        "idiom_name": "black hole",
        "idiom_meaning": "a place in which things are lost never to be seen again\n a prison or place of confinement. Often related to “the black hole of Calcutta”\n in commerce it is used to describe an organization into which large quantities of money is poured but no profit is shown\n a sphere of influence from which things like communication are not forthcoming",
        "idiom_examples": "My handbag is a black hole . You can try and find the keys in there but I can’t promise anything.\n My memory is a black hole. I have to write everything important down.\n After the prisoner stabbed a guard he was sent to solitary confinement. It is called the black hole .\n The National Airline has become a massive black hole in the economy.\n The new division of the company has become a financial black hole .\n The new administration has become a black hole ."
    },
    "between you and me": {
        "idiom_name": "between you and me",
        "idiom_meaning": "a secret to be kept between two people\n in confidence\n information to be kept strictly confidential\n information not to be told to anyone else",
        "idiom_examples": "Let me tell you something. Just between you and me , I don’t think her painting deserves the first prize.\n Susan, “ between you and me , Mary spent a year in an asylum because of the murder of her husband.”\n Joe, “ between you and me and the four walls , Jack has been on drugs since he was 16.”\n Nancy, “ between you and me and the gatepost , it was Alicia that proposed to Peter, not vice versa .”\n Jason, “ between you and me and the lamppost , there is a run happening tomorrow on pork bellies.”\n Angela, “ between you and me , there is a lot to be desired in working in this place.”"
    },
    "go with the flow": {
        "idiom_name": "go with the flow   also,  go with the tide",
        "idiom_meaning": "to do what other people are doing in any particular situation\n be stress-free and adopt any situation, instead of trying to change it\n to not fight against set norms, conducts, standards, and behaviours\n maintain the status quo \n giving in to peer pressure\n to not do anything to affect the outcomes of courses of events\n to agree to do something with majority since it is the best method\n to follow the circumstances\n flexible; adaptable; workable; supple",
        "idiom_examples": "Kevin didn’t want to be part of the protest, but all his friends wanted to stand for something, so he chose to go with the flow .\n Rebecca wanted us to go to dinner instead of the dodger’s game, I didn’t want to upset her, so I just went with the flow .\n I would like to suggest you to go with the tide until you achieve a higher position in company.\n My grandmother always advised me to go with the flow and to stay safe.\n In order to win – all the team members are required to go with the flow .\n The best method to spy on your partner is to be patience and go with the tide .\n John always upset the applecart by not going with the flow .\n We have no choice but to go with the flow and hope the best is yet to come .\n Do not get upset or overreact to get rid of a problem – just go with the flow .\n If you don’t have a choice then most simple principle of staying happier in life is to go with the flow ."
    },
    "in hot water": {
        "idiom_name": "in hot water",
        "idiom_meaning": "in trouble or state of shame\n find yourself in a serious situation where you could be punished\n incite hostility or trouble of some kind where there will be a reprisal\n provoke anger by your actions and open yourself up to criticism or disgrace",
        "idiom_examples": "The opposition leader landed himself in a whole load of hot water after making several vulgar comments.\n Mick was in hot water with his mother because he took her car without asking.\n A construction company in hot water after building collapse.\n Harry had to work overtime to bring all his accounts up to date before he got into hot water with his boss.\n I’m in so much hot water for being late home last night. I might be grounded for a month.\n The press has got itself into hot water over the alleged phone hacking by certain reporters.\n A shopkeeper got himself in hot water after being accused of selling fake products."
    },
    "rain or shine": {
        "idiom_name": "rain or shine",
        "idiom_meaning": "Doing something regularly regardless of the circumstances.\n Something will happen even if it rains.\n No matter what happens or what what it takes.\n To be sure of something.\n Whether it’s sunshine or rain, whatever the weather.",
        "idiom_examples": "My brother is an early riser, but he runs at sunrise, come rain or shine .\n David is a dependable driver; he always comes through on any delivery request, come rain or shine .\n I feel exhausted after work, but come rain or shine , I must take a cold shower before supper to relieve myself.\n Most fans support the team after its last six winning matches, and they will be there rain or shine in its next fixtures.\n It was a great pleasure to meet her governor. The governor promised that, come rain or shine , he would clear all her fee areas.\n Just a quick reminder. When is your graduation? Oh yeah! I just remembered it’s next month. Rain or shine , I’ll be there!"
    },
    "in the air": {
        "idiom_name": "in the air",
        "idiom_meaning": "something like a mood that everybody can feel\n you can sense/feel/smell/taste it but not see it\n it might be a change in the atmosphere or temperature\n an anticipation that something is happening or going to happen",
        "idiom_examples": "You could feel the tension in the air as everyone waited to hear the announcement.\n There was great excitement in the air at the clock struck midnight.\n I felt the chill in the air as autumn approaches.\n The smell of spices in the air was making me hungry.\n He could taste the salt in the air as he got nearer to the coast."
    },
    "blind impulse": {
        "idiom_name": "blind impulse",
        "idiom_meaning": "sudden and unaccountable desire to do something\n refers to the sudden instinct to act compulsively",
        "idiom_examples": "Example Sentences"
    },
    "all roads lead to rome": {
        "idiom_name": "all roads lead to Rome",
        "idiom_meaning": "all the routes are directed towards\nthe center\n there is more than one way to achieve\nthe same thing\n variety of methods will yield the\nsame result in the end\n exactly the same outcome can be\nproduced using many different ways\n there are many different routes to\nreach the same destination",
        "idiom_examples": "Take any route of your choice because all roads lead to Rome .\n All roads lead to Rome , so whether you draw from the top or from the bottom, it\nwill give you the same drawing.\n Some people have to memorize while\nothers can remember by just going through it once. In the long run, all roads lead to Rome .\n Sam always uses a shorter method to\nget the right answer as all roads lead\nto Rome ."
    },
    "devils advocate": {
        "idiom_name": "devil’s advocate",
        "idiom_meaning": "one who presents a counter argument\n one who argues against something just for the sake of arguing, without actually being committed to the views\n one who puts forward arguments against a proposition, even if they may actually agree with it, simply to test the validity of the proposition\n someone who pretends to be against an idea or plan that many agree with, so that people may discuss it and consider other views\n a person who disagrees with others solely for the sake of having a discussion on the issue",
        "idiom_examples": "I agree with what you say, but I’ll play devil’s advocate so that we can cover all the possibilities that may arise.\n He offered to play devil’s advocate and argue against our case so that we could find out any flaws in it.\n The schoolmaster often played devil’s advocate with his students so that they could have an interesting discussion and look at other point of views.\n The plan is good, but I’ll play devil’s advocate so that we know what the opposition can say.\n The defence lawyer played devil’s advocate , explaining that the truth could be the opposite of the way it looked, but the judge wasn’t having it. \n If you don’t play devil’s advocate to test your own ideas, you will never know if they stand up to scrutiny.\n Playing devil’s advocate to every detail of the plan is the only way to ensure that you anticipate problems before they occur. \n I am sick of you playing devil’s advocate with everything I say – you are just doing it to be argumentative."
    },
    "rip off": {
        "idiom_name": "rip off",
        "idiom_meaning": "the act of stealing\n financial exploitation\n a knock off, usually a brand name\n something that is not worth the value\n plagiarism\n things stolen\n in music, borrowing someone else’s guitar riff or song idea \n to tear forcefully ( British English )\n duplicating something without any original features ( British English )",
        "idiom_examples": "I can’t believe I paid that much money for that outfit. It was a rip off .\n The car I bought was a lemon; the salesman ripped me off .\n I can’t believe the company is releasing a rip-off of a classic video game.\n She ripped off my song.\n I didn’t do research, so my hotel was a rip-off .\n The movie was so bad and the tickets so expensive, what a rip-off .\n My wallet is missing; I can’t believe the thief ripped me off ."
    },
    "mind your own beeswax": {
        "idiom_name": "mind your own beeswax",
        "idiom_meaning": "do not interfere into someone else’s matter\n an informal phrase used for keeping people away from your affairs\n to rudely ask others to stay out of our personal matters\n asking to respect the privacy of others\n mind your own business",
        "idiom_examples": "I am not asking for your opinion, mind your own beeswax .\n You better keep your comments to yourself and mind your own beeswax .\n I really wish he would mind his own beeswax and stop asking about my salary.\n I would like you to mind your own beeswax because ; I am tired of your suggestions.\n Don’t poke your nose into my matters, that doesn’t concern you, mind your own beeswax"
    },
    "black sheep": {
        "idiom_name": "the  black sheep",
        "idiom_meaning": "a disgrace\n the least reputable member of a group\n someone who is viewed as unlike the rest (usually a part of a family)\n someone who is disapproved of\n someone who brings shame to their family",
        "idiom_examples": "I have always been the black sheep of my family. Everyone else has responsible jobs while I have chosen to be an artist.\n John is the black sheep in our family. He almost ended up in jail a few times when we were younger.\n My cousin is seen as the black sheep in our family. She left school to run off with her boyfriend.\n Vijay Mallya was the black sheep . Eventually, he migrated to the United Kingdom to avoid the punishment here.\n When I chose to marry you, my father was very worried. Once he said, “Do you really want to spend your life with that black sheep ?” 😛"
    },
    "rabbit hole": {
        "idiom_name": "rabbit hole  ( down the rabbit hole )",
        "idiom_meaning": "mentally go somewhere surreal or strange\n enter a chaotic or problematic situation\n be on a journey or process that is complex, confusing or difficult\n get sucked into a weird situation\n a weird, bizarre, or senseless situation, from which it is difficult to disengage",
        "idiom_examples": "Peter is having another one of his parties on Friday. Time to go down the rabbit hole again.\n Research is a rabbit hole for me. I’m not too fond of it.\n I spent so long reading about the history of the Soviet Union online that I fell down a rabbit hole . So, I’m super tired today.\n He slid down a rabbit hole last night on the internet. Once he started searching, he couldn’t stop.\n She just went on Facebook to check her status and fell down a rabbit hole and lost track of time.\n The novelist Mark Twain tumbles down the rabbit hole of extremism.\n I’d found myself going down the rabbit hole of strange YouTube, and it was so weird.\n At the time, much of the world was heading down the Coronavirus rabbit hole , and we were incredulous.\n We’ve all found ourselves going down the rabbit hole of Netflix true crime documentaries.\n We have entered a rabbit hole from which we won’t be able to extricate ourselves easily."
    },
    "get through": {
        "idiom_name": "get through",
        "idiom_meaning": "to make it\nto the end of a particularly arduous or stressful experience\n to assist\nsomeone in dealing with a traumatic event\n to reach\nsomeone by telephone\n to\ncommunicate with someone in such a way that makes them understand or\nacknowledge something\n wear out\n go through\n use up",
        "idiom_examples": "I didn’t think we would get through the last week of exams.\n I can’t wait to get through the first Christmas since my divorce. It is going to be very tough few weeks.\n We all need to help Andrea get through the death of her mother.\n After trying for hours, I was finally able to get through to their head office in Germany.\n His high school guidance counselor is the only person who was able to get through to him. She convinced him that he needs to apply for colleges soon if he wants any chance of a future."
    },
    "put your foot in it": {
        "idiom_name": "put your foot in it  ( British ) also,  put your foot in your mouth",
        "idiom_meaning": "say something (by mistake) that upsets, humiliates, or embarrasses someone\n make an embarrassing, inappropriate or stupid statement\n causing embarrassment with a tactless remark\n to be unintentionally disrespectful, thoughtless, or offensive\n to commit an indiscretion or social blunder\n to accidentally do or say something that you later regret",
        "idiom_examples": "Carla put her foot right in it when she congratulated her neighbour on being pregnant. It turns out she’s not expecting but had just put on weight.\n The president is always putting his foot in his mouth . He embarrasses himself and his party every time he speaks.\n Martin put his foot in it today. He was moaning about having no bonuses this year, and the boss was standing right behind him. How awkward!\n Mary and Joe had such a row the whole street must have been able to hear it. Apparently, Joe had put his foot in it by referring to her by his first wife’s name.\n A couple of times, it’s happened that someone really had screwed up on my team, and I put my foot in my mouth .\n I suggest you that don’t put your foot in your mouth at the party and look stupid.\n The first impression does matter unless you put your foot in your mouth and manage to ruin the interaction before it starts.\n At some point in your quest to learn Spanish, it is quite likely that you will put your foot in it and that will leave those around you clutching their sides as they try to control the laughter.\n You’re blessed with the ability to gab but are also known to put your foot in it ."
    },
    "all the rage": {
        "idiom_name": "all the rage",
        "idiom_meaning": "when something is the height of popularity\n it implies that the fashion will be short lived and has no staying power",
        "idiom_examples": "My parents used to love the Beatles. They were all the rage when they were teenagers.\n These bell-bottom pants were all the rage in the 1960s.\n Tribal tattoos used to be all the rage. Now people are just stuck with silly symbols on their bodies.\n Don’t worry about the new restaurant down the street. It is all the rage now, but the customers will come back to us eventually."
    },
    "troubled waters": {
        "idiom_name": "troubled waters",
        "idiom_meaning": "a difficult phase of life\n a time filled with problems\n falling into a confusing situation\n a panicky condition\n a chaotic situation\n a bad experience\n a circumstance charged with stress",
        "idiom_examples": "The situation was getting worse, but like all the other members of the company, he was fascinated by troubled waters .\n Marry worked hard for her business to flourish, but it has been in troubled waters for 5 months.\n Stay away from those who try to fish in troubled waters .\n Your irresponsible behavior would have brought us all into troubled waters .\n It was pretty hard to pour oil upon troubled waters , but Jack was brave enough to do that.\n It’s not good to enter the troubled waters of sectarianism."
    },
    "out of hand": {
        "idiom_name": "get  out of hand",
        "idiom_meaning": "out of control\n no longer in control of something or someone\n difficult to control a situation\n be chaotic or unmanageable\n be in an unruly state",
        "idiom_examples": "When the police arrived, they realised the party was getting out of hand .\n Jane and Sarah had a disagreement that suddenly got out of hand and then everyone was shouting.\n Their kids need some discipline, they are getting completely out of hand .\n Two of the children started fighting in the playground yesterday. It wasn’t long before it all got out of hand .\n The farmer was trying to get all the sheep into the barn when it all got out of hand and they ended up in the road.\n I thought it would be a good idea to bake some buns with my small nephews, but it got out of hand and took me 2 hours to clean up the mess.\n We’re going to look at that and, if there’s something that was out of hand , then we’ll deal with it.\n Soon, the situation went out of hand .\n The authorities concede that the viral outbreak “has gone out of hand .”\n How do I not let this get out of hand, and what is out of hand anymore?"
    },
    "backroom boys": {
        "idiom_name": "backroom boy(s)",
        "idiom_meaning": "people who work in anonymity\n someone working tirelessly behind the scenes\n a person who advises someone in the public eye\n working without public knowledge or awareness\n a person involved in systematic especially secret research",
        "idiom_examples": "They left the technical problems for the back-rooms boys . They will make short work of it all.\n It’s the people behind the scenes who deserve all the praise. We never see the backroom boys in public, but we know how hard they all work.\n Thank heavens they had an army of backroom boys to rely on in a crisis.\n The president trusts his backroom boys to give him the best advice at all times.\n The evening was going smoothly, thanks to all the backroom boys and girls working hard to get everyone where they should be at the right time.\n They want to hire the backroom boy of their opponent."
    },
    "blast from the past": {
        "idiom_name": "blast from the past",
        "idiom_meaning": "a way to refer to something or someone reminding you of an earlier time .\n something or someone that surprises you because you have almost forgotten about them.\n something from the past that you remember, see, or hear again, reminds you of that time in your life .",
        "idiom_examples": "What a blast from the past ! I haven’t heard that song in years.\n This yearbook picture is a blast from the past .\n That nickname is a blast from the past . No one has called me that in years!\n Watching that movie again was a real blast from the past ."
    },
    "by the skin of your teeth": {
        "idiom_name": "by the skin of your teeth",
        "idiom_meaning": "barely manage to do something\n narrowly succeed in doing something\n manage to do something by the smallest margin",
        "idiom_examples": "We managed to complete the project on time by the skin of our teeth.\n After being chased by the police a long way, the criminal managed to escape by the skin of his teeth.\n He made the final cut off list of the university by the skin of his teeth.\n I managed to pass the exam by the skin if my teeth.\n He slipped at the edge of the cliff but managed to hold on to a rock, and was saved by the skin of his teeth.\n The team held on by the skin of their teeth to win the crucial match.\n He cleared the selection criteria by the skin of his teeth.\n We escaped the raging rioters by the skin of our teeth."
    },
    "in the loop": {
        "idiom_name": "in the loop",
        "idiom_meaning": "to be aware of the information\n to have specific knowledge that others have\n to be included in what the rest of the group know\n actively take part in something like gossip or scheme\n to be an active member of a team doing a task",
        "idiom_examples": "Katy was always happy that her friends kept her in the loop with the latest gossip.\n It was a good meeting and the boss had made sure we were all in the loop .\n Please can you call me later to keep me in the loop with dinner plans for the weekend?\n I made an extra effort to watch the news today, so I was in the loop with what was going on in the world.\n We have to keep Matthew in the loop before we reach the destination.\n During the Covid-19 pandemic, the company was spending a lot of money to keep employees in the loop .\n Guys, please keep me in the loop when planning the trip."
    },
    "make a clean breast": {
        "idiom_name": "make a clean breast",
        "idiom_meaning": "to tell the truth about something.\n speak openly and honestly about something (especially if it was kept a secret or has been lied about in the past).\n admitting and confessing.\n to make a confession or to tell the truth about something you feel guilty about.",
        "idiom_examples": "Sharon made a clean breast of it and threw Ashley under the bus.\n He finally decided to make a clean breast of it and admitted to robbing the priest.\n After a thorough interrogation, she made a clean breast of it and exposed the real culprit.\n The footballer made a clean breast to his coach on the drug use claims.\n John eventually made a clean breast of it and admitted to copying the assignment.\n Jay had to make a clean breast of his dealings after he was caught with marijuana.\n Harry is yet to make a clean breast and admit that he is involved in fraudulent activities.\n The child wanted to make a clean breast about what he had taken from his mother’s purse.\n I have never been so happy as when I made a clean breast of my wrongdoings and got rid of that dark cloud that was following me for years.\n Many of our clients are professionals and want to make a clean breast before joining our company.\n The therapist asked me to make a clean breast of my problems and get over them once and for all.\n I made a clean breast of my past relationship with that girl and told my parents about it.\n While wedged stealing in a supermarket, Robert decided to make a clean breast of it to the owner of the store."
    },
    "laughing stock": {
        "idiom_name": "laughing stock",
        "idiom_meaning": "Something ridiculous which can be laughed upon.\n It is something that is exceedingly funny to a point of becoming embarrassing.",
        "idiom_examples": "After the event and how he behaved there, he was the laughing stock in school for days to come.\n The host made a mistake in saying out the name of the winner and instantly became a laughing stock for everyone.\n The media nowadays tries to make a sensation out of everything. It is a laughing stock for some who understand how journalism should really be."
    },
    "fiddle while rome burns": {
        "idiom_name": "fiddle while Rome burns",
        "idiom_meaning": "to perform an inconsequential task or act irresponsibly in the midst of a disastrous event.\n to concern yourself with frivolous matters during an emergency.\n to act as though nothing important is going on when you should be addressing a dangerous ongoing problem.\n to occupy yourself in an inappropriate manner when you should be dealing with problems that threaten dire consequences.\n wasting time on petty endeavors (or trivial pursuits) when your attention is required elsewhere due to a crisis.",
        "idiom_examples": "Vacuuming the carpet while her co-worker was in with the boss, trying to steal her job, felt like fiddling while Rome burned .\n They need to stop fiddling while Rome burns and come help put out this fire.\n With a pandemic going on, some of our members of the government just fiddle around while Rome burns .\n We can’t keep fiddling while Rome burns ; we need to address these issues of climate change.\n Bob knew he was just fiddling while Rome burned , but he couldn’t rouse himself to face the crisis.\n She frowned at me and said, “You can go ahead and fiddle while Rome burns , but I’ve got to take action.”"
    },
    "walking on air": {
        "idiom_name": "walking on air   also,  floating on air",
        "idiom_meaning": "to be very happy (elated)\n to feel awfully excited or pleased\n to be in a state of intense happiness\n in seventh heaven\n to be on cloud nine \n so pleased as to be amazed/confused\n in a pleasant state\n contentedly drunk",
        "idiom_examples": "I have been walking on air since I found out that I have been awarded a scholarship to study music.\n She has been walking on air since getting engaged last week.\n I am so happy in my new job that I feel like I am walking on air .\n I heard that you are going to Italy on holiday next month. You must be walking on air .\n She was feeling like walking on air after hearing the news of her passing the exams.\n Jane is floating on air after her painting won first place last week in the annual “Work of Art Challenge.”"
    },
    "shoot the breeze": {
        "idiom_name": "shoot the breeze  also,  shoot the bull",
        "idiom_meaning": "spend time chatting, useless talking or chit-chat\n idle talking\n talking aimlessly without any serious topic\n talking to your friends in an informal way\n to discuss unimportant things or exaggerate the truth",
        "idiom_examples": "They have spent the whole afternoon just shooting the breeze in the office.\n My customers always want to shoot the breeze with me before they say what they were coming to purchase.\n When Ken passed me on my desk, we shot the breeze for a while.\n The afternoon session is always dull; I always spend the better part of it shooting the bull with my friends.\n They always expect me to sit and shoot the breeze with them for hours at the weekend.\n Never take his talks seriously; he always likes to shoot the bull .\n Instead of shooting the breeze for so long, she should get to work."
    },
    "over the top": {
        "idiom_name": "over the top",
        "idiom_meaning": "excessive, exaggerated\n too extreme, overdone\n beyond normal, acceptable or reasonable limits",
        "idiom_examples": "The politician was over the top with his speech. Everything he said was exaggerated.\n The company had gone over the top with its projections of growth in the current year.\n The arrangements for the party was way over the top.\n He went over the top with the numbers in his report.\n He has a habit if going over the top whenever he is out with his friends.\n The way the media covered the celebrity wedding was way over the top.\n The talk was supposed to be motivating, but the promises made were over the top and sounded insincere.\n In his quest to build a business empire, he went over the top with his borrowings and finally collapsed when the markets were tough."
    },
    "keep promise": {
        "idiom_name": "to keep one’s promise",
        "idiom_meaning": "be faithful to your word\n fulfil a promise you have made\n make good on something you have agreed\n to give ground for expectation",
        "idiom_examples": "How on earth can I marry him when he can’t keep his promises ?\n The government kept its promise to the people and the taxes were reduced.\n Her boss cannot keep the promise he made about a pay rise.\n His mother kept her promise , and they went to the zoo at the weekend.\n You may find it difficult to keep your promise while working abroad.\n If you keep your promises , it will create an image that you are truthful and believable.\n She has not betrayed him — she kept her promise .\n “Because he kept his promise , I am going to keep mine.”\n My dad promised to buy me a new bicycle. He kept his promise ."
    },
    "come out": {
        "idiom_name": "come out",
        "idiom_meaning": "to reveal\nsomething (often unintentionally)\n to bring\nsomething (often the truth) into the open\n to make a\nformal debut in society\n to be\nreleased to the public\n to join\nfriends at a social gathering\n to reveal a\nsecret to others (often used to depict homosexual people telling their family)\n to remove\nsomething (usually a stain)\n became\nvisible/manifest\n to show\nyour face",
        "idiom_examples": "I didn’t mean to tell him about your job interview, it just came out .\n After four days of snow, it was nice to see the sun come out today.\n It doesn’t matter how much you try to deny it the truth will come out .\n I am very excited to come out at the debutante ball next spring.\n Their new book will come out next week.\n I have a lot of work to do, but I will try to come out this weekend.\n It was very difficult for my brother to come out to my parents.\n I have tried everything but this mustard stain on my blouse won’t come out ."
    },
    "by hook or by crook": {
        "idiom_name": "by hook or by crook",
        "idiom_meaning": "by any possible means\n achieve something by any method available\n reach your goal by any way necessary, be that good or bad",
        "idiom_examples": "The farmer will not sell us the land. By hook or by crook , he is hanging on to it.\n I have never met such a stubborn child. By hook or by crook , he will not apologise when he is naughty.\n Ken is determined to hang on to his old banger of a car by hook or by crook .\n She was going to beat this illness by hook or by crook .\n She ultimately decides that she will win him by hook or by crook .\n Sarah resolves to find her husband an organ donor by hook or by crook .\n During a tough time, staying positive is difficult demand, but it must be done – by hook or by crook ."
    },
    "home is where the heart is": {
        "idiom_name": "home is where the heart is",
        "idiom_meaning": "a place you feel connected to emotionally\n a place you are happy to arrive back at\n somewhere you have fond memories of\n being near your family and loved ones",
        "idiom_examples": "No matter where I go, it’s always so lovely to come back here. Home is where the heart is after all.\n My parents have a great saying on a tapestry on the wall of their lounge. It says ‘ home is where the heart is ‘ and it’s very true. \n Home is certainly where the heart is they all agreed as the family sat down together for Christmas dinner."
    },
    "by and by": {
        "idiom_name": "by and by",
        "idiom_meaning": "soon; after a while.\n later; in due course.\n as time passes.\n before long.\n eventually.\n in due time.",
        "idiom_examples": "By and by , she paused to make sure everyone was paying attention.\n The taxi ride to the airport seemed to go on forever, but by and by , we arrived.\n By and by , I grew accustomed to the new house.\n He’ll come for a visit by and by .\n By and by , the rain stopped, and the sun began to shine again.\n The nurse called me in by and by , and finally, the doctor arrived.\n I wasn’t eager to do my chores, but I knew I’d have to get to them by and by .\n I asked my grandmother when we could go swimming, and she said, “ by and by , dear, just be patient.”\n The British Metro trains moved in and out of tunnels on that rocky terrain, and, by and by, they arrived at the big town of Glasgow."
    },
    "until the cows come home": {
        "idiom_name": "until the cows come home",
        "idiom_meaning": "Meaning:",
        "idiom_examples": "Example:"
    },
    "wear heart on sleeve": {
        "idiom_name": "wear your heart on your sleeve",
        "idiom_meaning": "display your emotions openly\n make your feelings apparent and obvious\n openly reveal your feelings and emotions\n unable to hide your emotions and feelings\n be emotionally transparent\n be open or forthright about your emotions.",
        "idiom_examples": "It was evident that he was in love with her. He wore his heart on his sleeve and you could see how he felt about her.\n She is a very sensitive person and wears her heart on her sleeve , so it very easy to hurt her feelings.\n Sam always wears his heart on his sleeve , so everyone knew how he was feeling.\n He wore his heart on his sleeve and it was obvious that he was shattered by his recent breakup with his girlfriend.\n If you wear your heart on your sleeve , you will be very vulnerable and people are going to take advantage of you.\n She used to be a very passionate woman who wore her heart on her sleeve , but repeated rejections and mistreatment at the hands of the ones she trusted made her go into a shell and bottle her emotions up."
    },
    "hit the nail on the head": {
        "idiom_name": "hit the nail on the head",
        "idiom_meaning": "be accurately right about something\n find the exact answer\n do or say exactly the right thing\n to precisely describe the cause of a problem or situation",
        "idiom_examples": "Stephen hit the nail on the head when he said that what the company was lacking in was clear vision and focus.\n The foreman hit the nail on the head when he said that the machine had malfunctioned because of a faulty spark plug.\n “You’ve found the problem, Sid! You hit the nail on the head !”\n He is a smart debugger. Every time you take a broken code to him, he will hit the nail on the head and tell you the exact problem.\n He hit the nail on the head when he said that most people won’t change their ways and continue to blame the system for all their ills.\n When my car didn’t start, my friend took one look and said that its due to a dead battery. Seems like he hit the nail on the head ."
    },
    "stand in a good stead": {
        "idiom_name": "stand someone in a\ngood stead",
        "idiom_meaning": "to be of advantage to someone\n to be of great use to someone\n When something is said to stand someone in good stead , it implies the thing is being good for the person, in any context.\n Used in general to refer an experience or talent or ability or position, which would be useful or beneficial for a person, his life and his future.",
        "idiom_examples": "His years of experience in the spoken English field has stood him in good stead .\n Amelia’s ability to accurately read someone’s expressions is standing her in good stead in her career as a psychiatrist.\n Mark was expecting that his two-month internship with Amazon will stand him in good stead when he’ll be out of college, searching for jobs.\n No matter which field you choose, having a great communication skill would always stand you in good stead . It is a great ability to develop.\n Me being a linguist has stood me in good stead in my travels and adventures.\n His great capability as a student has stood him in good stead in University."
    },
    "go out on a limb": {
        "idiom_name": "go out on a limb",
        "idiom_meaning": "do or say something that is different from most other people\n get into a position where others do not support you\n take a wild guess\n get into a challenging or disadvantaged position to support someone\n get into a risky situation to help someone else",
        "idiom_examples": "During an analysis of the news, he went out on a limb and expressed an opinion opposite to that held by the general public.\n He went out on a limb trying to support his colleague’s views and, in the process, earned the ire of his boss.\n Considering the fact that almost everyone is against him getting that post, would you really go out on a limb and support his candidature?\n True to his character, he went out on a limb and expressed views that were exactly opposite to what everyone else wanted.\n I’m not going to go out on a limb every time and support you for your goof ups."
    },
    "keep card close to chest": {
        "idiom_name": "( keep, play or hold ) one’s card close to one’s chest",
        "idiom_meaning": "be secretive or cautious, give nothing away\n to keep your plans, intentions, or thoughts hidden from others\n to keep one’s intentions, strategies, or plans secret from everyone else\n used when one chooses not to share his or her thoughts and ideas with other people quickly and openly",
        "idiom_examples": "The children did not know where they were to go for their family holiday trip. Their dad kept his cards close to his chest .\n The therapist found a hard time dealing with Tim. Tim kept his cards close to his chest all through the session.\n The coach advised the football team to hold their cards close to their chests so that their opponents would not get to know their plan. \n During the campaigns for the senate position, the aspirants kept their cards close to their chests to defeat their opponents.\n My brother doesn’t know how much money his friends will spend this Friday night. He keeps his card close to his chest .\n Keep your cards close to your chest , and don’t lay them around the table . The first thing you need to ask is the price of the car you are eyeing.\n Play your cards close to your chest, and be aware when opportunity knocks."
    },
    "ride high": {
        "idiom_name": "ride high",
        "idiom_meaning": "when someone is very successful\n somebody Being confident\n being popular and doing quite well in their life\n to be quite excited and happy",
        "idiom_examples": "Our team won four college tournaments in a row this year! Why wouldn’t the team be riding high !\n You’ve got a TV show coming up? Oh my God! Someone is clearly riding high !\n Anita finally got the promotion she’s been waiting since like forever. She’s been riding high ever since the news came through!\n Girl, don’t ride so high already! It has just been three weeks since you have gotten into this relationship!\n There has been quite a debate over which of the two major parties is going to win this year’s elections. Now that the elections are almost here, supporter really seem to be riding high !"
    },
    "hit the roof": {
        "idiom_name": "hit the roof",
        "idiom_meaning": "experience sudden anger\n express extreme annoyance\n lose your temper or become enraged/infuriated.\n prices increasing sharply",
        "idiom_examples": "Jake’s parents are going to hit the roof when they see the damage he’s done to their car.\n When Cassy saw her husband in the restaurant with another woman, she hit the roof .\n When the referee disallowed his goal, he hit the roof and was given a red card.\n The share prices hit the roof today after a leaked deal with the oil companies.\n Ellie’s parents hit the roof when they saw her report. She was grounded for a month."
    },
    "bone to pick": {
        "idiom_name": "a  bone to pick  with also,  pick a bone  with",
        "idiom_meaning": "having a complaint that needs to be discussed.\n something to argue about, a matter to discuss.\n an unpleasant issue that needs discussion.\n a person has an issue with another individual, that must be addressed or resolved.\n two people are literally fighting over an object, an idea, a grievance, or another person.",
        "idiom_examples": "Jake walked up to Robert and told him that he had a bone to pick with him.\n Frank was the first one to pick a bone with Johnny, explaining that he was always wrong.\n Catrina decided to send Jill a DM telling her that she was about to pick some bones with her.\n Ruth was hesitant. She didn’t want to pick a bone with a random guy she’d never met.\n Alderman Masterson had a bone to pick with his constituents. They were making unrealistic demands for him to resolve all of the issues within their community.\n When it comes to many Americans’ eating habits, the etiquette experts in the United States have a bone to pick .\n The two reputed universities in the state have a bone to pick with each other over the reservation policy for admissions."
    },
    "you can lead a horse to water but you cant make him drink": {
        "idiom_name": "you can lead a horse to water but you can’t make him drink",
        "idiom_meaning": "we can offer good things to people but we can’t force them to accept that\n you can present an advantage but can’t force someone to opt for that\n we cannot enforce our decisions on anyone even if they are for their betterment\n people will do whatever they wish to do no matter how much you ask them not to",
        "idiom_examples": "I have tried my level best to educate him well, but he is still having a non-serious behavior, you can lead a horse to water, but you can’t make him drink .\n My father always wanted me to become a doctor, but I just wanted to be a fashion designer . It is true that you can lead a horse to water but you can’t make him drink. \n I made all the arrangements but he is still not coming tonight. Well, you can lead a horse to water but can’t make him drink. \n I had advised him not to marry so soon, but he still did this. It’s like you can lead a horse to water, but you can’t make him drink ."
    },
    "leaps and bounds": {
        "idiom_name": "leaps and bounds",
        "idiom_meaning": "progress very quickly\n grow or increase rapidly\n get better or improve in a short time",
        "idiom_examples": "Regan’s reading skills are coming on in leaps and bounds with the new teacher.\n I planted some seedlings last month, and they have grown by leaps and bounds after all the recent rain.\n My puppy has grown leaps and bounds since I’ve started giving him dietary supplements.\n When Moss lived in Paris, his command of French increased by leaps and bounds .\n The IT market is expected to grow with leaps and bounds in the upcoming years.\n Henry bought shares in a tech company last year, and they have gone up in leaps and bounds .\n My baby niece has grown in leaps and bounds since I last saw her."
    },
    "break back": {
        "idiom_name": "break back    Meaning : overpower, get through the hardest part of something, to put a lot of efforts into doing something.   Example : He is very talented and should refuse to  break your back  working for him for a salary of $200 a month.",
        "idiom_meaning": "think outside the box ❯  ❮ bread and butter",
        "idiom_examples": "(adsbygoogle = window.adsbygoogle || []).push({});"
    },
    "turn aside": {
        "idiom_name": "turn aside",
        "idiom_meaning": "refuse entry to somewhere\n cause someone or something to deviate in the direction\n direct, avert or deflect someone or something on another course\n veer or move away\n avoid someone or something\n change position",
        "idiom_examples": "His job application was turned aside when they saw his criminal record.\n The most crucial questions were turned aside by the current CEO.\n The prosecutor produced new evidence in the case, but the judge turned it aside .\n I saw my ex-boyfriend yesterday, but before I could say anything, he just nodded then turned aside and walked around the corner.\n Susan and her friends tried to get into the new night club on the High Street last week, but they were turned aside at the door.\n She turned her career aside for a few years to have her family, but now she’s ready to get back to work.\n We noted her inability to say no. It just isn’t in her nature to turn aside a chance to be useful.\n They will turn their ears away from the truth and turn aside to myths.\n Moses turned aside and God spoke out of the burning bush.\n Innocence and intelligence deserve to turn aside our condemnation."
    },
    "under the weather": {
        "idiom_name": "to feel  under the weather",
        "idiom_meaning": "to be ill or feel ill\n drunk or intoxicated\n having hangover\n feeling sick",
        "idiom_examples": "I did not go to work today, as I was feeling a bit under the weather .\n Sheena was feeling a bit under the weather , so she decided not to go to the movie with her friends.\n I have my final exam today, but I am feeling under the weather . I don’t know how I will fare.\n After the rigours of trekking in the mountains, he was feeling under the weather the next day.\n She has just returned from her vacation, but is feeling under the weather and has a sore throat and running nose.\n We had a heavy lunch today, and now I am feeling a bit under the weather .\n Though he was under the weather , the star player decided to take some medications and play the match as it was an important one for his team.\n He wanted to hang out with his friends for a bit, but since he was under the weather , he went home.\n I was with friends last night in a party and now I am under the weather ."
    },
    "cold sweat": {
        "idiom_name": "cold sweat",
        "idiom_meaning": "the condition where extreme fear or nervousness\ncauses a person to feel a chill along with moist skin or sweat\n a situation when a person is extremely afraid,\nnervous or anxious\n sweating caused by nervousness, fear or sickness",
        "idiom_examples": "I woke up from a nightmare, breathing heavy and in cold sweat .\n The hostages were in a cold sweat as they saw the hijacker pointing a gun on the air-hostess.\n Just thinking about the whole situation makes me break out in a cold sweat .\n She broke out in a cold sweat as she read the last warning notice from the bank about the loan repayment.\n Every member of the dysfunctional family was in cold sweat as the lawyer opened the father’s will."
    },
    "all hell will let loose": {
        "idiom_name": "all hell will let loose",
        "idiom_meaning": "a situation suddenly becomes noisy and violent, usually with a lot of people arguing or fighting\n describes and outlines what usually happens when destructive and violent events occur\n there are high chances that the situation at hand will lead to uproar and confusion among the parties involved\n could at times act as a threat to inform someone of the repercussions that would follow depending on the situation\n represents an event that turns out to be uncontrollable and noisy as a result of aggressive fighting or quarrelling\n uproar and confusion",
        "idiom_examples": "All hell will let loose when the caged animals break out of their cages.\n Regardless of the calmness in the bar, all hell will let loose if a fight between drunkards begins.\n Do not deny the mob their rights, or else all hell will let loose .\n In a physical confrontation, the first reaction is what decides whether or not all hell will let loose .\n Please don’t take her into the party fold, or all hell will let loose .\n This big guy walked up to the bar and hit Freddie, and suddenly all hell broke loose ."
    },
    "variety is the spice of life": {
        "idiom_name": "variety is the spice of life",
        "idiom_meaning": "new and exciting practices make life more attractive\n one should attempt lots of different types of experiences because trying different things maintains life exciting\n life is more fascinating when it changes repeatedly and you have many diverse incidents",
        "idiom_examples": "I started learning tennis after having tried swimming because variety is the spice of life .\n She loves trying different sports every year as she knows variety is the spice of life .\n James keeps exploring different countries every year. He says variety is the spice of life .\n Aren’t you bored of visiting the same restaurant every weekend? You should know that variety is the spice of life .\n One should learn different things for having different experiences as variety is the spice of life that keeps one moving.\n It is not his fault to keep changing his profession every five years. The belief that variety is the spice of life is in his blood.\n This generation believes that variety is the spice of life ; that is why they keep changing their interests."
    },
    "a smooth sea never made a skilled sailor": {
        "idiom_name": "a smooth sea never\nmade a skilled sailor",
        "idiom_meaning": "a proverb that means easy situations can never\nimprove you or make you better\n the harsh conditions of life make a person\ntougher and more capable\n challenging experiences often give the best lessons\nof life",
        "idiom_examples": "You are just cutting days in the comfort of your home and spending your parents’ money. You need to really get out and face the actual life. Remember, a smooth sea has never made a skilled sailor .\n “You’re just bragging of your life being so smooth and all. Maybe you’re forgetting that smooth seas never make a skilled sailor .”\n “I know you are going through a divorce and are having a pretty hard time making ends meet for you and your son. But then, you’re only getting stronger. Rough seas make great sailors after all!"
    },
    "rest in peace rip": {
        "idiom_name": "rest in peace  (  RIP  )",
        "idiom_meaning": "respect, sympathy and well wishes for a deceased person\n often said after the death of someone or something\n wishing the dead will find eternal peace in heaven",
        "idiom_examples": "He was a kind, caring and well-loved family man. May he rest in peace .\n It was dreadfully sudden in the end, and I hope she rests in peace .\n The epitaph says ‘Here lies Frank James Skinner, Loving son, brother, husband and father, may he rest in peace .\n Following the murder trial and the media circus in the aftermath, the victim’s family begged that she be allowed to rest in peace .\n The war was over, and the fallen should now be allowed to rest in peace ."
    },
    "come to blows": {
        "idiom_name": "come to blows",
        "idiom_meaning": "to start fighting\n to get into a fight or a serious argument with someone\n used to refer to the beginning of a fight between two groups or parties",
        "idiom_examples": "Example Sentences"
    },
    "armed to the teeth": {
        "idiom_name": "armed to the teeth",
        "idiom_meaning": "heavily and formidably armed, usually with deadly weapons\n fully prepared or equipped (with weapons, arguments and so on).\n carrying many weapons\n to be armed with ammunition strongly for some kind of war or battle\n When you are well organized for entering into a new project, being financially strong to invest in some business\n When someone is physically and mentally prepared to compete with others in any field of life",
        "idiom_examples": "The alleged tax-defaulter was ready for all their questions, and armed to the teeth with proof of his innocence.\n It was dangerous to chase the robbers. They were armed to the teeth and looked merciless.\n The minister came armed to the teeth for his first press meet after being elected and answered all the question easily.\n It’s not advisable to go there now. There is a turf war going on between two gangs and they are armed to the teeth .\n Since he had decided to argue his own case, he was armed to the teeth to prove his innocence in front of the court.\n They are a very formidable team, having excellent players in all positions. You can say they are armed to the teeth .\n The army was armed to the teeth and ready to defend their positions against any form of attack.\n Having once been embarrassed in front of his clients, he came armed to the teeth for his next presentation.\n Both the rival forces were armed to the teeth for a do or die purpose.\n For the annual debate competition, I am armed to the teeth and quite confident that I will win.\n To invest in the luxurious housing scheme of the city, one should be armed to the teeth .\n To become a commercial pilot one should be armed to the teeth as it requires a lot of investment.\n Both the wrestlers were armed to the teeth to win the royal rumble against each other."
    },
    "spend a fortune": {
        "idiom_name": "spend a fortune",
        "idiom_meaning": "spend a small fortune\n pay a fortune\n cost a fortune\n cost a small fortune",
        "idiom_examples": "a great amount of money\n to spend a lot on something\n to give a lot of money\n something extremely expensive\n anything which has a high price\n cost an arm and a leg"
    },
    "know on which side bread is buttered": {
        "idiom_name": "know on which side one’s bread is buttered , also,  know what side one’s bread is buttered on",
        "idiom_meaning": "know what is to one’s advantage\n to be aware of where your interests lie and who you should support to achieve something greater\n to know who is helpful to you and how you should act to get what you want\n to also understand what benefits you and who you should put your energy behind to get those benefits or advantages",
        "idiom_examples": "She’s far too clever to irritate her employer as she knows which side her bread is buttered on.\n John gave his boss a gift last week because he knows which side his bread is buttered .\n Jenny supported a different political candidate because she knows which side her bread is buttered .\n Since Amy knows which side her bread is buttered on , she’s always so nice to customers.\n “The trouble with you, John, is you don’t know on which side your bread is buttered .”\n My daddy is going to make sure I know what side my bread is buttered on .\n I know which side my bread is buttered on , so I truly value my mom’s support."
    },
    "get on nerves": {
        "idiom_name": "get on nerves",
        "idiom_meaning": "tick someone off\n being annoying for someone\n to become unbearable for someone\n to irritate someone to a great extent\n to bother and distract someone during work\n rub up the wrong way",
        "idiom_examples": "Put your mobile phone in a silent mode – its loud ringtone is getting on my nerves .\n Stop laughing! You are getting on my nerves .\n Tom’s idea to go swimming on the dirty beach was pathetic. He is getting on my nerves .\n It used to get on my nerves when I saw someone sleeping during the working hours.\n Whenever I go to study my younger sister starts getting on my nerves by crying so loud.\n I saw your best friend usually gets on your nerves , but you never resist her."
    },
    "wide berth": {
        "idiom_name": "a  wide berth",
        "idiom_meaning": "avoid (a person, place, or circumstance )\n stay away from\n keep away from somebody\n sizeable allotment\n mitigate collision",
        "idiom_examples": "When walking through the yard, make sure you leave a wide berth for the dog, or he may bite you.\n Go ahead and back your truck into this spot; there’s a wide berth available.\n After throwing the toy at his little sister, Joey gave her a wide berth for the remainder of the evening to avoid retaliation.\n Keep a wide berth between any liquids and electronics; you never want them to come into contact.\n As introverted of a person as Jude is, he always makes sure to give a wide berth to those he walks past.\n He has fallen out with her adviser and has been giving her a wide berth for a couple of months."
    },
    "birds of a feather": {
        "idiom_name": "birds of a feather , also,   birds of a feather flock together",
        "idiom_meaning": "people with similar tastes, interests, and backgrounds\n people with the same characteristics\n people who relate to others and feel safe around them.\n people with a shared interest\n people with shared values",
        "idiom_examples": "Ethan saw Jason had the same type of car and shrugged, “ Birds of a feather .”\n Kara and Carly laughed when they saw each other wearing the same outfit and said, “ Birds of a feather .”\n “Erica, you and I are birds of a feather,” said Tammy.\n According to the surprising finding of the report, there is no guarantee that people who are birds of a feather will prove to be good life partners."
    },
    "zero tolerance": {
        "idiom_name": "zero tolerance",
        "idiom_meaning": "denial to allow rebellious activities, usually by rigid and strict application of the rules;\n to have prescribed and strict punishments for specific behaviour which will not even take justifying circumstances into consideration, usually used as a policy.",
        "idiom_examples": "There is zero tolerance towards any gender bias in this company.\n I have a zero tolerance policy towards people that are dishonest with their work.\n This organisation has zero tolerance for any cases that include a charge of bribery.\n I wish there was zero tolerance for crimes committed against women.\n We live in a liberal society so speaking of zero tolerance towards everything just cannot work out.\n “You are in school and there is zero tolerance for such stubborn behaviour here” – this is what the teacher told him before taking him to the principal’s office.\n There is zero tolerance for littering in the society that I live in. That is how we maintain a clean premises.\n He holds the highest office in the country, how can he have zero tolerance for so many different cultures?\n You should not have zero tolerance for such things when you know that you have to move to that country eventually. Learn to embrace life how they live."
    },
    "does exactly what it says on the tin": {
        "idiom_name": "does exactly what it says on the tin",
        "idiom_meaning": "someone or something is exactly as they seem\n no hidden agenda or aim\n the item works as per the instructions\n someone or something does what they are supposed to do",
        "idiom_examples": "This medicine does exactly what it says on the tin , because I feel so much better.\n Have you tried the new wood paint from Ronseal? It does exactly what it says on the tin .\n The guy did exactly what it said on the tin . He was the right man for the job."
    },
    "happy go lucky": {
        "idiom_name": "happy go lucky",
        "idiom_meaning": "cheerful\n always in a pleasant mood\n goes with the flow\n a positive outlook on life at all times\n worry-free\n accepts life as it comes",
        "idiom_examples": "Even though it was storming outside, he kept his sunny disposition since he was happy-go-lucky .\n She’s so happy-go-lucky ; even the worst events don’t affect her.\n When you’re happy-go-lucky , it’s tough not to be upbeat, even in the worse circumstances.\n Those without happy go lucky dispositions run the risk of being depressed their whole lives.\n He couldn’t share his friend’s happy-go-lucky attitude.\n Despite being angry, his girlfriend’s happy go lucky attitude rubbed off, and he turned his day around.\n She is naturally happy-go-lucky even though it annoys her friends."
    },
    "going to hell in a handbasket": {
        "idiom_name": "going to hell in a handbasket",
        "idiom_meaning": "in extremely bad state and becoming worse\n headed for complete disaster\n deteriorating rapidly",
        "idiom_examples": "With corruption and malpractices everywhere, the political leadership seem to be going to hell in a handbasket .\n The security arrangement at the stadium was pathetic and the whole place went to hell in a handbasket as the people in charge looked on.\n The company was rapidly going to hell in a handbasket when the chairman and some top officials were accused of fraud.\n The fortunes of the club did not change with a change in management and soon they were going to hell in a handbasket .\n Many believe that if that candidate wins the elections, the country would soon be going to hell in a handbasket .\n The healthcare system in this city is going to hell in a handbasket as the people responsible are busy blaming each other.\n With mounting debt and dwindling operations, the company is going to hell in a handbasket ."
    },
    "word of mouth": {
        "idiom_name": "word of mouth",
        "idiom_meaning": "oral communication\n refers to the act of people sharing information with others\n to volunteer information about something and be willing to tell others\n spoken words used to convey information\n verbal communication between people",
        "idiom_examples": "To truly create the right buzz about this movie, we need to get the required word of mouth going in this city.\n Most of the negative information about our school appears to come from crazy stories being spread by word of mouth in the town’s social circles.\n The best marketing campaigns happen by word of mouth . Look! What did Tesla do?\n Everyone knows Doug is a bully. It spreads through word of mouth across the whole school."
    },
    "hold tongue": {
        "idiom_name": "hold tongue   also,   bite tongue",
        "idiom_meaning": "to keep quiet when one would rather speak\n used when telling people not to speak",
        "idiom_examples": "When she said that she was very hardworking I had to hold my tongue .\n I often have to hold my tongue when he tells me how good he is at football. I know that he can hardly kick.\n You better hold your tongue while we are in the museum, young man!\n You need to hold your tongue while the principal is talking during assemble today.\n I had to hold my tongue in order to keep the peace at our family gathering."
    },
    "trouble shared is trouble halved": {
        "idiom_name": "trouble shared is trouble halved",
        "idiom_meaning": "a trouble shared is a trouble halved \n a problem shared is a problem halved \n a worry shared is a worry halved",
        "idiom_examples": "the intensity of the issue can be lowered down\nby discussion\n seeking help can solve the problems faster\n talking someone reliable and trustworthy about\nour concerns can create better options for us\n a bad situation can be settled down with the\nhelp of counseling"
    },
    "bad blood": {
        "idiom_name": "bad blood , or,  ill blood",
        "idiom_meaning": "to have ill feelings towards someone\n to feel bitterness towards someone\n the feeling of hostility or ill will\n a serious feud or long-standing grudge\n the hatred between two or more people\n a feeling of resentment towards people\n feeling of hate between people because of any arguments in the past.",
        "idiom_examples": "The villagers say the arson attack may have been the result of bad blood between the two families.\n They have so much bad blood towards each other that it worries me a lot.\n Ever since their divorce, there has been a lot of bad blood between the two families.\n Please, don’t stir up any ill blood .\n There was bad blood between the two families in Romeo and Juliet.\n There was bad blood between the two ethnic groups.\n The bad blood within their family makes it hard for their kids to communicate with themselves.\n Oh! So they don’t talk to each other because they have ill blood ?"
    },
    "brownie points": {
        "idiom_name": "brownie points",
        "idiom_meaning": "Praise or appreciation, usually for a service someone has done.\n Credit for a good deed.\n Imaginary credit for doing something well.\n Earned credits towards one’s good standing.\n Good marks for credit.",
        "idiom_examples": "He picked up some brownie points with his manager by doing part of her report for her.\n By cleaning up the sidewalks, Mark earned brownie points in the eyes of the whole neighbourhood.\n I’m not going to put myself through that much trouble just to pick up a few brownie points in the office.\n Janet earned some brownie points in the PTA by volunteering to head up the next fundraising drive.\n You’re not going to get many brownie points for submitting a report like this."
    },
    "by dint of": {
        "idiom_name": "by dint of",
        "idiom_meaning": "as a result of something\n If you attain an outcome by dint of a thing, you reach it as a result of that thing.",
        "idiom_examples": "He triumphs by dint of his persistence.\n He has obtained an advisory group by dint of his threat to quit.\n I believe you know, that by dint of interrogation, I might have proved it pretty quickly.\n Sean achieved what he desired by dint of pleading and intimidation.\n Paul got what he wanted by dint of requesting and bullying."
    },
    "old school": {
        "idiom_name": "old school  (and also  old skool )",
        "idiom_meaning": "old fashioned ideas or approach compared to current trends\n traditional values and principles\n conservative beliefs\n out of date, backward or from a former era",
        "idiom_examples": "Example Sentences"
    },
    "on edge": {
        "idiom_name": "on edge",
        "idiom_meaning": "to feel\ntense or unable to relax\n to be\nirritable\n when\nsomeone is nervous\n to be at\nthe end of something",
        "idiom_examples": "irritated;\nedgy; touchy; nervous; jumpy"
    },
    "fight like cat and dog": {
        "idiom_name": "fight like cat and dog",
        "idiom_meaning": "argue jealously and violently all the time\n a situation where two people are continuously arguing or fighting with each other about a particular issue\n fighting or arguing a lot in quite a forceful and angry manner\n two conflicting parties are yet to come up with an agreement or a peaceful way of dealing with things\n violent and jealous disagreements between people who are not on good terms",
        "idiom_examples": "The married couple fought like cat and dog the entire time they were together.\n The politicians tend to fight like cat and dog during general elections.\n As young children, we used to fight like cats and dogs any time we disagreed.\n Even though we are best friends, we tend to fight like cats and dogs whenever a sensitive issue occurs.\n Although twin girls appear to be good friends outdoors, they fight like cats and dogs at home.\n The two children of our neighbour Mrs. Bectors fight like cat and dog ."
    },
    "from the bottom of my heart": {
        "idiom_name": "from the bottom of my heart",
        "idiom_meaning": "with sincere and deep feeling\n with intense feelings\n showing sincerity towards something\n expressing truthfulness to someone\n saying something genuinely\n with utmost devotion",
        "idiom_examples": "I am really happy with the new job and I mean that from the bottom of my heart .\n It was really good to have you here and I would like to thank all of you from the bottom of my heart .\n It is not easy for Nicky to take out time and come, but she still came to you and I think you should be thankful to her from the bottom of your heart .\n I am apologizing to you from the bottom of my heart , I won’t hurt you again.\n From the bottom of our hearts , we are congratulating you for your successful project.\n We all thank you from the bottom of our hearts for your priceless efforts to make us happy.\n We apologize from the bottom of our hearts for the inconvenience caused.\n Your wish will come true if you pray from the bottom of your heart .\n Tell me from the bottom of your heart , who you love the most?\n They were so thankful of our team from the bottom of their heart for the help."
    },
    "at daggers drawn": {
        "idiom_name": "at daggers drawn",
        "idiom_meaning": "almost ready to fight\n when two people are very upset with each other\n to be in a state of open hostility\n when two people do not trust each other\n to be prepared to fight someone or something (like another country)\n at odds\n in disagreement\n fighting or quarreling\n at each other’s throat\n in conflict",
        "idiom_examples": "The two schools have been at daggers drawn for months. Ever since they played in the championship game.\n John and his father have been at daggers drawn for years. Nobody knows why they are so hostile towards each other.\n The countries are at daggers drawn about the use of the canal that they share.\n The two companies are at daggers drawn over the new software that is going to revolutionize their industry.\n The two neighboring countries have several times been at daggers drawn over – extraction of the natural resources from the ocean."
    },
    "leg up": {
        "idiom_name": "leg up",
        "idiom_meaning": "give or receive assistance to achieve a goal\n give someone a helping hand or boost them on in some way\n help that puts someone at an advantage or a head start over other people\n an act of helping someone to mount a high object or horse",
        "idiom_examples": "Completing the summer study program gives pupils a leg up in the following academic year.\n Speaking three languages certainly gave Laura a leg up in the interview for the promotion.\n We had a leg-up on the competition after the celebrity endorsement of our products last month.\n I gave her a leg up over the fence, then I followed her over, and we ran down the road laughing.\n Cassy was glad that her grandmother had taught her some dressmaking skills when she was younger because now it gave her a leg-up when making party dresses for her three daughters.\n All those weekends spent fixing up old bangers with his father, has given Gabe a leg up in maintaining his first car."
    },
    "fall on deaf ears": {
        "idiom_name": "fall on deaf ears",
        "idiom_meaning": "to disregard or ignore.\n said in regard to an assertion, claim, or argument that a person has made. \n This indicates that what was said was (or will be) disregarded or not taken into account . \n often takes the form of ‘words fell on deaf ears’, or ‘words would fall on deaf ears.’\n A similar idiom, “ turn a deaf ear ,” is used to describe the listener’s act of disregarding or dismissing a claim.",
        "idiom_examples": "His protestations that the project would put the firm over budget fell on deaf ears .\n I knew that my words would fall on deaf ears since no one wanted to acknowledge the problem. \n Although she gave an impassioned argument, her words fell on deaf ears .\n Warnings that over-speeding always causes accidents and serious injuries have largely fallen on deaf ears ."
    },
    "no spring chicken": {
        "idiom_name": "no spring chicken",
        "idiom_meaning": "Someone who’s no longer young.\n Someone past adulthood.\n Who is no longer active because they’re getting old.",
        "idiom_examples": "My grandfather is no spring chicken , that’s for sure.\n He was always a wild and crazy guy when he was younger, but now he’s no spring chicken .\n She may be young, but she knows enough to not act like a spring chicken .\n The young couple is no spring chicken when it pertains to having kids.\n This man used to behave so well, but I can’t believe he just spoke so rudely. Sam is no spring chicken .\n He was a complete sweetheart when he was young, but now he’s like no spring chicken and just talks rudely to everyone."
    },
    "get ones feet wet": {
        "idiom_name": "get one’s feet wet",
        "idiom_meaning": "to begin taking part in a new activity\n to try or experience something new or risky (especially for the first time)\n to start doing something new in a simple and easy way to become familiar with it\n join something for the first time and have a whole new experience",
        "idiom_examples": "Finally, you’ve decided to get your feet wet and enrolled in your singing classes.\n The hardest part of the skydiving experience was getting our feet wet ; after that, everything was okay and easy.\n Snorkeling is the easiest and wisest way to get your feet wet before learning how to dive or scuba dive in the deep sea.\n Investing in small amounts is an easy way to get your feet wet in the stock market.\n Learning idioms is an easy way to get your feet wet in the quest to become a perfect English speaker."
    },
    "been around": {
        "idiom_name": "(has/have/had)  been around",
        "idiom_meaning": "(existed) been present and active.\n to have gained worldly experience.\n to have seen or experienced several things in one’s life.\n to describe life experiences.\n to denote that one is not easily fooled .",
        "idiom_examples": "This is not a new viral video; it’s been around for a couple of years.\n They have been around long enough to see a few things.\n If John had been around , he would not have allowed the loading of the ship due to bad weather .\n You can’t fool someone that has been around since the 60s.\n I have been around long enough to learn a few valuable lessons.\n There is nothing new about laptops; they’ve been around for years.\n I have been around the block a few times."
    },
    "silver spoon": {
        "idiom_name": "silver spoon",
        "idiom_meaning": "having a rich or privileged background\n someone born in a wealthy family\n to be fortunate",
        "idiom_examples": "Examples in Sentences"
    },
    "to the nines": {
        "idiom_name": "dressed  to the nines   also, *  up to the nines",
        "idiom_meaning": "to perfection\n looking elegant, smart, or flashy\n to a high degree\n to a great extent",
        "idiom_examples": "The masked ball was excellent. You should have seen the costumes. Everyone was dressed to the nines .\n Go out and buy yourself a new outfit for Friday night. Everyone will be dressed to the nines , so we’d better look smart.\n They were all done up to the nines , and there I was in my mother’s old ball gown.\n Stella hated getting all done up to the nines . She was much happier in jeans and a jogging top.\n They were dolled up to the nines , and all heads turned as they walked in.\n Xiaomi gets up to the nines with Redmi smartphones.\n In our town, everybody decorates their house to the nines on the eve of Christmas.\n After the divorce, she was grieving and stressed to the nines .\n The rooms are outfitted to the nines with floor-to-ceiling.\n The boats were decorated to the nines , coast along the beach."
    },
    "buffer zone": {
        "idiom_name": "buffer zone",
        "idiom_meaning": "neutral zone between two or more areas\n the adjoining places of the affected area\n an area chosen for conservation\n a tract of land between hostile forces\n zone separating opposing or conflicting nations\n park or green belt between built-up or over-crowded areas\n no man’s land",
        "idiom_examples": "The council proposed to plant some parkland as a buffer zone between the industrial estate and the new housing project.\n The military quickly lay down a three-mile buffer zone between themselves and the enemy forces.\n The teacher always sat at least two children between her worst trouble-makers as a buffer zone to keep the peace.\n There’s a 50-meter buffer zone with a 24-hour guard on duty, around the prison as an added deterrent to anyone thinking of escape.\n The football club put a buffer zone in the stands to separate rival fans before the match.\n The town planning was informed that the buffer zone was to be maintained.\n North Korean authorities had issued shoot-to-kill orders to prevent the Coronavirus, entering from China, creating a “ buffer zone ” at the border.\n The authority must create a buffer zone between rivers and factories to avoid water pollution.\n If it requires a buffer zone to keep the peace, then let’s keep the peace.\n The lovely landscaping includes a wide sidewalk winding past a natural buffer zone with trees, grasses, and wild plants."
    },
    "upset the apple cart": {
        "idiom_name": "upset the applecart",
        "idiom_meaning": "spoil or disrupt a plan or arrangement\n disprove a theory",
        "idiom_examples": "We had planned to hold a get-together in the evening, but bad weather upset the applecart. \n Look, please don’t upset the applecart , just go to supplier and ask to replace this damaged part of our customized car project.\n The five members of that group wanted to go for a trip to Himalayas, but Jone, the sixth member upset the applecart by denying to go.\n Sarah, really don’t want to upset the applecart by asking you to change the timing of the party, but she is really helpless.\n Hey, Jeff are you nuts? You always upset the apple-cart and never agreed with anybody in the class.\n Matt was so excited about his marriage function, he arranged everything in party so well but the bad weather and heavy rain upset the apple cart .\n There is only one person right here, sitting between us who only can upset the applecart and you all know whom I am talking about."
    },
    "ahead of the curve": {
        "idiom_name": "ahead of the curve  also,  behind the curve  (negative form)",
        "idiom_meaning": "better than others\n ahead of current trends or thinking\n in front of others with a new idea\n ground-breaking in innovation\n to be more innovative or advanced than others",
        "idiom_examples": "His ideas are so innovative, he is way ahead of the curve . He might end up running the company at this rate.\n He sold his shares in Nokia and put it into Apple, because he realised they were ahead of the curve .\n She is so ahead of the curve with her dress sense.\n The gym was brand new and way ahead of the curve with the latest equipment and techniques.\n The United States of America is way ahead of the curve in the invention of new technologies.\n To be a pollution free country, the Bhutan is ahead of the curve ."
    },
    "veg out": {
        "idiom_name": "veg out",
        "idiom_meaning": "to stop working hard\n to take things slow and easy\n to relax and have all worries out of one’s mind\n to participate in activities that are relaxing in nature and helps one rejuvenate",
        "idiom_examples": "After a tiring week, I like to veg out in front of the television during the weekend.\n My grandfather had decided to work hard until he turned 50 and then veg out and enjoy life.\n She just wants to veg out after coming back from school.\n I like to veg out every now and then. It is the only way that I can maintain my cool at such a stressful job.\n It is important for a person to be attentive at meetings. Vegging out is for after work hours."
    },
    "jump on the bandwagon": {
        "idiom_name": "jump on the bandwagon",
        "idiom_meaning": "get on the bandwagon \n climb on the bandwagon",
        "idiom_examples": "to start doing something because it is fashionable or profitable\n the act of joining others in support of something that is likely to be successful\n aligning yourself with something that is fashionable\n to join a cause or movement as it grows in popularity"
    },
    "every nook and cranny": {
        "idiom_name": "every nook and cranny",
        "idiom_meaning": "to look for something everywhere\n to search in every place\n to search within the smallest parts also",
        "idiom_examples": "The lawyers searched every nook and cranny to find more evidence but alas, there was none.\n My mother usually ends up searching every nook and cranny to find her keys and almost always finds it in her purse.\n The divers searched every nook and cranny of the river bed but could not find his body.\n I have been searching for the text book in every nook and cranny of the market but have not been able to find it yet.\n Their search for the perfect groom went on to every nook and cranny before they finally found a suitable match for their daughter.\n My toddler gets into every nook and cranny of the house and finds something that she can break each time."
    },
    "way forward": {
        "idiom_name": "way forward",
        "idiom_meaning": "the only\nway to succeed\n something\nthat would be a positive influence on your life\n an action\nplan that is devised to lead to a successful outcome",
        "idiom_examples": "I believe that digital learning is the way forward .\n This new computer program is the way forward if we want to save our company.\n An exercise plan would be the best way forward for our family if we want to lose weight.\n I truly believe that a new job is the way forward for me.\n My boss has called a meeting so that we can decide what the best way forward would be."
    },
    "play cat and mouse": {
        "idiom_name": "play cat and mouse  (game)",
        "idiom_meaning": "to play with or tease someone\n trifle or toy with someone\n to confuse someone\n used to define the suspenseful relationship between one being chased and the chaser\n to try to defeat someone by misleading that person into making a mistake so that you have a benefit over them\n a contrived act involving continuous pursuit, near captures, and repeated escapes\n a contest or challenge in which members try to confuse or cheat each other in a cruel or teasing way, especially before the last act of brutality or cruelty\n (literally) a game in which kids stand in a circle and raise their arms to let one player into the middle. Then, they lower their arms to keep out a second player, who is chasing the first",
        "idiom_examples": "The cops do not like playing cat and mouse games with the culprits before catching them.\n The lawyers are playing a deliberate game of cat and mouse to reach sentencing.\n Watch carefully, they are playing cat and mouse game .\n It’s just the newest trap in the everlasting cat and mouse game between the guards and thieves.\n Don’t play cat and mouse with the innocent child.\n It feels like we’re in a constant cat and mouse game .\n I know that he has been playing cat and mouse with the cops for months."
    },
    "far fetched": {
        "idiom_name": "far-fetched",
        "idiom_meaning": "unlikely to be true\n totally bizarre\n to considered false or untrue\n to be remotely or slightly connected to something",
        "idiom_examples": "When he told us the stories of his youth, everyone could agree that they were far-fetched .\n Her account of the fight seems far-fetched .\n Linda has a very active imagination and that is why all her stories seem a bit far-fetched .\n The girl walked away in disgust after listening to his far-fetched tales of all his love conquests.\n Most people tell far-fetched stories just to inflate their ego and to feel important.\n I don’t know why people don’t just tell the truth rather than telling far-fetched stories.\n The sailor held everyone captive with far-fetched tales of his adventures at sea."
    },
    "red zone": {
        "idiom_name": "red zone",
        "idiom_meaning": "any geographical area that is thought to be dangerous or threatening, usually as a consequence of political or military activity.\n a level on a gauge or other measuring device that indicates danger. For example, air tanks contain a gauge that indicates when the pressure has reached a dangerous level.\n in American football, when a team gets the ball within twenty yards of the goal line, they are said to be in “the red zone ,” since they have a higher likelihood of scoring.",
        "idiom_examples": "The alley behind the schoolyard is effectively a “ red zone ,” since that is where all of the bullies hang out.\n Something is wrong with my pressure washer; the gauge indicates that it is operating within the red zone .\n Although they were able to get into the red zone , the team failed to score a touchdown."
    },
    "make a mountain out of a molehill": {
        "idiom_name": "make a mountain out of a molehill",
        "idiom_meaning": "magnifying the content\n exaggerated conversations\n elaborating something in a very dramatic way\n conveying something in a very different way by overemphasizing it\n making big issues on a very small thing\n make a fuss\n make a big deal out of something\n make too much of something\n make a song and dance about\n exaggerate or overstake",
        "idiom_examples": "You are just making a mountain out of a molehill , you just gave a wrong answer, it doesn’t mean you’re not going to qualify to the second round.\n Don’t worry, it is just a small in jury, you don’t have to make a mountain out of a molehill .\n Rida just asked you to lower down your pitch. It was nothing to make a mountain out of a molehill .\n You were not supposed to believe Mack – he is always making mountains out of a molehill ."
    },
    "the devil is beating his wife": {
        "idiom_name": "the devil is beating his wife  also known as  sunshower  or  sun shower",
        "idiom_meaning": "raining whereas the sun is shining.\n when the sun is shining yet it’s raining.\n when it’s raining but the sun is shining at the same time.",
        "idiom_examples": "The sunshower is said to occur when the devil is beating his wife in various German-speaking countries.\n Today, the devil is beating his wife in our city—it’s raining cats and dogs and the sun is also shining.\n Yesterday, I witnessed a very rare occurrence known as “ the devil is beating his wife .”\n People in the Southern United States usually come across a weird natural phenomenon called “ the devil is beating his wife .”\n Everybody laughed when a kid asked her mom, “Mamma, I want to see how the devil is beating his wife .”"
    },
    "the brains behind": {
        "idiom_name": "the brains behinds",
        "idiom_meaning": "used to refer to the person who originally invented a particular scheme, plan or idea\n be the person who plans and organizes something, especially something successful",
        "idiom_examples": "Example Sentences"
    },
    "lose touch": {
        "idiom_name": "lose touch",
        "idiom_meaning": "fail to keep in contact\n to be unable to communicate\n lose the ability to do something as well as before\n no longer able to handle something\n lose the talent or skill in something",
        "idiom_examples": "Michelle was my best friend at the university. But over the years we’ve lost touch .\n Don’t ever lose touch you always be my best friends.\n The plane was flying above the Atlantic ocean when it lost touch .\n He was once a great player, but with age, he has lost his touch .\n She seems to have lost her touch managing children; they don’t listen to her anymore.\n I can no longer sing like that. I’ve lost my touch since I had an infection years back.\n Its good to see that even after all these years, the performer has not lost his touch .\n You may have the talent, but if you do not practice enough, you will lose your touch someday.\n He used to be an outstanding orator, but he has lost his touch following his illness.\n That was a great performance. You have not lost your touch at all.\n The star player said he wanted to retire at the top of his game, before he lost his touch ."
    },
    "stand your ground": {
        "idiom_name": "stand one’s ground  also,  hold one’s ground",
        "idiom_meaning": "not retreat\n stay where you are when threatened\n refuse to change your mind/opinion\n to not to withdraw\n relating to self-defence law (in the US)\n a law or legal principle that permits a person to use fatal force in self-protection without first trying to retreat.",
        "idiom_examples": "We stood our ground on the footpath, and then eventually, all the cows moved away.\n Moira’s son wanted her to move in with him after her husband died, but she held her ground and stayed where she was.\n The council wanted to widen the road, but the shop owners stood their ground , and they won in the end.\n The school bully came up to George and threatened him, but he held his ground even though he was petrified.\n Stand your ground and do not surrender on values or sovereignty.\n Humans need to stand their ground against Covid-19.\n If you see a bear coming towards you in Jungle, stop and hold your ground .\n Be receptive but also stand your ground – if you appear weak the other side will likely use this to their advantage.\n If people can intimidate you, they will. You’ve just got to stand your ground .\n The next time you answer a question in class, don’t be afraid to stand your ground , but stay calm and be willing to face opposition."
    },
    "clarion call": {
        "idiom_name": "clarion call  also,  clarion’s call",
        "idiom_meaning": "A clarion is a high-pitch bugle.\n A strong and clear request for people to do something.\n In a literal sense, the call to battle is issued by such an instrument. \n Used in the figurative sense, a call to take up a task or pursue a project.\n The idiom metaphorically ascribes the characteristics of a bugle to a spoken command or statement, indicating that it was issued loudly and clearly. \n A statement, command, or other assertion that is unambiguous in its meaning and application.",
        "idiom_examples": "All of the citizens heard the clarion call and prepared themselves to defend their city. \n None of the board members could ignore the clarion-call of the chairman’s directive. \n When I heard that my mother had decided not to go to the party, I issued a clarion call to my brothers and sisters; subsequently, they convinced her to attend.\n The clarion call for additional donations from social leaders has elicited a swift reaction."
    },
    "class act": {
        "idiom_name": "class act",
        "idiom_meaning": "high-quality performance or display; additionally, the performer\n one who possesses a high degree of skill, ability, or style.\n high-quality performance or action.\n an exemplary method of doing any given task .\n (Sarcasm) Insisting that a person is overzealously performing an action.",
        "idiom_examples": "LeBron James has truly been a class act in basketball long before he entered the NBA.\n Teresa received a well-deserved promotion after exhibiting class act knowledge of the industry.\n The film drama show hailed as a class act failed to become a great hit.\n (Sarcasm) “The new guy is a real class act . We’ll see how long he can keep it up.”"
    },
    "bulls eye": {
        "idiom_name": "hit the  bull’s eye",
        "idiom_meaning": "the center of a target\n when an outcome is the best one possible\n to be on point\n to hit the center of a target successfully\n get something exactly right, or be on target",
        "idiom_examples": "It can’t hurt to go right for the bull’s eye – there’s nothing wrong with getting things right the first time.\n The governor hit the bull’s eye with his most recent speech.\n The finance minister’s speech on attracting new investments hit the bull’s eye .\n John often seemed to hit the bull’s eye when it came to predictions.\n She hit a bull’s eye in the dart competition. ( literal example )"
    },
    "break the news": {
        "idiom_name": "break the news",
        "idiom_meaning": "to make something known to everybody.\n to tell someone the bad news.\n to inform someone of new, important information.\n to disclose new information publicly.",
        "idiom_examples": "We are going to have to break the news to the kids that the concert has been cancelled.\n I can’t wait to break the news to my family that I am having a baby!\n They just broke the news online that there was a mass shooting in Oregon.\n It was very hard to break the news of that catastrophic accident to the families of the victims."
    },
    "as a result": {
        "idiom_name": "as a result",
        "idiom_meaning": "the outcome of something that you have done.\n a result of anything that is willingly done by you\n the consequence of your own deed\n because of the occurrence of something\n it is the indication of the effect due to a cause\n consequently\n accordingly\n thus\n so\n therefore",
        "idiom_examples": "As a result of this mishap, he was not on work for a week.\n David twisted his arms and, as a result , he won’t be taking part in the basketball tournament.\n Tom died as a result of an accident.\n Several houses were shattered as a result of the heavy storm.\n Jackson misbehaved with his boss; as a result , he lost the job.\n He took too many loans and as a result , he went bankrupt.\n Many local citizens died as a result of a bomb blast.\n Lots of fishes and other sea creatures had died as a result of the crude oil spilling."
    },
    "call on": {
        "idiom_name": "call on",
        "idiom_meaning": "use courage, reserve, nerve or strength to achieve something\n to visit someone for a short while\n ask someone to do something (officially)\n make an urgent request for somebody to do something\n ask someone in a group to speak",
        "idiom_examples": "He had to call on all his strength to get to the finals.\n We go past my sister’s house on the way home so let’s call on her.\n My neighbour is always handy if I need to call on her.\n Harry was called on to make a quick announcement at the meeting.\n The head of the church has called on the disgraced politician to resign.\n You can call on me if you need help with the garden.\n The manager called on all the staff to be mindful of the new budget restrictions.\n My maths teacher called on me for the answer, but I wasn’t listening and got in trouble.\n Catherine needed to call on all her courage to stand up to the office bully.\n The government is calling on our allies to reach an agreement."
    },
    "upper hand": {
        "idiom_name": "upper hand",
        "idiom_meaning": "to have the authority to make decisions over someone or something\n to have a dominant position or an unfair advantage",
        "idiom_examples": "advantage\n control\n ascendancy\n edge\n initiative"
    },
    "spare someones blushes": {
        "idiom_name": "spare someone’s blushes , also,  save someone’s blushes",
        "idiom_meaning": "to stop someone from feeling awkward or embarrassed.\n to stop someone from being humiliated by a situation or circumstance .\n to stop someone from saying or doing something embarrassing.\n to help someone avoid feeling awkward about doing or saying something uncomfortable.\n saving someone from doing something cringeworthy.\n to do something to prevent somebody from being uncomfortable.",
        "idiom_examples": "My teacher spoke up to spare the blushes of the new student.\n LeBron James dunked as time ran out to win the game and spare the blushes of the Los Angeles Lakers.\n John’s big brother saved his blushes by catching him when he fell out of the tree.\n Stacy decided not to sing so she could spare the blushes of her sister.\n Eric tried to spare his blushes after falling over the skateboard in the hallway.\n Cristiano Ronaldo saved the team’s blushes by scoring the only century in the test series.\n I’ll spare my blushes by not going into detail but the food wasn’t good.\n A lack of rehearsal time gave me ample excuses to spare my blushes ."
    },
    "bundle up": {
        "idiom_name": "bundle up",
        "idiom_meaning": "to dress warmly to protect oneself from the elements\n to wrap something tightly\n wrap up\n tie together\n dress affectionately",
        "idiom_examples": "It is important to bundle up before you go out to keep from getting cold.\n You need to bundle up the children before they go and play in the snow.\n Even though I am in college, my mother still tells me to bundle up when I am going out. She still sees me as a child.\n I bundled Andy up before allowing him to go outside. They are expecting freezing temperatures tonight.\n I will bundle up all of my clothes and place it in the hamper to get washed.\n I bundled up all of his belongings before packing it. I hope that nothing breaks on the way to the new house.\n Would you please bundle up all of the projects and put them on my desk before you leave?"
    }
}