{
    "ballpark figure": {
        "idiom_name": "ballpark figure",
        "idiom_meaning": "to be near about the exact (usually in amount); an estimate of what the actual figure will be like;",
        "idiom_examples": "The management was given a ballpark figure at the very beginning of the presentation. She manages to give her father a ballpark amount that she would need every week. I have donated this ballpark figure to the children’s aid this morning. Even a ballpark figure to this number is going to hurt our overall numbers very badly this quarter. I save a ballpark figure of 20% from my salary every month as something for the rainy day."
    },
    "a house divided against itself cannot stand": {
        "idiom_name": "a house divided against itself cannot stand",
        "idiom_meaning": "things will work out when there is unity amongst those people that are involved in the task; success comes from sticking together; there is a disintegration of a group, organization, or house, whose members do not agree with each other;",
        "idiom_examples": "The workers will need to form a union because a house divided against itself cannot stand . All the aggrieved parties will file a law suit together since a house divided against itself cannot stand . It is best to go to the principal together since a house divided against itself cannot stand . A house divided against itself cannot stand when talking about adventure sports."
    },
    "get act together": {
        "idiom_name": "get act together",
        "idiom_meaning": "get organized and on schedule; organize yourself so that you do things in an effective way; become more organized and efficient; work in a better way, with clear goals and plans; be more serious, efficient, worthwhile;",
        "idiom_examples": "The official was asked to get his act together if he wanted to keep his post. With just two months left for his exams, he said he should be getting his act together if he wanted to do well. He had been playing poorly all season, so the coach warned him that he should get his act together if wanted to keep his place in the team. His work is getting poorer and is full of mistakes. If he does not get his act together soon, he will risk losing his job. His new boss has given him one month to get his act together , or he loses his job."
    },
    "break new ground": {
        "idiom_name": "break new ground",
        "idiom_meaning": "to do something innovative; pioneer; discover; invent; make progress ;",
        "idiom_examples": "Advancements in computer technology break new ground almost every day.  George Washington Carver would ironically break new ground by pioneering the practice of crop rotation.  Just by waking up today and being present, you are actively breaking new ground .  Albert Einstein’s Relativity, paired with Sir Isaac Newton’s Principia, broke new ground , paving the way for physics as we know it today. It is an interesting discovery in the energy conservation field in the United States that definitely breaks new ground in the country’s energy program."
    },
    "bury head in the sand": {
        "idiom_name": "bury head in the sand",
        "idiom_meaning": "hide from the truth; intentional naivety ; to play dumb; to avoid circumstances ; avert shame;",
        "idiom_examples": "Finals begin in a week and if I continue to bury my head in the sand , I’ll be taking this class again next semester. The couple knew that their relationship was deteriorating, but with their heads buried in the sand , they kept dragging it along. A popular cheerleader at school let out a huge burp today during an assembly. She’ll probably bury her head in the sand for the rest of the year. When our supervisor gathered us all and asked who the last person was to scan the incoming shipment, Brad had his head buried in the sand because he knew that meant he had done something wrong. Parents and the principal claimed that ragging was being ignored and accused the warden of burying her head in the sand ."
    },
    "burn the candle at both ends": {
        "idiom_name": "burn the candle at both ends",
        "idiom_meaning": "to exhaust someone’s energies or resources by leading a hectic life; to engage in an activity, usually work-related, from early morning until late at night; to work so hard that you don’t rest; to spend all of your energy on two pursuits at the same time;",
        "idiom_examples": "Since starting my new job, I have been burning the candle at both ends . Working and studying at the same time has led to me having to burn the candle at both ends . She has been burning the candle at both ends by doing a full-time job and preparing for her International English Language Test exams. My younger daughter is obsessed with becoming a painter. That is why she is burning the candle at both ends nowadays. To finish this massive work, we must burn the candle at both ends ."
    },
    "beau monde": {
        "idiom_name": "beau monde",
        "idiom_meaning": "a fashionable society; a rich society; a class of people who are particularly wealthy and glamorous ;",
        "idiom_examples": "He had no interest in the glittering beau monde that he belonged to before his marriage. The beau monde has always been admired by the general public. A little beau monde seems to have rapidly developed over the course of the year right here in this city. Did you see that there was a seasoning named after Beau Monde ? I’ve got to get my hands on it. When she grows up, she’s going to be an icon in the beau monde ."
    },
    "upper hand": {
        "idiom_name": "upper hand",
        "idiom_meaning": "to have the authority to make decisions over someone or something; to have a dominant position or an unfair advantage;",
        "idiom_examples": "The man has an upper hand to his wife. It is reflected in the way he speaks with her. She wanted an upper hand in the business and hence went ahead to buy all the shares that she could find in the market. The prime minister has an upper hand in the decision making and not the parliament, in such cases. The upper hand is given to those who take it."
    },
    "the devil is beating his wife": {
        "idiom_name": "the devil is beating his wife",
        "idiom_meaning": "raining whereas the sun is shining; when the sun is shining yet it’s raining; when it’s raining but the sun is shining at the same time;",
        "idiom_examples": "The sunshower is said to occur when the devil is beating his wife in various German-speaking countries. Today, the devil is beating his wife in our city—it’s raining cats and dogs and the sun is also shining. Yesterday, I witnessed a very rare occurrence known as “ the devil is beating his wife .” People in the Southern United States usually come across a weird natural phenomenon called “ the devil is beating his wife .” Everybody laughed when a kid asked her mom, “Mamma, I want to see how the devil is beating his wife .”"
    },
    "bosom friend": {
        "idiom_name": "bosom friend",
        "idiom_meaning": "best friend who is very close to you; someone whom you share everything with; someone you can always rely on; close friends who share confidences; a kindred spirit;",
        "idiom_examples": "The two ladies who were arrested for injuring each other for one man were bosom friends for years. I wouldn’t call him a bosom friend , since we aren’t that close. She’s been my bosom friend since we were kids . Everyone saw them as bosom friends , so it was a surprise when they had a falling out. Anyone should be able to see their partner as their bosom friend ."
    },
    "between you and me": {
        "idiom_name": "between you and me",
        "idiom_meaning": "a secret to be kept between two people; in confidence; information to be kept strictly confidential; information not to be told to anyone else;",
        "idiom_examples": "Let me tell you something. Just between you and me , I don’t think her painting deserves the first prize. Susan, “ between you and me , Mary spent a year in an asylum because of the murder of her husband.” Joe, “ between you and me and the four walls , Jack has been on drugs since he was 16.” Nancy, “ between you and me and the gatepost , it was Alicia that proposed to Peter, not vice versa .” Jason, “ between you and me and the lamppost , there is a run happening tomorrow on pork bellies.”"
    },
    "bed of roses": {
        "idiom_name": "bed of roses",
        "idiom_meaning": "easy option; a comfortable or luxurious position; an effortless, happy situation; a luxurious circumstances; a trouble-free living;",
        "idiom_examples": "Weight loss is a challenging task, not a bed of roses . Making money is not a bed of roses ; you have to wake up early and go to work. The life of the royal family is a bed of roses . Before cutting ties with my family, my life was a bed of roses because my Mom did everything for me. My friend told me that he wants to live in a bed of roses without hard work. Winning the Jackpot made his dream come true."
    },
    "know which side ones bread is buttered": {
        "idiom_name": "know which side ones bread is buttered",
        "idiom_meaning": "to be cognizant of where one’s interests lie in a given situation; to understand the current state of things and how you might profit from it; the ability to ascertain what choice would be to your advantage; understanding of how to secure one’s own success ;",
        "idiom_examples": "He tries to come across as a neutral party, but he is very aware of which side his bread is buttered on . I know which side my bread is buttered on , so I was careful to be as polite as possible to the interviewer. If he knows which side his bread is buttered on , he won’t make a fuss during the meeting. She wanted to argue back with her boss, but she knew which side her bread was buttered on . He knew on which side his bread was buttered , but it didn’t stop him from snapping angrily at the customer."
    },
    "rain cats and dogs": {
        "idiom_name": "rain cats and dogs",
        "idiom_meaning": "too much heavy rain; torrential rain; very heavily raining; raining tremendously;",
        "idiom_examples": "It’s raining cats and dogs I am worried about how my kids will reach home. It rains cats and dogs when the Monsoon comes in India. How will you go to play Cricket today? It’s raining cats and dogs . When we were returning from the picnic, it was raining cats and dogs . I think it’s not safe to drive the car now – it’s raining cats and dogs ."
    },
    "at stake": {
        "idiom_name": "at stake",
        "idiom_meaning": "It means to be on wager or bet, when there is some sort of uncertainty; It is usually referred to money but in the current times the important aspects can all be at stake For example a person’s reputation, assets and even relationships;",
        "idiom_examples": "You needn’t have all your money at stake in the share market, it is better to diversify. She has to manage getting the contract this time since her job is at stake if she fails."
    },
    "living on borrowed time": {
        "idiom_name": "living on borrowed time",
        "idiom_meaning": "not expected to live much longer; to live after a point where it can be reasonably expected that you may have died; to remain in a situation that no one really expected you to ;",
        "idiom_examples": "He was told he only had three months left to live, so he is living on borrowed time now that it is four months later. His boss has not been happy with his performance for months. He is really living on borrowed time after this latest incident. The big Hollywood star is suffering from a serious illness and is now living on borrowed time ."
    },
    "upper crust": {
        "idiom_name": "upper crust",
        "idiom_meaning": "the aristocracy and upper classes, informal; the highest social class or group; especially the highest circle of the upper class;",
        "idiom_examples": "Reservation system was developed to help the needy. Now it has become privilege for the society therefore even the upper crust are demanding reservation these days. Many leaders brought reform in the country by giving equal rights to all citizens else it would have been a place of rule by the upper crust. Many people who belong to the upper crust consider themselves special. Perhaps they’ve forgotten each being is equal in God’s eyes despite of their status on society. Not everyone from the upper crust looks towards others as low. Many people have broken the stereotype by uplifting the poor &amp; working for their well-being. Though many countries are democratic which means equal rights for all yet it has been seen that the upper crust get added privilege in one way or the other."
    },
    "blind date": {
        "idiom_name": "blind date",
        "idiom_meaning": "to go on a date with someone you have never met before; a kind of date between people with no previous encounters, often arranged by a mutual friend ; to meet in a public place with someone that you have not been aquatinted with; a social meeting with someone you’re not familiar with; an arranged meeting for two people who have never met each other before, in order to try to start a romantic relationship ;",
        "idiom_examples": "I’m going on a blind date with a guy that Jack knows from college. Can you believe that Lily and I were set up on a blind date by her mom? I could set you on a blind date with a girl from work; you’d absolutely love her. I went on a blind date with my cousin’s roommate, Rebecca. A blind date might be just what you need to get back into the dating circle."
    },
    "get to the bottom": {
        "idiom_name": "get to the bottom",
        "idiom_meaning": "to find out the truth relating to a situation; to uncover what exactly happened; to reveal facts through investigation;",
        "idiom_examples": "The murderer will not get away with it, the news anchor said. She assured the audiences that the police will get to the bottom of it all. To get to the bottom of this, I will need to stay awake and guard the kitchen. That is perhaps the best way to find out myself of where all the cupcakes are going. It is wonderful that you are travelling so far to get to the bottom of your family history. Very few people have such zeal to know about their roots. I need to get to the bottom of this mystery or I will not be able to close the book and sleep. It is doubtful if political interference will allow the investigators to get to the bottom of the case."
    },
    "rob peter to pay paul": {
        "idiom_name": "rob peter to pay paul",
        "idiom_meaning": "to cause harm to one person in order to do good for another; the transfer of money or resources that have been set aside for one purpose to another; to solve a problem in a way that makes another problem worse; to discharge one debt only to incur another;",
        "idiom_examples": "I moved money from the college savings account to my main account so the debit would clear, robbing Peter to pay Paul . A “ rob Peter to pay Paul ” approach is not a sustainable way to handle your finances. When she borrowed money from one friend to pay her babysitter, she knew that she was robbing Peter to pay Paul . My mother told me to stop using my credit cards to pay my debts because I was just robbing Peter to pay Paul .  “This last year has been nothing but taking money from one budget to cover expenses in another,” she grumbled, “and how are we going to stay afloat if we’re just robbing Peter to pay Paul ?”"
    },
    "break a leg": {
        "idiom_name": "break a leg",
        "idiom_meaning": "good luck; best wishes; stroke of luck; to wish someone luck especially before a performance;",
        "idiom_examples": "“ Break a leg !” shouted the stage director to his actors before the beginning of the play. You have an exam tomorrow? Break a leg ! “My first stage performance is scheduled for tonight.” “Well, break a leg !” “ Break a leg !” I shouted out to him before he rushed in for his auditions. When the team went out for the final race, the coach shouted out to them “ break a leg !”"
    },
    "as bold as brass": {
        "idiom_name": "as bold as brass",
        "idiom_meaning": "daring, brave, bold or overconfident; audacious, impudent or shameless;",
        "idiom_examples": "I was nervous about approaching the recording artist, but my friend Jane went to him, as bold as brass , and requested a group photo. Alex marched to the podium, as bold as brass , and delivered our finalist class farewell speech so well. Maria approached the headmistress, as bold as brass , and told her about the kind of bullying going on in school. She gave birth to a man who was as bold as brass . Joseph was as bold as brass and didn’t know the meaning of the word shy."
    },
    "take a leaf out of someones book": {
        "idiom_name": "take a leaf out of someones book",
        "idiom_meaning": "implement actionable advice; follow an example set by another person; imitate another person; emulate; copy;",
        "idiom_examples": "I couldn’t decide what to do after high school, but my dad makes great money welding, so I took a leaf out of his book and went to trade school instead of college. Some polymers were made by studying and taking a leaf from the books of many species of ants. If you listen closely, it’s easy to realize that modern vocalists took leaves from the books of classic singers such as Frank Sinatra. You need to take a leaf out of your boss’s book and be punctual about coming to the office on time."
    },
    "wide berth": {
        "idiom_name": "wide berth",
        "idiom_meaning": "avoid (a person, place, or circumstance ); stay away from; keep away from somebody; sizeable allotment; mitigate collision;",
        "idiom_examples": "When walking through the yard, make sure you leave a wide berth for the dog, or he may bite you. Go ahead and back your truck into this spot; there’s a wide berth available. After throwing the toy at his little sister, Joey gave her a wide berth for the remainder of the evening to avoid retaliation. Keep a wide berth between any liquids and electronics; you never want them to come into contact. As introverted of a person as Jude is, he always makes sure to give a wide berth to those he walks past."
    },
    "bring someone to book": {
        "idiom_name": "bring someone to book",
        "idiom_meaning": "make somebody accountable for their conduct; to punish someone; legally punish or summon someone to account for their actions;",
        "idiom_examples": "If Jessica continues with this behavior, I will have no choice but to bring her to book . Ethan stole that boy’s bike. Bringing him to book is the only option to make him understand his actions are wrong. I will bring that man to book for the crime he has committed. Bringing Joshua to book for bullying that child on the playground is the only solution to help him understand his actions are unacceptable. It was frustrating for the victims’ kin as the police and court failed to bring anyone to book for the crime."
    },
    "buy time": {
        "idiom_name": "buy time",
        "idiom_meaning": "to do something in order to postpone an event, a result, etc; to do something in order to be allowed more time ;",
        "idiom_examples": "I am currently delivering pizza, buying time to apply for a better job. We went to the coffee shop to buy time for the engineers to complete computer maintenance in our offices. Most foreigners who live in tenements buy time to look around for comfortable apartments. Many people lie to their landlords about the late payment of rent to buy time to find another means. One of the burglars was used to distract the security guard for the gang to buy time to survey the building."
    },
    "behind bars": {
        "idiom_name": "behind bars",
        "idiom_meaning": "to be in jail or prison; to be incarcerated or imprisoned in a jail or prison; to put someone behind bars means arresting someone and putting them in jail or prison;",
        "idiom_examples": "Before the end of this year, Harrison will be behind bars for his crimes. By now, Jonathan should be behind bars for being found guilty of robbery with violence. The judge swore to put the men behind bars if they were found guilty of raping the old lady. John would still be behind bars were it not for the missing evidence. An offense such as pickpocketing was enough to see him put behind bars for more than four years."
    },
    "body and soul": {
        "idiom_name": "body and soul",
        "idiom_meaning": "with all one’s effort and ability; completely; with all of; every effort; all aspects;",
        "idiom_examples": "A great painter must put their body and soul onto the canvas. When two people become married, they are giving their body and soul to one another.  With her body and soul into her career, she quickly rose to the top. He dedicated himself to science studies and astronomy, body and soul ."
    },
    "rain check": {
        "idiom_name": "rain check",
        "idiom_meaning": "declining an offer that might be taken up later; refuse an offer politely, but imply that it can be taken up later; to guarantee that something will not be done right now but will be done later; one cannot accept an invitation but would like to do so later; to give a coupon to a customer confirming that they would be able to purchase something at a discounted price that it is being sold for right now but is out of stock;",
        "idiom_examples": "He said he would take a rain check on visiting us today. I’ll have to take a rain check on going to the movies this evening; I already have other plans. He couldn’t attend the concert with his friends. He took a rain check instead. Do you mind if I take a rain check on the team outing? I have to finish this project by tomorrow. I would have loved to come to your place, but I’ll take a rain check on that. I will be out of town during the weekend."
    },
    "hit the panic button": {
        "idiom_name": "hit the panic button",
        "idiom_meaning": "prepare for disaster; react poorly to a circumstance ; the result of being caught off-guard; to implement a haphazard plan; chaotically react;",
        "idiom_examples": "Dad’s fishing pole dove into the lake without warning, and he hit the panic button before jumping up with the reel-spinning like crazy in his hand. Our factory caught fire today and since no one was trained on how to handle it, everyone hit the panic button and ran around yelling, “Fire!” The guy who sleeps in class pressed the panic button upon realizing that we had an assignment due today.  My bedroom door opened, and as I hurried to pretend I was sleeping, my sister said, “No need to smash the panic button , it’s just me.” They have lost the last three football matches, but they’re still not pushing the panic button ."
    },
    "cant judge a book by its cover": {
        "idiom_name": "cant judge a book by its cover",
        "idiom_meaning": "outward appearance cannot be an indicator of someone or something’s value or worth; you cannot know what someone or something is like just by looking the person or thing’s appearance; the quality or character of someone or something cannot be judged just by looking at them; an opinion of someone or something cannot be formed solely by seeing what’s on the surface;",
        "idiom_examples": "The candidate did not look very intelligent, but you can’t judge a book by its cover . The hotel looked attractive from outside, but the rooms were damp and not well maintained. You can’t judge a book by its cover ! Do not form opinions of a persons character by looking at his appearance. You can’t judge a book by its cover . At first we did not want to go into the restaurant as it looked small and cramped; but the food was delicious – we realized that you can’t judge a book by its cover . The car was small and looked unsuited for a long trip, but packed a lot of power and was very solid. You can’t judge a book by its cover ."
    },
    "bad blood": {
        "idiom_name": "bad blood",
        "idiom_meaning": "to have ill feelings towards someone; to feel bitterness towards someone; the feeling of hostility or ill will; a serious feud or long-standing grudge; the hatred between two or more people;",
        "idiom_examples": "The villagers say the arson attack may have been the result of bad blood between the two families. They have so much bad blood towards each other that it worries me a lot. Ever since their divorce, there has been a lot of bad blood between the two families. Please, don’t stir up any ill blood . There was bad blood between the two families in Romeo and Juliet."
    },
    "zonk out": {
        "idiom_name": "zonk out",
        "idiom_meaning": "to fall asleep very promptly; to fall asleep, mostly because of physical tiredness or the influences of drugs or alcohol; to lose consciousness from exhaustion, or intoxication, etc;",
        "idiom_examples": "After a very hard-working day, she zonked out . Some babies get frustrated easily and tend to zonk out . It’s good to read a book when you’ve had a long day and want to zonk out . Some drinks in the evening may help you hurriedly zonk out , but they also may wake you up hours later. The neck pillows are helpful for kids to zonk out if they’re traveling or away from their bed."
    },
    "hang up": {
        "idiom_name": "hang up",
        "idiom_meaning": "to disconnect a phone call It is often used when someone does not want to continue a conversation; something that prohibits someone from making progress in a situation It is hyphenated and used as a noun; to give up on someone or something; to be obsessed with someone or something, this is used very informally; to stop doing something;",
        "idiom_examples": "If you do not stop complaining then I will hang up on you. Don’t you dare hang up until I have had a chance to ask my question! Jane has a lot of hang-ups about being an overweight child. Peter has hung-ups about not being as educated as some of his peers. We had to hang up on them as they were just not able to do the job that we needed."
    }
}