{
    "to the core": {
        "idiom_name": "to the core",
        "idiom_meaning": "totally;fully;completely;utterly;through and through;",
        "idiom_examples": "Stella’s plan was rotten to the core , it would not work in today’s world.To make him into a good citizen of the country is quite a challenging task since he is full of hatred to the core.He is a performer to the core and can give you a monologue within minutes.The news of his father’s sudden passing away shocked him to the core .She thinks everyone that is not a part of her group is irresponsible to the core ."
    },
    "coin a phrase": {
        "idiom_name": "coin a phrase",
        "idiom_meaning": "as one might say;to create or invent a new phrase, saying etc;something said before using a popular expression or before saying some variation of an expression;to ‘ironically’ express some phrase;to repeat and expression, quotation, etc;",
        "idiom_examples": "She was, to coin a phrase , as clever as fox.Sportsmen, to coin a phrase , have become spiteful competitorsNowadays our media is nothing more than, to coin a phrase , misrepresentation of actual facts.To hike and camp in the peaceful wilderness is, to coin a phrase , equivalent to getting reborn.Corrupt politicians through public displays of concern and generosity try to prove that they are, to coin a phrase , pious and innocent."
    },
    "sponger sponging sponge off": {
        "idiom_name": "sponger sponging sponge off",
        "idiom_meaning": "someone who scrounges from others;a person who abuses your generosity and goodwill;a parasite or leech living off someone else’s expense;take advantage of someone continually;sponge off means  – to unethically grab something;",
        "idiom_examples": "Josh has turned up at my house three times this week just as I’m cooking dinner. What a sponger!Not everyone who gets social welfare is a sponger or a non-contributor.Mick is always sponging cigarettes and money off me. It’s really annoying.I get angry when I see people who are perfectly able to work, sponging benefits and lounging around all day.My older sister is always sponging money off our elderly parents to pay her rent. She’s such an idiot."
    },
    "good grief": {
        "idiom_name": "good grief",
        "idiom_meaning": "occurrence of something shocking;things beyond our imaginations;being surprised;unexpected situation;moment of amazement and frustration;",
        "idiom_examples": "Good grief , is she going to kick her brother in front of the entire school? This is really shocking for me.Good grief , keep up the same work and you will end up losing your new job.Oh God, good grief we are again stuck in a traffic jam.Good grief , you are not home on time today, everyone is waiting for you.Good grief ! You are not going to the supermarket like that, are you? Don’t tell me that you are."
    },
    "in the red": {
        "idiom_name": "in the red",
        "idiom_meaning": "more money going out than coming in;spending more than you earn;owing money to the bank;in debt;negative bank balance;",
        "idiom_examples": "If your bank account goes in the red , the bank will charge you for every transaction.Louise spent way too much money last month, and now she’s in the red .Sam is rubbish with money management; that’s why he’s permanently in the red .The film was in the red from the day it hit the cinema screens. What a monumental flop!The company has been in the red for quite a while, and now they are struggling to pay staff wages and stay afloat."
    },
    "bury the hatchet": {
        "idiom_name": "bury the hatchet",
        "idiom_meaning": "to stop fighting or arguing or to end old resentments;make peace and end a quarrel, settle one’s differences to become friends again;refers to finally deciding to end an ongoing conflict and thus creating a friendly relationship;it involves making peace with someone that you were initially having disagreements and quarrels;signifies the end of an argument with someone and becoming friends again;",
        "idiom_examples": "After many quarrelling years, the two political parties finally decided to bury the hatchet .Family members and friends are always advised to bury the hatchet when they find themselves in clashing situations.Conflicting countries should work on the way to bury the hatchet in order to avoid going to war.The teammates are urged to bury the hatchet for the sake of the success of the team.The two neighboring countries India and Pakistan, have often been advised by the world bodies to bury the hatchet for their progress."
    },
    "burst the bubble": {
        "idiom_name": "burst the bubble",
        "idiom_meaning": "the sudden end of a very happy or successful period;to disapprove of someone’s beliefs about something;breaking one’s delusions and false expectations;doing or saying something to someone to show them that what they want to happen has no valid chance of happening;it could be used when there is a need to free someone from false faith or an exaggerated sense of optimism;",
        "idiom_examples": "She looked so happy about getting married that her sister just couldn’t burst the bubble .I detest being in a position to burst the bubble, but your products are of low quality.The parents did not want to burst the bubble , but the children deserved to know the truth.Listen, Jim, I hate to burst your bubble , but I saw her with someone else.The country’s economic strength was booming, and then the bubble burst with the crash of the stock market in the last decade."
    },
    "weather the storm": {
        "idiom_name": "weather the storm",
        "idiom_meaning": "handle a difficult period of time successfully;survive a serious situation without being harmed in any way;reach the end of some hardship or problem without much damage, harm or disorder;",
        "idiom_examples": "There haven’t been any tourists this year, and the hotels, campsites, and restaurants are having to weather the storm until things pick up again.During the current pandemic, everyone was riding out the storm until they found a vaccine.When John was made redundant, the family had to weather the storm until he found a new job.The disgraced politician was left to ride out the storm as he refused to resign.After all the negative press, his reputation was in tatters, but it was his own fault, so he had to weather the storm ."
    },
    "bring owls to athens": {
        "idiom_name": "bring owls to athens",
        "idiom_meaning": "something that is pointless;a useless or futile act;an unnecessary venture;something highly uneconomical;a redundant idea;",
        "idiom_examples": "The chancellor has a plan to increase taxes, thinking that this would improve the economy. It would bring owls to Athens .‘That was a really pointless waste of money, it brought owls to Athens ‘ he shouted angrily.She hated buying gifts for her wealthy friends, ‘It’s like bringing owls to Athens ‘ she laughed to herself."
    },
    "the other side of the coin": {
        "idiom_name": "the other side of the coin",
        "idiom_meaning": "the opposite aspect, contrasting arguments;to look differently at a situation;a person should look at a person, circumstance , or thing from an opposing view;there is usually more than one side to a story, situation, or matter;can also be taken figuratively and literally;",
        "idiom_examples": "You should consider the other side of the coin when a wife leaves her husband and not just blame her for walking out on him.We know that our football team has not been performing well. On the other side of the coin , we are improving with every game we play.Look, I know that there are always two points of view on a legal matter. On the other side of the coin , we should believe a person when they make an accusation against another individual in a court of law .The other side of the coin is that fewer working hours will get you a lower income."
    },
    "upper crust": {
        "idiom_name": "upper crust",
        "idiom_meaning": "the aristocracy and upper classes, informal;the highest social class or group; especially the highest circle of the upper class;",
        "idiom_examples": "Reservation system was developed to help the needy. Now it has become privilege for the society therefore even the upper crust are demanding reservation these days.Many leaders brought reform in the country by giving equal rights to all citizens else it would have been a place of rule by the upper crust.Many people who belong to the upper crust consider themselves special. Perhaps they’ve forgotten each being is equal in God’s eyes despite of their status on society.Not everyone from the upper crust looks towards others as low. Many people have broken the stereotype by uplifting the poor &amp; working for their well-being.Though many countries are democratic which means equal rights for all yet it has been seen that the upper crust get added privilege in one way or the other."
    },
    "call the shots": {
        "idiom_name": "call the shots",
        "idiom_meaning": "to be in charge of what is happening and what should happen;take the initiative in deciding how something should be done;act as the authority and choose how things are supposed to be conducted;when one is in power and wants to mandate other people to carry out specific tasks;in situations to show a person is in command and runs the show;",
        "idiom_examples": "The policeman is the one who will call the shots during the political gatherings.Firstborn children are prone to call the shots when it comes to ordering around their siblings.The manager is undoubtedly the one to call the shots in such sensitive matters.The teacher left the class representative with the responsibility to call the shots in class.It is pretty uplifting to be in a position to call the shots ."
    },
    "jump to conclusions": {
        "idiom_name": "jump to conclusions",
        "idiom_meaning": "to predict a situation without having sufficient information;to have a premature estimation or judgement hurriedly;to make (a foolish) decision before knowing it thoroughly;to guess unjustified assumptions in a hurry;to draw inferences too quickly from inadequate clues;",
        "idiom_examples": "Wait till we get the report; don’t jump to conclusions .She is dancing with her father – don’t jump to conclusions !Mark’s wife saw him with her boss at lunch in a restaurant and jumped to conclusions .The fans jumped to conclusions before the team got the final goal.Let’s not jump to conclusions as things might not be as good as they appear on the surface."
    },
    "bone of contention": {
        "idiom_name": "bone of contention",
        "idiom_meaning": "the subject of a dispute;the subject of argument or disagreement;something that people have been arguing about for a long period of time;",
        "idiom_examples": "A serious bone of contention between the landowners and the developers was the compensation price for the land.The fact that Peter did not go to medical school is a bone of contention between him and his father.After my grandfather died his will was a bone of contention in the family.Playing game on new smartphone is a real bone of contention between two sisters.That beautiful girl has now become a bone of contention between two best friends of the college."
    },
    "lose touch": {
        "idiom_name": "lose touch",
        "idiom_meaning": "fail to keep in contact;to be unable to communicate;lose the ability to do something as well as before;no longer able to handle something;lose the talent or skill in something;",
        "idiom_examples": "Michelle was my best friend at the university. But over the years we’ve lost touch .Don’t ever lose touch you always be my best friends.The plane was flying above the Atlantic ocean when it lost touch .He was once a great player, but with age, he has lost his touch .She seems to have lost her touch managing children; they don’t listen to her anymore."
    },
    "miles away": {
        "idiom_name": "miles away",
        "idiom_meaning": "unaware of the current situation;thinking about something else when important issues are being discussed;unconscious of the things that are happening around;to appear distracted;unable to concentrate;",
        "idiom_examples": "Just by reading her facial expressions, I can easily tell you that she is miles away .Sara seems to be miles away – she must be thinking about her home.While I was teaching, I observed that Salina is miles away from the lecture.That meeting was quite important, but you were miles away .You were miles away when I told you that Tom is not feeling well."
    },
    "its not brain surgery": {
        "idiom_name": "its not brain surgery",
        "idiom_meaning": "to indicate that a specific task is simple and easy to undertake ;to mock someone who describes a simple task as involving much more than it really does ;to reassure someone that the subject or task they are being taught is simple and easily understood;",
        "idiom_examples": "Learning to ride a bike is simple, it’s not brain surgery .He’s acting like figuring out where the trash goes is a huge achievement, but it’s not exactly brain surgery .I can’t believe I had to show her how to use a chequebook, it’s not brain surgery .Everyone knows if you don’t drink enough water, you’ll get dehydrated, it’s not brain surgery .If you can’t figure it out let me take a look, it’s not like it’s brain surgery ."
    },
    "fan the flames": {
        "idiom_name": "fan the flames",
        "idiom_meaning": "make a bad situation even worse;say or do something to make someone angrier or more incensed than they already are;stir up, create or inflame strong feelings (anger, hate, love);exacerbate or aggravate an explosive reaction;cause or incite strong emotions (usually negative but not always);",
        "idiom_examples": "The president’s racist comments are really going to fan the flames of hatred among the crowd.She had fancied Karl for ages, and when he smiled at her, he fanned the flames even more.The fat cats at the bank get a massive yearly bonus, and it fans the flames of anger amongst the customers who lost money in the crash.He said this fanned the flames of separatism into a raging fire.The pandemic has fanned the flames of hate among communities."
    },
    "in cold blood": {
        "idiom_name": "in cold blood",
        "idiom_meaning": "in a cruel way and without pity or other emotion;in a deliberately unfeeling manner;heartless;without remorse;unemotionally calculated;",
        "idiom_examples": "One young lady was shot dead in cold blood inside the premises of the shopping complex.The Mafia Don killed the traitor in cold blood .Truman Capote’s classic novel “ In Cold Blood ” is about a family’s murder in Kansas.The renegade shot the security guard in cold blood .A murder executed in cold blood exhibits sociopathic tendencies."
    },
    "in the bad books": {
        "idiom_name": "in the bad books",
        "idiom_meaning": "out of favour;to be in disgrace;in a situation when someone is disliked;in a state in which one is mistreated;If you are in someone’s bad books, they are angry with you;",
        "idiom_examples": "Maria remains in his bad books after the argument between both.My son was in everyone’s bad books right from the first day of school.Jenny is in the bad books of the team because of her bad behaviour.I littered the house with rubbish yesterday. Therefore I’m in Mom’s bad books now.John does something stupid, and now he’s in my bad books ."
    },
    "brown study": {
        "idiom_name": "brown study",
        "idiom_meaning": "melancholy mood accompanied by deep thought;preoccupied;a moody daydream;not paying attention or concentrating on the matter in hand;intense, or deep absorption in own thoughts;",
        "idiom_examples": "I realised that Sandra wasn’t concentrating on what the boss was saying and had disappeared into a brown study .Jack was lost in a brown study and had been like that all day.Chloe was so engrossed in a brown study that she didn’t hear the doorbell.He was so deep in a brown study on his way home that he missed his turning.Tanya often finds herself in a brown study , that is, in a state of deep (and usually gloomy) meditation."
    },
    "at daggers drawn": {
        "idiom_name": "at daggers drawn",
        "idiom_meaning": "almost ready to fight;when two people are very upset with each other;to be in a state of open hostility;when two people do not trust each other;to be prepared to fight someone or something (like another country);",
        "idiom_examples": "The two schools have been at daggers drawn for months. Ever since they played in the championship game.John and his father have been at daggers drawn for years. Nobody knows why they are so hostile towards each other.The countries are at daggers drawn about the use of the canal that they share.The two companies are at daggers drawn over the new software that is going to revolutionize their industry.The two neighboring countries have several times been at daggers drawn over – extraction of the natural resources from the ocean."
    },
    "sacred cow": {
        "idiom_name": "sacred cow",
        "idiom_meaning": "something that people believe or accept as true without questioning it;being unreasonably immune from criticism or opposition;an institution, idea, or custom that is held to be above criticism;something that people do not like to question;a taboo subject;",
        "idiom_examples": "The journalist esteemed too many sacred cows .The old governmgent program has become a sacred cow .Christianity is a sacred cow among many people.The priest was considered a sacred cow among his congregants.They couldn’t dare oppose the sacred cow of legislative democracy."
    },
    "do ones bit": {
        "idiom_name": "do ones bit",
        "idiom_meaning": "to do a share of a task ;to make an individual contribution to an overall effort;to make a small but expected contribution to a larger goal;to share in a small part of a responsibility to achieve something important;",
        "idiom_examples": "When people can “ do their bit “, they are helping support a larger cause.We can achieve more together when each person can do their bit .The local blood bank called on everyone to do their bit by donating blood on Friday.If survival is a serious matter, everyone must do their bit .She always tries to do her bit to make the world a better place."
    },
    "take heart": {
        "idiom_name": "take heart",
        "idiom_meaning": "to stay confident and positive;to be happy about something;to find happiness in something;to encourage something;to get comfort and courage from something ( take heart from );",
        "idiom_examples": "We lost the elections – it is a part of the game. But we absolutely take heart in the apparently greater awareness and involvement of the young generation in keeping the spirit of democracy.As a teacher, you should take heart from your class’s better average performance this year.Oh, kiddo! Take heart ! There is still time left for the results.I take heart from the positive medical test results. I’ve been worried dead ever since the feverish symptoms started showing.Take heart buddy! There’s a good chance we get to go on that trip once we have our exams done with."
    },
    "go out with": {
        "idiom_name": "go out with",
        "idiom_meaning": "have a romantic relationship with someone;go out on a date with someone;date someone regularly;",
        "idiom_examples": "Sue and Rob had been going out with each other for five years before they finally decided to get married.Do you know whether Mike is still going out with Sally? Or have they finally decided to stop seeing each other?My friend had been going out with this girl for quite sometime, but unfortunately it did not work out and now they’ve broken up.Do you think he is the right person for you? How long have you been going out with each other?I know Katy and Greg used to go out with each other, but i don’t know what’s up with their relationship now."
    },
    "the best is yet to come": {
        "idiom_name": "the best is yet to come",
        "idiom_meaning": "whatever is happening now will be surpassed by something better in the future;the best things has not come, but it will;the opposite is  the worst is yet to come , it means that even though it is bad now it will become worse;people often say the best  has  yet to come, but it is not grammatically correct;",
        "idiom_examples": "I am glad that you are enjoying your holiday, the best is yet to come .Leaving high school has been tough but I know that the best is yet to come .Their team has won every game this season, but the coach promises that the best is yet to come .The days are becoming warmer, but the best is yet to come .I have the flu and feel terrible, but the worst is yet to come . (Opposite example)"
    },
    "white lie": {
        "idiom_name": "white lie",
        "idiom_meaning": "a harmless lie;a small or unimportant lie;a lie that that is meant to spare someone’s feelings;to lie about a small or unimportant matter;",
        "idiom_examples": "Telling your friend that you like their new haircut, when you really don’t, is an example of a white lie .Sometimes it is better to tell a white lie than to hurt someone’s feelings.You should not be worried about your son’s white lie .Sometime, even a white lie may disturb your married life.Sara’s white lie led an innocent young man to his death."
    },
    "silver lining": {
        "idiom_name": "silver lining",
        "idiom_meaning": "sadness or unpleasant things\ncan have a positive side effect;each negative situation can be\npositive eventually;there may be an advantage to a\nhopeless event;your good fortune might not be\napparent at the moment;the situation may seem bad now\nbut can turn for the better;",
        "idiom_examples": "If it’s the tough time in your life, it comes with many silver linings .Always be optimistic and look for the silver-lining .He had to have major surgery last year, but he met the love of his life while he was in hospital. She’s a nurse. Every cloud has a silver lining .I thought I had no money for lunch, but then I found £5.00 in the bottom of my bag. Every cloud has a silver lining .They say every cloud has a silver lining . If I’d caught the first train, I would have been held up for 3 hours. Thank goodness I waited for the second one."
    },
    "bite off more than can chew": {
        "idiom_name": "bite off more than can chew",
        "idiom_meaning": "try to do more than one is able to do;undertake a promise one cannot accomplish;attempt to do something which is hardly achievable;to start or promise something to do more than one can accomplish;",
        "idiom_examples": "By accepting two part-time jobs, he is clearly biting off more than he can chew .It feels like I bit off more than I could chew when I promised to complete this worksheet in one day.I would like to suggest you that don’t bite off more than you can chew by accepting the job in Alaska while winters.The anaconda bit off more than it could chew . It just killed a big cattle but couldn’t swallow it.I am sure, she is biting off more than she can chew by promising to solve the difficult puzzle in few minutes that I couldn’t since last three days."
    },
    "going to hell in a handbasket": {
        "idiom_name": "going to hell in a handbasket",
        "idiom_meaning": "in extremely bad state and becoming worse;headed for complete disaster;deteriorating rapidly;",
        "idiom_examples": "With corruption and malpractices everywhere, the political leadership seem to be going to hell in a handbasket .The security arrangement at the stadium was pathetic and the whole place went to hell in a handbasket as the people in charge looked on.The company was rapidly going to hell in a handbasket when the chairman and some top officials were accused of fraud.The fortunes of the club did not change with a change in management and soon they were going to hell in a handbasket .Many believe that if that candidate wins the elections, the country would soon be going to hell in a handbasket ."
    },
    "rocket science": {
        "idiom_name": "rocket science",
        "idiom_meaning": "something very difficult to understand;something that’s not simple to do;something overly complex;the scientific study of building rocket and spacecraft ( literal meaning );",
        "idiom_examples": "I’ve no idea why Kelly can’t make a spreadsheet, and it’s not exactly rocket science is it?Why is the staffing rota always changing? It’s not rocket science to fix shifts for seven people.The teacher insists that we can understand fractions. Apparently, it’s not rocket science .It’s not rocket science to work out that emails from someone you don’t know asking you to click the link, are obviously scams.The Space Launch System’s (SLS) development by NASA proves that rocket science is a term that describes something that is truly difficult for a reason."
    },
    "chip off the old block": {
        "idiom_name": "chip off the old block",
        "idiom_meaning": "the term is used to describe people who look like their parents;someone who is similar to one’s parents in behavior, character, or personality;someone who has a personality that is strikingly similar to their father or mother’s;",
        "idiom_examples": "Like his brother, he is a chip off the old block , very rude in behavior and stout in physique.Jane’s daddy is a great cook, and she is a chip off the old block .Stephen is a chip off the old block . He’s a good football player, just like his father."
    },
    "king of the hill": {
        "idiom_name": "king of the hill",
        "idiom_meaning": "be the undisputed champion;be the leader in your chosen field;children’s game;person in charge;a successful person;",
        "idiom_examples": "He made £3 million before he was 30, so he is the king of the hill in this industry.She waited years for her novel to be printed, and now someone has bought the film rights, so she’s the king of the hill finally.It’s going to be hard to beat the reigning kings of the hill . They are invincible.Jack fell over when they were playing king of the hill at school today. He’s got a big purple bruise on his knee.It seems like Mo Farah is the king of the castle so far with a huge £300k pay packet before the show has even started."
    },
    "the ball is in your court": {
        "idiom_name": "the ball is in your court",
        "idiom_meaning": "the initiative for taking action lies with somebody;to initiate action now lies with the party that has the ball in their court;it refers to the person who is responsible for making the next move, whether in an activity, game, incident or event;the responsibility of taking action lying with someone;",
        "idiom_examples": "We did what we could, and now the ball is in your court .The entire family has stood by his decision to move to another country but the ball is in his court if he decides to change his mind at the last minute.I think I’ve done more than enough to save our marriage. The ball is in your court now.I have already agreed to meet this guy to hear his proposal out, but he did not show up in time. The ball is still in his court .She had initiated the conversation, but the ball is now his court if he wants to consider her marriage proposal."
    },
    "by the skin of your teeth": {
        "idiom_name": "by the skin of your teeth",
        "idiom_meaning": "barely manage to do something;narrowly succeed in doing something;manage to do something by the smallest margin;",
        "idiom_examples": "We managed to complete the project on time by the skin of our teeth.After being chased by the police a long way, the criminal managed to escape by the skin of his teeth.He made the final cut off list of the university by the skin of his teeth.I managed to pass the exam by the skin if my teeth.He slipped at the edge of the cliff but managed to hold on to a rock, and was saved by the skin of his teeth."
    },
    "light years away": {
        "idiom_name": "light years away",
        "idiom_meaning": "when something seems unlikely to happen;too far in distance;something which is not expected to happen within\na given amount of time;a very long time duration;",
        "idiom_examples": "The technological advancement like flying cars is light years away .A solution to this problem is still light years away .Some people say that British education system is light years away of the American education system.The competition is not that tough. In fact, they are light years away .At that time it seemed light years away , but now I am married and have my own family."
    },
    "big brother": {
        "idiom_name": "big brother",
        "idiom_meaning": "A large organization or government agency that tries to control all aspects of human life and society;An entity that is the personification of a totalitarian state; someone who personifies the totalitarian state;Big Brother also refers to surveillance cameras or CCTV;",
        "idiom_examples": "You need to aware of everything you do around here. Big Brother sees everything.Big Brother says we have to get this done by tomorrow, or else.I don’t make the rules. Big Brother does.Big brother is here, and he’s most likely watching every one of us.The Teachers and the industrialists have complained against the “ Big Brother ” approach of the government."
    },
    "jump on the bandwagon": {
        "idiom_name": "jump on the bandwagon",
        "idiom_meaning": "to start doing something because it is fashionable or profitable;the act of joining others in support of something that is likely to be successful;aligning yourself with something that is fashionable;to join a cause or movement as it grows in popularity;",
        "idiom_examples": "get on the bandwagonclimb on the bandwagon"
    },
    "lighten up": {
        "idiom_name": "lighten up",
        "idiom_meaning": "to take it easy;to relax;used to express to be not serious;change of a mood in a positive manner;to lower down the intensity of\nunhappiness;",
        "idiom_examples": "Just lighten up ! Everything will be fine.Lighten up ! I\nwas kidding and stop worrying about what I said yesterday.You need to lighten up your mood a bit otherwise Jim will think that you’re\njealous of his success.Taylor was trying to lighten up her speech by using ironic\nquotes.To improve our health and to get rid\nof all the depression, we must learn to lighten\nup daily."
    },
    "feather in your cap": {
        "idiom_name": "feather in your cap",
        "idiom_meaning": "It means to have an achievement in your name;It symbolizes honor and integrity of an achievement;",
        "idiom_examples": "Ruth scored the last goal for her team, adding a feather in her cap.He will have one more feather in his cap after he has finished this incredibly difficult assignment.They can claim this feather in their cap since it was this group of soldiers who withstood the enemy in such harsh conditions.One does not get chances to add a feather in their cap too often. So the opportunity to do so should be utilized well."
    },
    "spill the beans": {
        "idiom_name": "spill the beans",
        "idiom_meaning": "disclose a secret or reveal something prematurely;unintentionally reveal a secret, often spoiling a surprise;to tell someone about something that should have been a secret;inadvertently divulge something you shouldn’t;disclose private information, sometimes maliciously;",
        "idiom_examples": "Lauren finally spilled the beans . She has been promoted to manager, and it’s going to upset some people in the office.Have you heard that Mike is having an affair with his secretary? His colleague just spilled the beans .If you see Patsy at the weekend, get her to spill the beans on her date with Carl.We had managed to keep the party a secret from Bill until Katy spilled the beans yesterday.We didn’t want to reveal the gender of the baby, but I spilled the beans to my mother that we were painting the baby’s room blue."
    },
    "a fish out of water": {
        "idiom_name": "a fish out of water",
        "idiom_meaning": "being uncomfortable and restless;falling into the state of confusion;to feel awkward due to a specific/strange\nsituation;being in an unusual situation;not feeling relaxed;",
        "idiom_examples": "Our new teacher looked like a fish out of the water , nobody was aware of the issue.We had no clue how to make Phil comfortable with\nthe new management. He was looking like a\nfish out of the water .Sara has certainly not looked like a fish out of water in the mathematics\nlecture, since she is taking some online classes to improve her concepts.Martin had never been to a supermarket before,\nso he was looking like a fish out of\nwater when his mother asked him to bring some stuff to cook."
    },
    "in the cahoots": {
        "idiom_name": "in the cahoots",
        "idiom_meaning": "to do something in hiding or secret because it is morally or socially not acceptable;in league, but usually referred as a negative thing;a disreputable partnership;",
        "idiom_examples": "It is usually the close circle of celebrities who are in the cahoots with the paparazzi. This is how celebrity outings are caught on tape so often.The lawyer was in the cahoots with the criminal in this case. It is unfortunate that they won the case.The businessman bought the stocks after market in the cahoots with some dealers who promised to get him rid of black money.It is speculated that the man was in the cahoots with the killer of his wife but the police have no evidence to back this claim yet.She is in the cahoots with her family to show him down."
    },
    "break new ground": {
        "idiom_name": "break new ground",
        "idiom_meaning": "to do something innovative;pioneer;discover;invent;make progress ;",
        "idiom_examples": "Advancements in computer technology break new ground almost every day.George Washington Carver would ironically break new ground by pioneering the practice of crop rotation.Just by waking up today and being present, you are actively breaking new ground .Albert Einstein’s Relativity, paired with Sir Isaac Newton’s Principia, broke new ground , paving the way for physics as we know it today.It is an interesting discovery in the energy conservation field in the United States that definitely breaks new ground in the country’s energy program."
    },
    "take a cue from": {
        "idiom_name": "take a cue from",
        "idiom_meaning": "to do what is recommended by someone else;follow the lead of another;to be highly influenced by someone or something;to use someone else’s experience as your guide;",
        "idiom_examples": "I’m not good at belly dance, so I’ll take my cue from you.Take a cue from the professionals and start your business as soon as possible.Take a cue from your friend and learn how to enjoy life.I don’t know how to cook the rice. I need to take my cue from you.She is a fresher web designer and takes her cue to design a new website from her senior web developer."
    },
    "break open": {
        "idiom_name": "break open",
        "idiom_meaning": "to cause something to open suddenly, especially from within;to open something using force;",
        "idiom_examples": "The violent storms shook the very foundation of the house and broke open the doors.The heavy rainfall caused the seeds of the flower to break open .Sam broke open the trap doors to free the wounded men.When there is a fire and you are trapped, you have to break open the windows in order to escape.To avoid drowning, Peter broke open the windows of the car after the car plummeted into the river."
    },
    "come to blows": {
        "idiom_name": "come to blows",
        "idiom_meaning": "to start fighting;to get into a fight or a serious argument with someone;used to refer to the beginning of a fight between two groups or parties;",
        "idiom_examples": "I’m glad we were able to resolve this disagreement without coming to blows .While visiting family in Scotland, my uncle came to blows with my grandfather over who was the better singer.I was surprised to see my husband and his ex-wife come to blows at their son’s baseball game.Come on, let’s not come to blows over this issue. You need to realize that I am right about this one!If you don’t back off about my choice of clothing, we’re going to come to blows ."
    },
    "the brains behind": {
        "idiom_name": "the brains behind",
        "idiom_meaning": "used to refer to the person who originally invented a particular scheme, plan or idea;be the person who plans and organizes something, especially something successful;",
        "idiom_examples": "Gladys was the brains behind the successful birthday party that left all the children smiling on their way back home.The head of the criminal mob is the brains behind the recent bank robberies in the city.Julia was the brains behind many great initiatives by the government.As the brains behind the company’s escalating progress, Matt believes in delivering exclusive services for his clients."
    },
    "stand your ground": {
        "idiom_name": "stand your ground",
        "idiom_meaning": "not retreat;stay where you are when threatened;refuse to change your mind/opinion;to not to withdraw;relating to self-defence law (in the US);",
        "idiom_examples": "We stood our ground on the footpath, and then eventually, all the cows moved away.Moira’s son wanted her to move in with him after her husband died, but she held her ground and stayed where she was.The council wanted to widen the road, but the shop owners stood their ground , and they won in the end.The school bully came up to George and threatened him, but he held his ground even though he was petrified.Stand your ground and do not surrender on values or sovereignty."
    },
    "cross swords": {
        "idiom_name": "cross swords",
        "idiom_meaning": "to fight with another person physically or verbally;to get engaged in combat;to duel;to argue violently or quarrel with another person;to get in a dispute with another person;",
        "idiom_examples": "The vice-presidents crossed swords at all policy meetings.He crossed swords with his boss over overspending.They crossed swords on many occasions over nothing in particular.He always looked forward to crossing swords with his brother.My friend and I crossed swords over homework."
    },
    "rabbit hole": {
        "idiom_name": "rabbit hole",
        "idiom_meaning": "mentally go somewhere surreal or strange;enter a chaotic or problematic situation;be on a journey or process that is complex, confusing or difficult;get sucked into a weird situation;a weird, bizarre, or senseless situation, from which it is difficult to disengage;",
        "idiom_examples": "Peter is having another one of his parties on Friday. Time to go down the rabbit hole again.Research is a rabbit hole for me. I’m not too fond of it.I spent so long reading about the history of the Soviet Union online that I fell down a rabbit hole . So, I’m super tired today.He slid down a rabbit hole last night on the internet. Once he started searching, he couldn’t stop.She just went on Facebook to check her status and fell down a rabbit hole and lost track of time."
    },
    "zonk out": {
        "idiom_name": "zonk out",
        "idiom_meaning": "to fall asleep very promptly;to fall asleep, mostly because of physical tiredness or the influences of drugs or alcohol;to lose consciousness from exhaustion, or intoxication, etc;",
        "idiom_examples": "After a very hard-working day, she zonked out .Some babies get frustrated easily and tend to zonk out .It’s good to read a book when you’ve had a long day and want to zonk out .Some drinks in the evening may help you hurriedly zonk out , but they also may wake you up hours later.The neck pillows are helpful for kids to zonk out if they’re traveling or away from their bed."
    },
    "clarion call": {
        "idiom_name": "clarion call",
        "idiom_meaning": "A clarion is a high-pitch bugle;A strong and clear request for people to do something;In a literal sense, the call to battle is issued by such an instrument ;Used in the figurative sense, a call to take up a task or pursue a project;The idiom metaphorically ascribes the characteristics of a bugle to a spoken command or statement, indicating that it was issued loudly and clearly ;",
        "idiom_examples": "All of the citizens heard the clarion call and prepared themselves to defend their city.None of the board members could ignore the clarion-call of the chairman’s directive.When I heard that my mother had decided not to go to the party, I issued a clarion call to my brothers and sisters; subsequently, they convinced her to attend.The clarion call for additional donations from social leaders has elicited a swift reaction."
    },
    "get the wrong end of the stick": {
        "idiom_name": "get the wrong end of the stick",
        "idiom_meaning": "to understand something in the wrong way;false interpretation;to not understand the situation in the right manner;getting the incorrect part;misconstrue;",
        "idiom_examples": "When Jack and Taylor arrived at the award function together, everyone got the wrong end of the stick .You got the wrong end of the stick – I never meant that.I think I get hold of the wrong end of the stick maybe she was pointing out someone else,not me.You’ve got the wrong end of the stick , she is not going abroad, and I am going instead."
    },
    "birds of a feather flock together": {
        "idiom_name": "birds of a feather flock together",
        "idiom_meaning": "to form groups with people with similar interests and tastes;people of the same flavour or interest get together in groups;",
        "idiom_examples": "The team is divided into people from the same region batting against each other. Birds of a feather flock together .The lawyers who attended the seminar were like birds of a feather flocking together . They have not even spoken to anyone outside their group.Hey, Mom, I want to visit my grandmother’s house. I want to play with kids there. You know, birds of a feather flock together .I love to talk to people who know about computers. Do you know why? Because birds of a feather flock together .Every evening, many drinkers get together in a bar near our home. You know, birds of a feather flock together ."
    },
    "ward off": {
        "idiom_name": "ward off",
        "idiom_meaning": "to prevent something from harming you;to prevent something from happening (often used when trying to keep from getting ill);defend against;protect against;deflect;",
        "idiom_examples": "Our government has doubled the number of soldiers at the border to ward off illegal immigrants.Don’t forget to take your umbrella to ward off the rain, Peter. It is horrible outside.I have changed my diet in order to ward off a cold this winter. I am having a lot of fresh fruit and vegetables.I have to take this medicine to ward off an infection. I have a bad cut from falling off my motorcycle.I have tried everything possible to ward off the crazy girls who keep texting me."
    },
    "ballpark figure": {
        "idiom_name": "ballpark figure",
        "idiom_meaning": "to be near about the exact (usually in amount);an estimate of what the actual figure will be like;",
        "idiom_examples": "The management was given a ballpark figure at the very beginning of the presentation.She manages to give her father a ballpark amount that she would need every week.I have donated this ballpark figure to the children’s aid this morning.Even a ballpark figure to this number is going to hurt our overall numbers very badly this quarter.I save a ballpark figure of 20% from my salary every month as something for the rainy day."
    },
    "yellow streak": {
        "idiom_name": "yellow streak",
        "idiom_meaning": "people who have an inclination towards being fainthearted;referring to a cowardly trait in a person’s temperament;a fault or a weak trait in a person’s disposition;used for people who aren’t courageous;",
        "idiom_examples": "Ginna’s got a yellow streak which shows up the moment she is asked to stand up against Nick.Why don’t you just go and get rid of the yellow streak , huh?“Hard luck for the people who have a yellow streak because we will show no mercy today soldiers!”Why don’t you show these people that even a person with a yellow streak like your’s can trek through this mountain terrain?“I need to get rid of this yellow streak somehow,” she muttered, wiping the tears in her eyes."
    },
    "sea change": {
        "idiom_name": "sea change",
        "idiom_meaning": "to have a big change in perspective;to undergo a complete transformation;a striking change in appearance;",
        "idiom_examples": "There was a sea change in his personality after he married his wife.“And that these hearings are the beginning of a real sea change in the relationship between the government and technology.”We have just been bought over by a new company. It seems as if a sea change is in store for our marketing department.Since she started working out there has been a sea change in her appearance."
    },
    "on demand": {
        "idiom_name": "on demand",
        "idiom_meaning": "when needed;when asked for;to ask for with the proper right;claim as a right;at any time that you want or need something;",
        "idiom_examples": "These days babies are normally fed on demand .Oil prices drop on demand worries as Coronavirus cases rise.Ronnie is always ready to dance on demand .Uber will manage an on-demand service for Marin County in the San Francisco Bay area with a Software.The fee is payable on demand ."
    },
    "its a small world": {
        "idiom_name": "its a small world",
        "idiom_meaning": "meeting someone not expected to be at a certain place;encountering the same people, events, or situations in an unexpected place;someone knows a person you know;used to express surprise that events or people at different places are somehow connected;a water-based boat ride located in the Fantasyland area at the various Walt Disney Parks and Resorts worldwide;",
        "idiom_examples": "I had no contact with him since school, and I bumped into him at a friend’s party! It’s a small world .My old English teacher is your aunt? Well, it’s a small world indeed!Fancy running into you here. I thought I would never see you again! It’s a small world .Do you know my friend from school? Wow, it’s a small world , isn’t it?Imagine meeting her at the theater last night. It’s a small world ."
    },
    "lower the bar": {
        "idiom_name": "lower the bar",
        "idiom_meaning": "to lower standards or expectations;to set simple rules than previous ones;to make something easier;",
        "idiom_examples": "The revision bill aims to lower the bar on picking candidates.We have played on a par with any opponent so far. We can’t lower the bar.It’s okay to lower the bar right now, not because we don’t have high standards, but we need a break.She was not ready to lower the bar of expectation just yet.Scientists decided to lower the bar on the Covid-19 vaccine potential to avoid fatal side effects."
    },
    "spick and span": {
        "idiom_name": "spick and span",
        "idiom_meaning": "neat and clean;fresh and new;spotless, tidy, and organised;",
        "idiom_examples": "The house was spick and span when the guests arrived. Jane must have been cleaning for hours.The office is always spick and span first thing in the morning and gets steadily messier as the day goes on.My aunt’s house is so spick and span that you hardly dare sit down in case you crease a cushion.She ensures that her house and kitchen are spick and span .Automatic vacuum cleaners are a blessing when it comes to keeping your house spick and span ."
    },
    "drive up the wall": {
        "idiom_name": "drive up the wall",
        "idiom_meaning": "to make someone angry or irritated;to annoy someone;infuriate someone;to make someone irrational;",
        "idiom_examples": "This stagnant traffic and constant honking is driving me up the wall.The loud music played by my neighbours is driving me up the wall.This question is driving me up the wall. Try as I may, I cannot find the right answer.He quit his job because his boss’ constant criticism was driving him up the wall.His tuneless singing and drumming on the table drives me up the wall."
    },
    "bat an eye": {
        "idiom_name": "bat an eye",
        "idiom_meaning": "to avoid expressing surprise , fear, or shock;not to be surprised or worried when something surprising happens;to appear unsurprising or unabashed by something;to show a subtle emotional response, such as surprise, irritation, grief, excitement, and so on;to hardly notice something;",
        "idiom_examples": "The man didn’t bat an eye when the explosions went off around him and bullets zipped past his head.The guy didn’t bat an eye when the pretty woman was trying to get his attention.When the father beat his child with the belt, the kid didn’t even bat an eye while he was being struck.When the judge declared him guilty of murder, the accused stood there without batting an eyelid .While she is meticulous about keeping her home clean, she doesn’t bat an eyelid about littering in public places."
    },
    "take for a ride": {
        "idiom_name": "take for a ride",
        "idiom_meaning": "to trick\nsomebody;to lie to\nsomebody to deceive them;to abduct\nsomeone with the intention of murdering them;",
        "idiom_examples": "I paid for\nthe package but it was never delivered. After two weeks I realized that I had\nbeen taken for a ride .I paid him\n$3000 as a deposit but he still has not fixed my car. I think he has taken me for a ride.His new\ngirlfriend is taking him for a ride .\nShe is not as sweet as she looks.When his\nboss found out that he had stolen the drugs, he was taken for a ride . He never returned."
    },
    "time puts everything in its place": {
        "idiom_name": "time puts everything in its place",
        "idiom_meaning": "time is persistent; as it passes eventually, everything goes back to its original state or place;recovery and restoration process requires time to take place;used to say problems, sadness, feelings, and frustrations eventually go away as time passes;sometimes the way things are does not seem to make sense, but with time everything becomes clear why things turned the way they were in the first place;",
        "idiom_examples": "After my breakup with Judy, I couldn’t understand why things had to end so tragically, but I now understand time puts everything in its place in my new relationship.My new relationship with Judy is pure happiness; indeed, time puts everything in its place .After six years of struggling, I finally got the job of my dreams, and now I’m convinced beyond doubt, time puts everything in its place .Things are not very good between Marina and her husband, but she is still optimistic and always says that time will put everything in its place .Geraldine Bazin has become an example for millions of women about how life continues after a breakup and how time puts everything in its place . Today, she is a well-known international star."
    },
    "big gun": {
        "idiom_name": "big gun",
        "idiom_meaning": "a very powerful individual;having a lot of power;an influential person;being very successful ;",
        "idiom_examples": "He is a big gun at the law firm; he has never lost a single court case.The big guns of football are planning to build five new state-of-the-art stadiums.If you manage to go past the group stage, you’ll have the opportunity to showcase your talent to the big guns .There’s nothing we can do for now until the big guns guide us on the way forward.If you surround yourself with the big guns of crypto trading, you’ll surely become successful."
    },
    "call of duty": {
        "idiom_name": "call of duty",
        "idiom_meaning": "something you must do or feel compelled to do;to do something that is morally right;the feeling that you must do something because it is your duty;a requirement or expectation;a duty with no chance of reward;",
        "idiom_examples": "Both of my grandfathers felt it was their call of duty to enlist immediately for active service when the war broke out.Her efforts to keep the peace went beyond the call of duty .Sam really went above and beyond the call of duty when he dived into the sea to save that drowning dog.They went beyond the call of duty to get their new business off the ground.She was an inspiration to others and dedicated far beyond the call of duty ."
    },
    "on the ball": {
        "idiom_name": "on the ball",
        "idiom_meaning": "alert to new trends, ideas, and methods;knowledgeable and competent;alert, in command of senses, attentive;understands the situation well;quick to understand and react to a situation;",
        "idiom_examples": "The mother is glad to know that her son is always on the ball to learn new things in class.I’ve been working for the last three days in a row , and now I am dog tired , so not really on the ball today.He was right on the ball regarding his assessment of the situation.I couldn’t sleep well last night, so am not on the ball today.When his opponent tried to sneak in a pass, the defender was right on the ball and stopped it well."
    },
    "leaps and bounds": {
        "idiom_name": "leaps and bounds",
        "idiom_meaning": "progress very quickly;grow or increase rapidly;get better or improve in a short time;",
        "idiom_examples": "Regan’s reading skills are coming on in leaps and bounds with the new teacher.I planted some seedlings last month, and they have grown by leaps and bounds after all the recent rain.My puppy has grown leaps and bounds since I’ve started giving him dietary supplements.When Moss lived in Paris, his command of French increased by leaps and bounds .The IT market is expected to grow with leaps and bounds in the upcoming years."
    },
    "pep talk": {
        "idiom_name": "pep talk",
        "idiom_meaning": "a\nmotivational speech;a\nspeech intended to make someone feel more courageous or enthusiastic;an\ninfluential talk;a\nshort conversation to build high spirits;",
        "idiom_examples": "Last night, I met Sara for a pep talk because I had my interview the very next day.I was supposed to meet my counselor for a pep talk .The principal gave the students a pep talk this morning, in the assembly, to boost up their confidence.Alex is confused – I think he needs a pep talk .The coach was supposed to give us a final pep talk before the beginning of the match."
    },
    "devils advocate": {
        "idiom_name": "devils advocate",
        "idiom_meaning": "one who presents a counter argument;one who argues against something just for the sake of arguing, without actually being committed to the views;one who puts forward arguments against a proposition, even if they may actually agree with it, simply to test the validity of the proposition;someone who pretends to be against an idea or plan that many agree with, so that people may discuss it and consider other views;a person who disagrees with others solely for the sake of having a discussion on the issue;",
        "idiom_examples": "I agree with what you say, but I’ll play devil’s advocate so that we can cover all the possibilities that may arise.He offered to play devil’s advocate and argue against our case so that we could find out any flaws in it.The schoolmaster often played devil’s advocate with his students so that they could have an interesting discussion and look at other point of views.The plan is good, but I’ll play devil’s advocate so that we know what the opposition can say.The defence lawyer played devil’s advocate , explaining that the truth could be the opposite of the way it looked, but the judge wasn’t having it."
    },
    "brownie points": {
        "idiom_name": "brownie points",
        "idiom_meaning": "Praise or appreciation, usually for a service someone has done;Credit for a good deed;Imaginary credit for doing something well;Earned credits towards one’s good standing;Good marks for credit;",
        "idiom_examples": "He picked up some brownie points with his manager by doing part of her report for her.By cleaning up the sidewalks, Mark earned brownie points in the eyes of the whole neighbourhood.I’m not going to put myself through that much trouble just to pick up a few brownie points in the office.Janet earned some brownie points in the PTA by volunteering to head up the next fundraising drive.You’re not going to get many brownie points for submitting a report like this."
    },
    "busy as a beaver": {
        "idiom_name": "busy as a beaver",
        "idiom_meaning": "work very hard and actively;to be intensely engaged in methodical and diligent work;a simile derived from the fact that beavers spend a significant amount of time felling trees and building their dams;the phrase can be contrasted with the related idiom, “ busy as a bee ,” which implies quick or rapid work However, in practice, both have come to simply mean actively working;",
        "idiom_examples": "I often find my husband in the garage, busy as a beaver , working on some new project.I have been busy as a beaver , working to complete my thesis prior to graduation.Although they are clearly enjoying themselves, the children are as busy as beavers , constructing their pretend fort.Ahead of Christmas, she worked like a beaver to clean out all the closets.My dad has to work like a beaver to buy a new house."
    },
    "by hook or by crook": {
        "idiom_name": "by hook or by crook",
        "idiom_meaning": "by any possible means;achieve something by any method available;reach your goal by any way necessary, be that good or bad;",
        "idiom_examples": "The farmer will not sell us the land. By hook or by crook , he is hanging on to it.I have never met such a stubborn child. By hook or by crook , he will not apologise when he is naughty.Ken is determined to hang on to his old banger of a car by hook or by crook .She was going to beat this illness by hook or by crook .She ultimately decides that she will win him by hook or by crook ."
    },
    "turn over a new leaf": {
        "idiom_name": "turn over a new leaf",
        "idiom_meaning": "to alter\nyour behaviour in a positive way;to start\nfresh;to change\ncourse;to start\nafresh;to change\ntrack;",
        "idiom_examples": "He has not been in trouble this year. He has really turned over a new leaf .She promises to turn over a new leaf if we give her one more chance.Apparently, he has stopped gossiping and promises to turn over a new leaf this year . I will believe it when I see it.I am starting my new job tomorrow. It feels like I am turning over a new leaf .I know that we have not gotten along very well in the past, but maybe we can turn over a new leaf ."
    },
    "spare someones blushes": {
        "idiom_name": "spare someones blushes",
        "idiom_meaning": "to stop someone from feeling awkward or embarrassed;to stop someone from being humiliated by a situation or circumstance ;to stop someone from saying or doing something embarrassing;to help someone avoid feeling awkward about doing or saying something uncomfortable;saving someone from doing something cringeworthy;",
        "idiom_examples": "My teacher spoke up to spare the blushes of the new student.LeBron James dunked as time ran out to win the game and spare the blushes of the Los Angeles Lakers.John’s big brother saved his blushes by catching him when he fell out of the tree.Stacy decided not to sing so she could spare the blushes of her sister.Eric tried to spare his blushes after falling over the skateboard in the hallway."
    },
    "never in wildest dreams": {
        "idiom_name": "never in wildest dreams",
        "idiom_meaning": "a situation beyond the scope of one’s imagination;something better than the expectations;something that has happened was so strange that one never thought it would happen;extremely strange or unbelievable;",
        "idiom_examples": "Never in my wildest dreams did I think she’d abandon her father.Never in my wildest dreams did I think she’d actually carry out her threat.Not in my wildest dreams could I have imagined Scotland winning 9/1.You could never in your wildest dreams have imagined the winter weather in Canada.Never in my wildest dreams had I imagined that you would win the first prize in the competition."
    },
    "as a result": {
        "idiom_name": "as a result",
        "idiom_meaning": "the outcome of something that you have done;a result of anything that is willingly done by you;the consequence of your own deed;because of the occurrence of something;it is the indication of the effect due to a cause;",
        "idiom_examples": "As a result of this mishap, he was not on work for a week.David twisted his arms and, as a result , he won’t be taking part in the basketball tournament.Tom died as a result of an accident.Several houses were shattered as a result of the heavy storm.Jackson misbehaved with his boss; as a result , he lost the job."
    },
    "alma mater": {
        "idiom_name": "alma mater",
        "idiom_meaning": "the school, college, or university that one attended or in which one has studied;the official  anthem  of a school, college, or university;a metaphorical Latin phrase presently used to identify a school, college, or university that one formerly attended or graduated;Alma mater literally means ‘mother who nourishes or fosters’;",
        "idiom_examples": "He was delighted when he was offered the position of professor of English at his alma mater .Mark visited his alma mater last week.Harvard Law School is the alma mater of former US President Barack Obama.Her alma Mater invited actress Scarlett Johansson to chat with students and encourage them.He enjoyed his four years at his alma mater , but it is time to move on."
    },
    "hit the nail on the head": {
        "idiom_name": "hit the nail on the head",
        "idiom_meaning": "be accurately right about something;find the exact answer;do or say exactly the right thing;to precisely describe the cause of a problem or situation;",
        "idiom_examples": "Stephen hit the nail on the head when he said that what the company was lacking in was clear vision and focus.The foreman hit the nail on the head when he said that the machine had malfunctioned because of a faulty spark plug.“You’ve found the problem, Sid! You hit the nail on the head !”He is a smart debugger. Every time you take a broken code to him, he will hit the nail on the head and tell you the exact problem.He hit the nail on the head when he said that most people won’t change their ways and continue to blame the system for all their ills."
    },
    "lightning fast": {
        "idiom_name": "lightning fast",
        "idiom_meaning": "extremely quick;something that is or moves very fast;to describe something that has a rapid speed;something that happens at lightning speed ;",
        "idiom_examples": "At recess, the boys and girls run lightning fast .This weekend I have an upcoming race and I will run lightning-fast to win the race.Items at the store are selling off the shelves lightning fast due to being on sale.The rain poured down lightning-fast .Once the hot cookies were out of the stove, the family ate them lightning fast ."
    },
    "pat on the back": {
        "idiom_name": "pat on the back",
        "idiom_meaning": "to\nreceive or express praise for a job well done;an expression of appreciation\nor compliment;to congratulate;to grant approval;to show\nyour appreciation;",
        "idiom_examples": "He received a pat on the back from his boss from the new project that he landed.My dad’s idea of a pat on the back was always to let us eat dessert before our meal.You single-handedly organized the fundraiser, Julie. It has been a massive success and you can give yourself a pat on the back .Do you think that you deserve a pat on the back for telling the whole company that I was the one who broke the printer?Father gave son a big pat on the back and a big congratulation after the win."
    },
    "in the blink of an eye": {
        "idiom_name": "in the blink of an eye",
        "idiom_meaning": "in an instant;very quickly;extremely swiftly;in no time ;",
        "idiom_examples": "In the blink of an eye , the robber disappeared from the bank with a bag full of cash.I wonder about how her life has changed in the blink of an eye .Life can change in the blink of an eye .In the blink of an eye , the apple of my eye is one year old.Whole industries are now being turned upside down in the blink of an eye ."
    },
    "run out": {
        "idiom_name": "run out",
        "idiom_meaning": "to not have enough of something;to leave for a short period of time;to leave someone behind (usually a romantic relationship);to expire; to come to an end;",
        "idiom_examples": "I cannot believe that we have run out of milk! Just when I wanted to make a cup of tea.I have run out of patients with him, he still has not completed the task that I gave him.If someone is looking for me, please tell them that I have just run out for a second.I am just going to run out quickly, I need to move my car before I get a parking ticket.I am sorry that you missed John, he will be back soon, he has just run out for some milk."
    },
    "the buck stops here": {
        "idiom_name": "the buck stops here",
        "idiom_meaning": "The responsibility for a situation or a problem with somebody;The saying “ The buck stops here ” is a commitment that responsibility will not be passed on to anyone else;It is used to show that a person is fully responsible for a certain action and will be fully answerable to the outcomes without passing down the responsibilities to a different person;Used to express one’s willingness to entirely face the consequences of a particular decision or outcome;",
        "idiom_examples": "the buck stops withthe buck ends with"
    },
    "all hell will let loose": {
        "idiom_name": "all hell will let loose",
        "idiom_meaning": "a situation suddenly becomes noisy and violent, usually with a lot of people arguing or fighting;describes and outlines what usually happens when destructive and violent events occur;there are high chances that the situation at hand will lead to uproar and confusion among the parties involved;could at times act as a threat to inform someone of the repercussions that would follow depending on the situation;represents an event that turns out to be uncontrollable and noisy as a result of aggressive fighting or quarrelling;",
        "idiom_examples": "All hell will let loose when the caged animals break out of their cages.Regardless of the calmness in the bar, all hell will let loose if a fight between drunkards begins.Do not deny the mob their rights, or else all hell will let loose .In a physical confrontation, the first reaction is what decides whether or not all hell will let loose .Please don’t take her into the party fold, or all hell will let loose ."
    },
    "nail in the coffin": {
        "idiom_name": "nail in the coffin",
        "idiom_meaning": "an action/event that will help bring about the death, end, or failure of something or someone;something that could contribute harm or even destroy the person or thing referred to;",
        "idiom_examples": "She was late for the fourth day in a row. It will be another nail in her coffin when the boss hears about it.Cassandra’s husband has cheated on her again. It must be another nail in the coffin for them.The company lost the contract, and I think it will be the last nail in their coffin as they were already struggling.His lungs were weak from years of smoking, so to catch pneumonia was a final nail in his coffin .The decision to stop killing animals for fashion is yet another nail in the fur trade coffin ."
    },
    "the devil is beating his wife": {
        "idiom_name": "the devil is beating his wife",
        "idiom_meaning": "raining whereas the sun is shining;when the sun is shining yet it’s raining;when it’s raining but the sun is shining at the same time;",
        "idiom_examples": "The sunshower is said to occur when the devil is beating his wife in various German-speaking countries.Today, the devil is beating his wife in our city—it’s raining cats and dogs and the sun is also shining.Yesterday, I witnessed a very rare occurrence known as “ the devil is beating his wife .”People in the Southern United States usually come across a weird natural phenomenon called “ the devil is beating his wife .”Everybody laughed when a kid asked her mom, “Mamma, I want to see how the devil is beating his wife .”"
    },
    "break the ice": {
        "idiom_name": "break the ice",
        "idiom_meaning": "to do or say something that makes people feel more comfortable, especially at the start of a meeting or party;to reduce the tension or unfamiliarity at the beginning of a party, gathering etc;to make people feel more relaxed with each other who have not met before;to start doing something to make people feel relaxed and comfortable at a gathering or in a new situation;an attempt of initiating a friendly environment in a new and unfamiliar situation;",
        "idiom_examples": "Jone suggested playing a party game to break the ice .Everyone was quiet in the hall until she broke the ice by cracking a joke.It’s not always easy to break the ice at a formal meeting.Before leaving the party, I complimented her, “Your cute smile did a lot to break the ice .”To confidently break the ice in any situation, you need to watch this video."
    },
    "play cat and mouse": {
        "idiom_name": "play cat and mouse",
        "idiom_meaning": "to play with or tease someone;trifle or toy with someone;to confuse someone;used to define the suspenseful relationship between one being chased and the chaser;to try to defeat someone by misleading that person into making a mistake so that you have a benefit over them;",
        "idiom_examples": "The cops do not like playing cat and mouse games with the culprits before catching them.The lawyers are playing a deliberate game of cat and mouse to reach sentencing.Watch carefully, they are playing cat and mouse game .It’s just the newest trap in the everlasting cat and mouse game between the guards and thieves.Don’t play cat and mouse with the innocent child."
    },
    "behind bars": {
        "idiom_name": "behind bars",
        "idiom_meaning": "to be in jail or prison;to be incarcerated or imprisoned in a jail or prison;to put someone behind bars means arresting someone and putting them in jail or prison;",
        "idiom_examples": "Before the end of this year, Harrison will be behind bars for his crimes.By now, Jonathan should be behind bars for being found guilty of robbery with violence.The judge swore to put the men behind bars if they were found guilty of raping the old lady.John would still be behind bars were it not for the missing evidence.An offense such as pickpocketing was enough to see him put behind bars for more than four years."
    },
    "red handed": {
        "idiom_name": "red handed",
        "idiom_meaning": "doing or about to do something illegal or wrong;in the act of something dubious or bad;doing something with clear evidence of wrongdoing or guilt;committing or about to commit a crime;",
        "idiom_examples": "They caught him red-handed with his fingerprints all over the murder weapon.She was caught red-handed by a security guard putting items in her pockets.My boyfriend caught me red-handed eating biscuits when I was on a diet.Jack was caught red-handed driving under the influence of drugs.Man caught red-handed peeping into women’s locker room of a gym."
    },
    "cold sweat": {
        "idiom_name": "cold sweat",
        "idiom_meaning": "the condition where extreme fear or nervousness\ncauses a person to feel a chill along with moist skin or sweat;a situation when a person is extremely afraid,\nnervous or anxious;sweating caused by nervousness, fear or sickness;",
        "idiom_examples": "I woke up from a nightmare, breathing heavy and in cold sweat .The hostages were in a cold sweat as they saw the hijacker pointing a gun on the air-hostess.Just thinking about the whole situation makes me break out in a cold sweat .She broke out in a cold sweat as she read the last warning notice from the bank about the loan repayment.Every member of the dysfunctional family was in cold sweat as the lawyer opened the father’s will."
    },
    "drop by": {
        "idiom_name": "drop by",
        "idiom_meaning": "an informal visit;an unexpected visit;call on;go see;come round;",
        "idiom_examples": "I hope to finish the dress before Saturday. If you want to see what it looks like you should drop by over the weekend.I will drop by to pick up my glasses that I left there, last weekend.My parents drop by at least twice a week for supper.You don’t have to phone before you come. We are home the whole day, you can just drop by .I am going to drop by his office to take him lunch."
    },
    "keep your nose clean": {
        "idiom_name": "keep your nose clean",
        "idiom_meaning": "to stay out of trouble by not doing anything wrong;to avoid acts that will make your reputation questionable;",
        "idiom_examples": "By avoiding the drug dealers on the corner street, James was making an effort to keep his nose clean .The officer kept his nose clean by not associating with the known corrupt policemen at the bureau.I have learned that the best way to avoid getting in trouble with the police is to keep one’s nose clean .It is hard for Lisa to keep her nose clean when several members of her family are involved in one crime or the other.Everyone urged Matt to keep his nose clean by avoiding Peter’s company following the warrant issued for his arrest."
    },
    "birds of a feather": {
        "idiom_name": "birds of a feather",
        "idiom_meaning": "people with similar tastes, interests, and backgrounds;people with the same characteristics;people who relate to others and feel safe around them;people with a shared interest;people with shared values;",
        "idiom_examples": "Ethan saw Jason had the same type of car and shrugged, “ Birds of a feather .”Kara and Carly laughed when they saw each other wearing the same outfit and said, “ Birds of a feather .”“Erica, you and I are birds of a feather,” said Tammy.According to the surprising finding of the report, there is no guarantee that people who are birds of a feather will prove to be good life partners."
    },
    "a tall order": {
        "idiom_name": "a tall order",
        "idiom_meaning": "a challenging task or difficult requirement;a very difficult request or job to accomplish;It can also be used to mean that the assignee does not trust the doer to complete a specific task;",
        "idiom_examples": "Telling a player to score six goals in one game is a tall order .Changing one’s negative doings must surely be a tall order , especially if dealing with depression.For Nobita, it is always a tall order to beat Gian.Russia has an extremely tall order to clear against America, and America has all the weapons to make it a hard-fought battle.It was a tall order to expect the company to finish in such a short time"
    },
    "buckle down": {
        "idiom_name": "buckle down",
        "idiom_meaning": "make sure something stays in place;giving a task a hundred percent;to focus;determination to finish a task;to settle;",
        "idiom_examples": "She knew if she didn’t buckle down , the tasks wouldn’t get done.He had a test first thing in the morning, so he buckled down for an all-nighter.It’s unlikely they will buckle down since they are incredibly flighty.When she decides to buckle down , no one can break her concentration.After several hours the toddler finally buckled down and went to sleep."
    }
}